{
  "2025 서강대학교 요람": {
    "여성학 연계전공": {
      "교육목표": "여성학 연계전공은 사회, 역사적으로 구성된 여성, 남성에 대한 성 고정관념을 넘어서 성평등 사회를 구현하기 위해 이 분야의 전문적인 인재를 양성하는 것을 교육목표로 하고 있다. 성(gender, sexuality)에 따른 불평등 문제를 인간과 사회, 문화에 대한 기본적인 전제와 관련하여 탐구하기 위해서 성에 의해 야기되는 다양한 문제를 여러 전공분야를 포괄한 종합적이면서도 간학문적인(interdisciplinary) 연구방법에 의해 접근하는 강의들을 제공한다.",
      "졸업요건": {
        "총 학점": "27학점 이상",
        "필수과목": {
          "과목코드":"GES2002",
          "과목명":"여성학개론",
          "학점": "3학점"
        },
        "필수과목 이외의 과목": "여성학전공 과목과 각 전공의 여성학 관계 과목을 전공 주임교수와 상의하여 24학점 이상 이수하여야 한다."
      },
      "과목 상세": [
        {
          "과목 코드": "GES2001",
          "교과목명": "현대사회와 여성",
          "강의 시간": "3시간",
          "학점": "3학점",
          "내용": "현대사회에서 여성이 처해있는 사회, 경제적 위치와 이념들을 객관적인 입장에 서서 파악한다. 이러한 과정에서 다양하게 나타나는 여성에 관한 신화들을 재조명하여 현대 사회의 여성에 대한 성평등적 시각을 점검한다."
        },
        {
          "과목 코드": "GES2002",
          "교과목명": "여성학 개론",
          "강의 시간": "3시간",
          "학점": "3학점",
          "내용": "여성학 기초과목으로서 현대 여성의 다양한 문제들을 포괄적으로 다룬다. 학생들의 이해를 위하여 토론, 영상교재, 현장 연구를 도입하여 성불평등의 문제에 대한 포괄적이고도 구체적인 접근을 시도한다."
        },
        {
          "과목 코드": "GES2003",
          "교과목명": "성과사회",
          "강의 시간": "3시간",
          "학점": "3학점",
          "내용": "여성문제를 분석하는 이론과 토의를 정리하고 여성학적 관점이 미친 사회 운동적 차원의 질문과 사회과학 방법론에서의 문제점을 토론한다. 한국여성의 사회적 역할을 분석하기에 적절한 방법론을 실제적 사례연구와 함께 모색한다."
        },
        {
          "과목 코드": "GES3001",
          "교과목명": "성평등 인간학",
          "강의 시간": "3시간",
          "학점": "3학점",
          "내용": "오늘날 ‘사회적 성(gender)’은 학문은 말할 것도 없고 실제 생활에서 가장 중요한 주제의 하나이다. 이 주제를 성평등한 시각에서 종합적으로 인식하고 문제로 제기하며 구체적인 생활세계에서 성평등한 삶의 방식을 실천하기 위한 기초를 다진다. 또한 지식 전달은 물론 태도 변화 그리고 나아가서 실천 방안까지 모색하는 전인적인 교육과정의 실험의 장을 마련한다."
        },
        {
          "과목 코드": "GES3002",
          "교과목명": "여성과 일",
          "강의 시간": "3시간",
          "학점": "3학점",
          "내용": "일과 직업의 개념과 역사, 성에 따른 일의 특징과 직업적 정체성 등을 살펴봄으로써 여성의 일에 대한 이해를 추구한다. 여성의 일과 남성의 일, 그것들을 둘러싼 관념 등에는 어떤 차이가 있는가를 검토하고 이러한 성별 분업 체계가 나타나게 되는 이유와 그 문제점을 극복할 수 있는 방안을 모색한다."
        },
        {
          "과목 코드": "GES3003",
          "교과목명": "여성과 취업",
          "강의 시간": "3시간",
          "학점": "3학점",
          "내용": "취업을 준비하고 있는 여학생들을 위한 강좌로서, 현대 한국사회의 가부장적 조직구조 속에서 여성들이 직면하고 있는 다양한 문제들을 구체적이고 현실적인 차원에서 다룬다."
        },
        {
          "과목 코드": "GES3004",
          "교과목명": "유교문화와 여성",
          "강의 시간": "3시간",
          "학점": "3학점",
          "내용": "유교의 여성관과 관련하여 전통적 여성 역할을 분석 고찰하고, 이러한 유교적 여성관의 영향을 현대 여성의 다양한 영역에서 살펴본다."
        },
        {
          "과목 코드": "GES3005",
          "교과목명": "여성과 문학",
          "강의 시간": "3시간",
          "학점": "3학점",
          "내용": "여성중심적 시각에서 문학적 작품을 읽는 연습을 하고, 동시에 여성작가들의 문제작품들을 읽는다. 이와 함께 여성적 글쓰기가 무엇인가를 고찰한다."
        },
        {
          "과목 코드": "GES3006",
          "교과목명": "역사에서의 여성",
          "강의 시간": "3시간",
          "학점": "3학점",
          "내용": "여성사가 기존의 역사 서술을 전면적으로 재조명하는데 필요한 하나의 새로운 시각을 제시한다는 입장에서 여성사 연구의 이론과 여성사 서술의 실제를 다룬다."
        },
        {
          "과목 코드": "GES3007",
          "교과목명": "여성과 정치",
          "강의시간":"3시간",
          "학점": 3,
          "내용": "자유민주주의 및 사회주의를 포함한 현대정치체계 일반 및 한국 정치에서 여성이 차지하는 위상과 역할을 여성의 가정 및 사회에서의 지위와 유기적으로 연관시키면서 포괄적이고 비판적으로 검토한다."
        },
        {
          "과목 코드": "GES3009",
          "교과목명": "여성심리학",
          "강의시간":"3시간",
          "학점": 3,
          "내용": "기존의 심리학에서 간과하고 있는 여성 심리의 특성을 부각시키고 긍정적인 의미에서 대두되고 있는 양성이론과 함께 심리학의 제 분야를 검토한다."
        },
        {
          "과목 코드": "GES3010",
          "교과목명": "남성문화연구",
          "강의시간":"3시간",
          "학점": 3,
          "내용": "오늘날 성평등한 가치 및 생활태도의 학습이 그 무엇보다도 중요한 과제이며, 이것은 이념적인 당위일 뿐 아니라 현실적인 필요성이다. 그만큼 여성들뿐 아니라 남성들 스스로의 문제의식과 노력이 절실한 바, 여성 남성이 함께 남성문제와 남성중심 문화에 대해 비판적으로 성찰하고, 나아가서 종합적이고 역동적인 남성 정체성의 이해 및 추구를 통해 성평등한 문화형성의 터전을 마련하도록 한다."
        },
        {
          "과목 코드": "GES3011",
          "교과목명": "여성신학",
          "강의시간":"3시간",
          "학점": 3,
          "내용": "올바른 여성관 정립을 목표로 성서 신학을 토대로 한 여성 자신의 가치관 정립, 가정과 사회에서의 사명의식과 실천을 통하여 여성 자신의 진정한 자아 발견과 자기실현, 나아가 ‘더불어 사는 사회’ 실현을 위한 자기 몫을 찾는다."
        },
        {
          "과목 코드": "GES3012",
          "교과목명": "여성과 대중문화",
          "강의시간":"3시간",
          "학점": 3,
          "내용": "대중매체를 비롯한 대중문화에서 여성이 갖고 있는 의미를 그 상징성, 역할 규정, 소비자와 생산자의 입장들을 고려하여 비판적으로 고찰한다."
        },
        {
          "과목 코드": "GES3013",
          "교과목명": "한국여성사",
          "강의시간":"3시간",
          "학점": 3,
          "내용": "한국의 전통 사회에서의 여성의 지위를 여성사적 시각에서 고찰하고 현대 한국 여성의 지위 향상의 과정을 역사적 맥락에서 살펴본다."
        },
        {
          "과목 코드": "GES3014",
          "교과목명": "여성과 법률",
          "강의시간":"3시간",
          "학점": 3,
          "내용": "법률상의 남녀간의 차이를 헌법, 민법, 노동법 등을 중심으로 살펴본다. 특히 가족법 개정운동과 함께 여성기본법의 제정 과정을 통하여 부각된 여성의 법적 지위를 분석적으로 검토한다."
        },
        {
          "과목 코드": "GES3015",
          "교과목명": "서양여성사",
          "강의시간":"3시간",
          "학점": 3,
          "내용": "서양의 전통사회 및 근대사호에서의 여성의 지위를 여성학적 관점에서 역사적으로 고찰하고, 여성사의 확립이 기존의 역사서술을 전면적으로 재조명하게 되는 계기를 검토한다."
        },
        {
          "과목 코드": "GES3016",
          "교과목명": "여성학 고전 강독",
          "강의시간":"3시간",
          "학점": 3,
          "내용": "페미니즘의 고전적 저서, 논문, 선언문 등을 선택하여 읽으면서 그 시대적 배경과 역사적 의의를 고찰한다."
        },
        {
          "과목 코드": "GES3017",
          "교과목명": "여성학 특강 Ⅰ",
          "강의시간":"3시간",
          "학점": 3,
          "내용": "여성문제와 관련된 주제를 설정하여 특강과 토론 중심으로 구성되는 강의로서, 최신의 여성 연구 경향을 파악하고 여성들의 사회적 진출을 돕는 다양한 영역을 시기별로 선정하여 다룬다."
        },
        {
          "과목 코드": "GES3019",
          "교과목명": "‘성’과 사랑",
          "강의시간":"3시간",
          "학점": 3,
          "내용": "여성학적 시각에서 현대 사회에서 재해석되고 있는 성성(Sexuality)과 사랑의 의미를 여러 사례연구를 검토하면서 재해석한다."
        },
        {
          "과목 코드": "GES3020",
          "교과목명": "성 평등 글쓰기",
          "강의시간":"3시간",
          "학점": 3,
          "내용": "성 평등과 성 불평등에 대한 다각적이며 구체적인 현실인식을 에세이, 시, 소설, 희곡, 시나리오 등의 여러 장르로 표현해보는 글쓰기 연습을 통해 성평등 글쓰기의 다양한 가능성을 체험한다."
        },
        {
          "과목 코드": "GES3021",
          "교과목명": "상담과 젠더",
          "강의시간":"3시간",
          "학점": 3,
          "내용": "대학생활에서 소통과 대인 갈등적 상황에서의 상담사례들을 통해 사회문화적인 성적 존재로서의 젠더를 해석하고 젠더 감수성에 기반한 소통기술과 관계기술을 습득함으로써 보다 성평등하고 상호존중적인 삶을 실천하는 장을 마련한다."
        },
        {
          "과목 코드": "GES3023",
          "교과목명": "여성과예술",
          "강의시간":"3시간",
          "학점": 3,
          "내용": "기존 시각예술의 남성 중심적 독해 방식 및 역사기술에 비판적으로 개입하고 여성주의적 관점에서 회화, 사진, 영화 등 동시대 시각예술의 사회적 의미에 대한 비판적 이해를 도모한다. 여성주의 비평 및 이론적 논의들을 검토하고 여성작가들의 여성주의적 실천 작업을 살펴본다."
        },
        {
          "과목 코드": "GES4001",
          "교과목명": "섹슈얼리티이론연구",
          "강의시간":"3시간",
          "학점": 3,
          "내용": "성차와 성정체성 및 퀴어 이론에 대한 최근의 논의를 연구한다."
        },
        {
          "과목 코드": "GES4002",
          "교과목명": "여성과 정책",
          "강의시간":"3시간",
          "학점": 3,
          "내용": "사회과학적 관점에서 여성 담론 및 정책의 범위, 개념, 이론적 배경을 이해한다. 성차의 구조를 사회의 경제, 이념, 문화와 관련하여 고찰하고, 여성운동의 발전과 함께 변화되어온 여성의 역할과 여성정책을 연구한다."
        },
        {
          "과목 코드": "GESG001",
          "교과목명": "여성학 이론",
          "학점": 3,
          "강의시간":"3시간",
          "비고":"학,석사연계/대학원초급과목",
          "내용": "최신 여성학 이론의 흐름을 살펴보고, 여성 운동이 전개되어 온 역사와 과정, 한국사회와 문화에 미치는 영향에 관해서 포괄적으로 배운다."
        },
        {
          "과목 코드": "GESG003",
          "교과목명": "여성운동사",
          "학점": 3,
          "강의시간":"3시간",
          "비고":"학,석사연계/대학원초급과목",
          "내용": "여성운동의 흐름을 그 역사적 배경과 함께 다룬다. 각 운동 단계에서 핵심적 운동가들의 사상적 배경과 운동 과정을 살펴본다. 서구의 페미니즘 운동과 비교하여 한국여성운동의 변화과정도 검토한다."
        },
        {
          "과목 코드": "GESG004",
          "교과목명": "여성과 미디어",
          "학점": 3,
          "강의시간":"3시간",
          "비고":"학,석사연계/대학원초급과목",
          "내용": "여성주의적 관점으로 미디어와 여성의 다각적인 관계를 고찰해보며, 다양한 미디어 현상을 비판적으로 분석해 미디어해석 및 연구능력을 키우며, 현대 사회에서 영향력이 점점 더 커지는 미디어에서 여성과 여성성 재현의 긍정적인 방향을 제안한다."
        }
      ]
    }
  }
}