# 축약어 사전 정의

# 학과명

ABBREVIATION_GROUPS = {
    "서강대학교 전인(全人) 교육과정": ["전인교육", "전인","교양"],
    "국어국문학과": ["국문과", "국문"],
    "종교학과": "종교",
    "영미어문전공": ["영미어문", "영문과", "영문"],
    "미국문화전공": ["미국문화", "미문"],
    "유럽문화학과": ["유럽문화", "유문"],
    "중국문화학과": ["중국문화", "중문과", "중문"],
    "컴퓨터공학과": ["컴공과", "컴공"],
    "소프트웨어융합대학": ["소융대","소융"],
    "전공필수": ["전필"],
    "전공선택": ["전선"],
    "지식융합미디어대학": ["지융미"],
    "Art_&_Technology": ["아텍","아트앤테크놀로지"],
    "신문방송학과": ["신방과","신방"],
    "미디어&엔터테인먼트학과": ["미엔"],
    "정치외교학과": ["정외과","정외"],
    "빅데이터_사이언스BigData_Science_연계전공": ["빅사전공","빅싸","빅사"],
    "공공인재_연계전공":["공공인재"],
    "융합소프트웨어Convergence_Software_연계전공":["융소"],
    "경영학부경영학전공":["경영학과"]
}