# 축약어 사전 정의

# 학과명

ABBREVIATION_GROUPS = {
    "전인교양교육과정": ["전인교육", "전인","교양"],
    "국어국문학과": ["국문과", "국문"],
    #"종교학과": "종교",
    "영미어문전공": ["영미어문", "영문과", "영문"],
    "미국문화전공": ["미국문화", "미문과","미문"],
    "유럽문화학과": ["유럽문화", "유문"],
    "중국문화학과": ["중국문화", "중문과", "중문"],
    "컴퓨터공학과": ["컴공과", "컴공"],
    "소프트웨어융합대학": ["소융대","소융"],
    "전공필수": ["전필"],
    "전공선택": ["전선"],
    "지식융합미디어대학": ["지융미"],
    "Art&Technology": ["아텍","아트앤테크놀로지"],
    "신문방송학과": ["신방과","신방"],
    "미디어&엔터테인먼트학과": ["미엔"],
    "정치외교학과": ["정외과","정외"],
    "빅데이터사이언스BigData_Science연계전공": ["빅사전공","빅싸","빅사"],
    "공공인재연계전공":["공공 인재 연계","공공인재 연계","공공인재연계","공공 인재","공공인재"],
    "융합소프트웨어ConvergenceSoftware연계전공":["융소"],
    "경영학부경영학전공":["경영학과", "경영"],
    "경제학과":["경제"],
    "GlobalKoreanStudies":["글로벌한국학과","글로벌한국학","글한"],
    "AI기반자유전공학부":["AI 자전","AI자전","인공지능 자전","인공자전","인공 자전","인공지능 자유전공"],
    "SCIENCE기반자유전공학부":["science 자전","science자전","사이언스 자전","사이언스자전"],
    #"경제학과":["경제"],
    "공통선택교양":["선택 교양","선택교양","트랙 교양","트랙교양"],
    "공통필수교양":["필수 교양","필수교양"],
    "교직과정":["교직"],
    #"기계공학과":["기계","기공"],
    "물리학과":["물리"],
    "생명과학과":["생명과"],
    "시스템반도체공학과":["시반공","시반"],
    #"인공지능학과":["인공"],
    "인문학기반자유전공학부":["인문학 자유전공","인문학자유전공","인문 자전","인문자전"],
    "자유선택교양":["자유 선택","자유선택","자유 교양","자유교양"],
    "전공입문과목":["전공 입문","전공입문"],
    #"전자공학과":["전자공","전자"],
    "화공생명공학과":["화생공","화공생","화공"]
}

DATE_GROUPS = {
    "2024-2": ["2024학년도 2학기","2024학년도2학기","2024년 2학기","2024년2학기","24년도 2학기","24년도2학기","24년 2학기","24년2학기","작년 2학기","작년2학기","지난학기","지난 학기","지난"],
    "2025-1": ["2025학년도 1학기","2025학년도1학기","2025년 1학기","2025년1학기","25년도 1학기","25년도1학기","25년 1학기","25년1학기","올해 1학기","올해1학기","이번 학기","이번학기","이번"]
}