{
    "2025 서강대학교 요람": {
        "소프트웨어융합대학": {
            "컴퓨터공학과": {
                "과목 정보": [
                    {
                        "과목 코드": "CSE1031",
                        "과목명": "기초통계학",
                        "폐지 정보": "25-1 폐지",
                        "강의 시간": "강의 3시간：이론 3",
                        "학점": 3,
                        "선수과목": "STS2006",
                        "내용": "본 교과목은 확률과 통계의 기초 이론을 배우고 학습한 이론의 컴퓨터학 분야 응용을 다룬다. 컴퓨터 시스템의 모델링 및 성능 평가 및 분석을 위한 기초 지식과 컴퓨터 시뮬레이션 데이터를 분석 평가 할 수 있는 기초 지식을 함양한다."
                    },
                    {
                        "과목 코드": "CSE2003",
                        "과목명": "컴퓨터프로그래밍Ⅰ",
                        "강의 시간": "강의 3시간：설계 3",
                        "학점": 3,
                        "내용": "컴퓨터 프로그래밍 언어의 구문 및 기법을 C언어를 기반으로 학습한다. 학습한 내용에 대한 프로그래밍 실습 위주의 수업을 통하여 문제해결 능력을 함양한다."
                    },
                    {
                        "과목 코드": "CSE2004",
                        "과목명": "공학설계입문",
                        "폐지 정보": "25-1 폐지",
                        "강의 시간": "강의 3시간：설계 3",
                        "학점": 3,
                        "내용": "창의적인 설계를 위하여 공학의 기본 설계개념과 원리를 배우며, 이를 통하여 공학지식을 이용한 창의적인 설계능력을 함양시키는 것을 목적으로 한다. 설계한 내용을 결과물로 구현하는 실습을 수행한다."
                    },
                    {
                        "과목 코드": "CSE2007",
                        "과목명": "기초 콤비네토릭스",
                        "강의 시간": "강의 3시간：이론 3",
                        "학점": 3,
                        "내용": "생성함수, 순환관계와 tree, graph에 대한 기초적인 이론을 다룬다."
                    },
                    {
                        "과목 코드": "CSE2009",
                        "과목명": "컴퓨터공학 및 정보통신개론",
                        "폐지 정보": "25-1 폐지",
                        "강의 시간": "강의 3시간：이론 3",
                        "학점": 3,
                        "내용": "컴퓨터학에 대한 전반적인 소개와 기초적인 실습을 통한 기기 사용법을 다룬다."
                    },
                    {
                        "과목 코드": "CSE2035",
                        "과목명": "컴퓨터프로그래밍Ⅱ",
                        "강의 시간": "강의 3시간：이론 1, 설계 2",
                        "학점": 3,
                        "선수과목": "CSE2003",
                        "내용": "C 언어의 구문 및 프로그래밍과 프로그램 개발에 필수적인 기초 설계 기법을 다룬다."
                    },
                    {
                        "과목 코드": "CSE3006",
                        "과목명": "이산구조",
                        "강의 시간": "강의 3시간：이론 3",
                        "학점": 3,
                        "내용": "대수학 구조의 기초적인 이론과 이의 전자계산기에의 응용을 다룬다."
                    },
                    {
                        "과목 코드": "CSE3013",
                        "과목명": "소프트웨어개발도구및환경실습",
                        "이전 과목명": "구 컴퓨터공학 설계 및 실험 Ⅰ",
                        "강의 시간": "실험 6시간：설계 2, 실험·실습 1",
                        "학점": 3,
                        "선수과목": "CSE2035",
                        "내용": "소프트웨어 개발 산업 현장의 환경을 미리 경험하기 위해 다양한 개발 도구를 실습한다. 다양한 개발 프로젝트를 실제로 진행하면서 각종 도구의 사용법과 유용성을 익힌다."
                    },
                    {
                        "과목 코드": "CSE3015",
                        "과목명": "디지털회로개론",
                        "강의 시간": "강의 3시간：이론 3",
                        "학점": 3,
                        "내용": "불리안 대수를 기초로 스위칭 이론, 조합논리 및 순차논리회로의 설계 및 분석 등을 다룬다. 이들 회로의 집적회로를 이용한 구현 등을 실습한다.",
                        "비고": "전자공학과 EEE2135 디지털회로설계로 대체할 수 있으며, 이 중에서 한 과목만 학점으로 인정"
                    },
                    {
                        "과목 코드": "CSE3016",
                        "과목명": "컴퓨터공학실험 Ⅱ",
                        "강의 시간": "실험 6시간：설계 2, 실험·실습 1",
                        "학점": 3,
                        "내용": "디지털 집적회로를 이용한 각종 logic 소자, MSI logic, flip-flop, decoder, MUX, 다중 output 회로, 가감연산장치, counter, shift register 등의 실험을 다룬다."
                    },
                    {
                        "과목 코드": "CSE3030",
                        "과목명": "컴퓨터시스템 개론",
                        "강의 시간": "강의 3시간：이론 3",
                        "학점": 3,
                        "내용": "컴퓨터의 기본 구성 및 동작 원리를 프로그래머 관점에서 이해하는 것을 목표로 한다. CPU와 메모리 간의 명령어 처리 과정을 논리적인 관점에서 학습하며 어셈블리 언어를 이해하여 다양한 프로그래밍 과제를 통해 컴퓨터시스템의 동작을 구체적으로 이해한다."
                    },
                    {
                        "과목 코드": "CSE3040",
                        "과목명": "JAVA 언어",
                        "강의 시간": "강의 3시간：이론 3",
                        "학점": 3,
                        "내용": "Java 언어의 구문 및 프로그래밍을 다룬다. 여러 가지 예제 프로그램을 통하여 그래픽, 통신, 그리고 자료구조를 익히고 산업체에서 요구하는 기본 프로그램의 설계를 실습한다."
                    },
                    {
                        "과목 코드": "CSE3050",
                        "과목명": "컴퓨터공학세미나 Ⅰ",
                        "강의 시간": "강의 1시간：이론 1",
                        "학점": 1,
                        "내용": "배열, 컴퓨터공학 분야의 최신 기술에 대한 세미나를 통해 향후 전공 심화과정의 학습으로 습득하게 될 고급 과목들이 산업에 어떻게 적용되어 활용될 수 있는지, 고급기술을 습득하기 위해 무엇을 연구하고 공부해야 하는지를 안내하여 미래사회에 기여할 수 있는 유능한 공학인으로 양성하고자 한다."
                    },
                    {
                        "과목 코드": "CSE3080",
                        "과목명": "자료구조",
                        "강의 시간": "강의 3시간：이론 3",
                        "학점": 3,
                        "선수과목": "CSE2035",
                        "내용": "배열, 스택, 큐, 링크드리스트, 트리, 그래프 등의 자료구조들을 소개하고 그것들을 이용한 구현과 분석을 다루어, 효율적인 알고리즘(프로그램) 개발 능력의 기초를 함양한다."
                    },
                    {
                        "과목 코드": "CSE3081",
                        "과목명": "알고리즘 설계와 분석",
                        "강의 시간": "강의 3시간：이론 3",
                        "학점": 3,
                        "선수과목": "CSE3080",
                        "내용": "문제해결을 위한 여러 다양한 알고리즘 설계방법과 이들의 분석기법을 다룬다. 학습할 주요 알고리즘 설계방법은 greedy method, divide and conquer, dynamic programming, backtracking, branch and bound 등이며 설계방법과 함께 이들의 시간 및 공간복잡도의 분석 방법을 익힌다. 아울러 다양한 프로그래밍 과제를 수행하여 습득한 알고리즘 설계방법을 실습한다."
                    },
                    {
                        "과목 코드": "CSE3301",
                        "과목명": "연구프로젝트 Ⅰ",
                        "강의 시간": "강의 3시간：설계 3",
                        "내용": "전공에서 배운 이론과 개념을 바탕으로, 교수가 현재 진행하는 프로젝트에 참여하여 심화된 분야를 배우고 실습할 수 있으며 개별 또는 그룹으로 연구를 진행한다."
                    },
                    {
                        "과목 코드": "CSE3302",
                        "과목명": "연구프로젝트 Ⅱ",
                        "강의 시간": "강의 3시간：설계 3",
                        "내용": "전공에서 배운 이론과 개념을 바탕으로, 교수가 현재 진행하는 프로젝트에 참여하여 심화된 분야를 배우고 실습할 수 있으며 개별 또는 그룹으로 연구를 진행한다."
                    },
                    {
                        "과목 코드": "CSE3303",
                        "과목명": "연구프로젝트 Ⅲ",
                        "강의 시간": "강의 3시간：설계 3",
                        "내용": "전공에서 배운 이론과 개념을 바탕으로, 교수가 현재 진행하는 프로젝트에 참여하여 심화된 분야를 배우고 실습할 수 있으며 개별 또는 그룹으로 연구를 진행한다."
                    },
                    {
                        "과목 코드": "CSE3304",
                        "과목명": "연구프로젝트 Ⅳ",
                        "강의 시간": "강의 3시간：설계 3",
                        "내용": "전공에서 배운 이론과 개념을 바탕으로, 교수가 현재 진행하는 프로젝트에 참여하여 심화된 분야를 배우고 실습할 수 있으며 개별 또는 그룹으로 연구를 진행한다."
                    },
                    {
                        "과목 코드": "CSE4010",
                        "과목명": "컴퓨터 아키텍쳐",
                        "강의 시간": "강의 3시간：이론 3",
                        "학점": "3",
                        "선수과목": "CSE3015",
                        "내용": "컴퓨터의 다양한 구조를 평가하는 평가기준을 학습하고, 컴퓨터 하드웨어와 소프트웨어의 인터페이스 역할을 하는 기계어의 구조 및 디자인 원리, 연산기의 구조, 기계어를 실행하는 CPU 회로, 메모리, 스토리지 구조 등 컴퓨터시스템 구조의 다양한 주제를 학습한다."
                    },
                    {
                        "과목 코드": "CSE4011",
                        "과목명": "임베디드 컴퓨터 구조",
                        "강의 시간": "강의 3시간：이론 3",
                        "학점": "3",
                        "선수과목": "CSE3015",
                        "내용": "임베디드 연산장치, 마이크로 프로그램된 제어장치, 주기억 및 보조기억장치의 구조, 설계, 분석, 시스템의 입출력 및 기억장치 관리 등을 다룬다."
                    },
                    {
                        "과목 코드": "CSE4014",
                        "과목명": "딥러닝개론",
                        "강의 시간": "강의 3시간：이론 3",
                        "학점": "3",
                        "내용": "딥러닝은 인공지능분야 기술의 혁신을 가능케한 핵심 기술이다. 본 수업에서는 딥뉴럴 네트워크에 대한 기초적인 내용에 대하여 학습한다. 특히, 기초적인 퍼셉트론부터 시작하여 합성곱 신경망(CNN) 등 최신 딥러닝 기술까지 학습한다."
                    },
                    {
                        "과목 코드": "CSE4020",
                        "과목명": "SW 분석 및 설계",
                        "강의 시간": "강의 3시간：이론 3",
                        "학점": "3",
                        "내용": "소프트웨어 개발 과정에서 필요한 분석 및 설계 기술을 다룬다. 주요 주제로는 요구사항 분석, 시스템 아키텍처 설계, 객체지향 설계 원칙 및 패턴 등이 포함된다. 학생들은 실제 소프트웨어 프로젝트를 위해 요구사항을 수집하고 문서화하며, 이를 기반으로 효율적이고 유지보수 가능한 시스템 설계를 수립하는 방법을 배운다."
                    },
                    {
                        "과목 코드": "CSE4021",
                        "과목명": "SW 테스팅 및 품질관리",
                        "강의 시간": "강의 3시간：이론 3",
                        "학점": "3",
                        "내용": "소프트웨어 개발 과정에서 필요한 테스팅 및 분석 기법을 다룬다. 주어진 소프트웨어가 안전하게 실행되며 명세대로 올바르게 작동하는지를 검사할 수 있도록 하는 다양한 이론 및 기술을 소개한다. 학생들이 실제 실습을 통해 소프트웨어 품질을 관리하고 개선하는 방법을 습득할 수 있도록 한다."
                    },
                    {
                        "과목 코드": "CSE4022",
                        "과목명": "오픈소스를 이용한 SW 개발 실습",
                        "실험시간": "6시간",
                        "학점": "3",
                        "내용": "오픈소스 개발에 참여하거나 오픈소스 프로젝트를 공개 및 관리하기 위해 필요한 분산 버전 관리 시스템을 학습한다. 오픈소스 기반으로 제작된 샘플 어플리케이션을 제공하여, 이를 바탕으로 코드 품질 향상/테스트/배포/모니터링 등의 소프트웨어 개발 과정을 실습한다."
                    },
                    {
                        "과목 코드": "CSE4050",
                        "과목명": "프로그래밍 언어",
                        "강의 시간": "강의 3시간：이론 3",
                        "학점": "3",
                        "선수과목": "CSE3080",
                        "내용": "여러 프로그래밍 언어들에 공통적으로 내재되어 있는 기본 개념들 (데이터 타입과 변수, 수식, 수행 제어 구조들, 부프로그램 및 구현 방법)을 이해함으로써 새로운 언어를 쉽게 습득할 수 있는 능력을 배양한다. 또한 최근에 많이 사용되고 있는 객체지향언어들에 대한 기본 개념을 다양한 C++ 언어프로그래밍 실습을 통하여 학습한다."
                    },
                    {
                        "과목 코드": "CSE4060",
                        "과목명": "지능형 통신 시스템",
                        "강의 시간": "강의 3시간：이론 3",
                        "학점": "3",
                        "내용": "데이터 통신과 네트워크의 기초가 되는 정보통신의 기본원리와 기반이론에서부터 그 응용에 이르기까지 다양하고 폭넓은 내용을 터득하여 차세대 정보통신 분야에서 활용할 수 있는 능력을 키운다. 먼저 데이터통신을 위한 기본적인 작동 원리를 배우고 또한 네트워크의 기초 보안기술에 대해 학습한다. 또한 차세대 무선통신 기술들과 차세대 지능형 시스템의 운용을 위한 기초적인 적용이론과 기초개념을 다룬다."
                    },
                    {
                        "과목 코드": "CSE4061",
                        "과목명": "컴퓨터공학실험 Ⅲ",
                        "실험시간": "6시간",
                        "실험·실습": "3",
                        "학점": "3",
                        "내용": "데이터 통신의 기본 프로토콜 및 지역 통신망의 수행 및 모니터링 등의 실험을 다룬다."
                    },
                    {
                        "과목 코드": "CSE4070",
                        "과목명": "운영 체제",
                        "강의 시간": "강의 3시간：이론 3",
                        "학점": "3",
                        "선수과목": "CSE3080",
                        "내용": "컴퓨터 운영 체제에 대한 기본 개념과 운영 체제의 각 부분에 (프로세스 관리, 메모리 관리, 파일 시스템, 분산 처리 시스템) 대한 관리 방법을 다룬다. 또한 현존하는 여러 운영 체제에 대한 실 예를 통하여 각 운영 체제에 대한 특징을 이해하고, 실제 습득한 내용을 실습 및 프로젝트를 통하여 구현해 봄으로써 과목에 대한 이해를 높인다."
                    },
                    {
                        "과목 코드": "CSE4085",
                        "과목명": "자동장치 이론",
                        "강의 시간": "강의 3시간：이론 3",
                        "학점": "3",
                        "내용": "유한자동장치, 정규식, 튜링기계, 계산가능함수, 정규언어, 문맥자유언어 등의 문법과 그들을 인지하는 기계 등을 다룬다."
                    },
                    {
                        "과목 코드": "CSE4095",
                        "과목명": "파일 처리(25-1 폐지)",
                        "강의 시간": "강의 3시간：이론 3",
                        "학점": "3",
                        "선수과목": "CSE3080",
                        "내용": "파일의 생성, 비교, 수정, 합성 등 파일에 관한 처리를 다룬다."
                    },
                    {
                        "과목 코드": "CSE4100",
                        "과목명": "시스템프로그래밍(구 멀티코어 프로그래밍)",
                        "강의 시간": "강의 3시간：이론 3",
                        "학점": "3",
                        "내용": "리눅스 환경에서 시스템 소프트웨어의 개념과 개발 기술을 배운다. 멀티코어 구조, 프로세스, 쓰레드, 시그널, 시스템 수준I/O, 동기화 개념을 공부하며 다양한 프로그램 설계 프로젝트를 통해 리눅스 기반 시스템 소프트웨어를 개발할 수 있는 능력을 배양한다. 또한, 멀티코어 환경에서 동시성 프로그래밍(Current Programing)을 통해 임계구역 최적화 기법을 다양한 자료구조에 적용해 보며 효율적이고 확장성 있는 병렬 프로그래밍 기법을 학습하고 동시성 서버 개발을 실습한다."
                    },
                    {
                        "과목 코드": "CSE4103",
                        "과목명": "커넥티드플랫폼이론과실제(캡스톤디자인)",
                        "강의 시간": "강의 3시간：이론 3",
                        "학점": "3",
                        "내용": "Web기반 최신 기술 활용과 미디어 관련 오픈 소스 기반 다양한 활용을 다룬다."
                    },
                    {
                        "과목 코드": "CSE4104",
                        "과목명": "해킹및정보보안",
                        "강의 시간": "강의 3시간：이론 3",
                        "학점": "3",
                        "내용": "컴퓨터공학 전반에서 일어날 수 있는 보안 문제를 소개하며, 특히 소프트웨어에서 발생하는 취약점의 원리를 설명한다. 또한 이들 취약점에 대한 공격 및 방어 기법을 다룬다."
                    },
                    {
                        "과목 코드": "CSE4110",
                        "과목명": "데이터베이스 시스템",
                        "강의 시간": "강의 3시간：이론 3",
                        "학점": "3",
                        "내용": "파일처리 시스템과의 차이점, 데이터베이스의 특성, 데이터 모형 등 데이터베이스 시스템의 기본개념과 구조를 다룬다."
                    },
                    {
                        "과목 코드": "CSE4112",
                        "과목명": "데이터베이스 프로그래밍",
                        "강의 시간": "강의 3시간：이론 3",
                        "학점": "3학점",
                        "내용": "데이터베이스 이론과 프로그래밍 기술을 이용한 데이터베이스 활용 기법을 습득한다. 이를 위해 고급 질의 기법, 데이터베이스를 활용한 프로그래밍 기법을 습득한다. 더 나아가 이를 적용한 실전 프로젝트를 통해 그 활용 기법을 확고히 정립한다."
                    },
                    {
                        "과목 코드": "CSE4115",
                        "과목명": "소프트웨어 공학",
                        "강의 시간": "강의 3시간：이론 3",
                        "학점": "3학점",
                        "내용": "소프트웨어 개발과정에서 요구되는 요구사항분석, 디자인과정, 관련도구 개발, 검증 및 신뢰성, 유지보수 등에 관한 사항을 다룬다."
                    },
                    {
                        "과목 코드": "CSE4116",
                        "과목명": "임베디드 시스템 소프트웨어",
                        "강의 시간": "강의 3시간：이론 3",
                        "학점": "3학점",
                        "내용": "운영체제 내부의 커널 프로그래밍 기술, 디바이스 드라이버 개발 기술 및 시스템 호출 API를 이용한 고급 시스템 프로그래밍 기술 등을 배운다. 일반 PC 기반의 환경뿐만 아니라 임베디드 환경에서의 프로그래밍 기술을 실습해 봄으로써 고급 시스템 프로그래밍 및 임베디드 시스템 프로그래밍 기술을 습득한다."
                    },
                    {
                        "과목 코드": "CSE4120",
                        "과목명": "기초 컴파일러 구성",
                        "강의 시간": "강의 3시간：이론 3",
                        "학점": "3학점",
                        "내용": "컴파일러 작성을 위한 기본적인 형성 기법, 구문론, 의미론, 파서 및 코드 생성 기법 등을 배우고, 이를 실습하고 또한 실제 컴파일러를 설계하여 구현하는 프로젝트를 수행함으로써, 컴파일러의 내부 구조와 각종 프로그래밍 언어의 특징 및 컴퓨터 시스템과의 인터페이스에 대한 이해를 높인다."
                    },
                    {
                        "과목 코드": "CSE4130",
                        "과목명": "기초 머신러닝",
                        "강의 시간": "강의 3시간：이론 3",
                        "학점": "3학점",
                        "내용": "본 교과목에서는 머신러닝에 관한 이론과 실용적인 알고리즘을 이해함으로써 머신러닝의 기초, 응용분야, 가능성과 한계에 대하여 학습하도록 한다. 머신러닝에서 주로 다루어지는 Bayes rule, decision tree, Support Vector Machine 등의 분류기법을 소개하고, 지도/준지도/비지도학습 등의 일반적인 학습 이론과 HMM, Active Learning, Reinforcement Learning, Artificial Neural Networks 등에 대하여 학습한다."
                    },
                    {
                        "과목 코드": "CSE4140",
                        "과목명": "수치 컴퓨팅 및 응용",
                        "강의 시간": "강의 3시간：이론 3",
                        "학점": "3학점",
                        "선수과목": "STS2006",
                        "내용": "여러 공학 분야의 문제 해결에 필수적인 수치 계산을 위한 부동 소수점 연산에 대한 이해를 높이고, 실제 응용문제에 대한 프로그래밍 연습을 통하여 수치계산 문제에 대한 해결 능력을 배양한다."
                    },
                    {
                        "과목 코드": "CSE4152",
                        "과목명": "문제해결프로그래밍실습(구 고급 소프트웨어 실습 Ⅰ)",
                        "실습 시간": "6시간",
                        "설계": "2",
                        "실험·실습": "1",
                        "학점": "3학점",
                        "내용": "문제 해결과 알고리즘 개발을 중점적으로 다루며, 프로그래밍 기법을 체계적으로 이해하고 활용하는 것을 목표로 한다. 배열, 스택, 큐 등 과 같은 기본적인 데이터 구조 개념뿐만 아니라, 순환, 탐색, 정렬 알고리즘 등에 대한 이해도를 높이는 것을 포함한다. 체계적인 프로그램을 구성하기 위한 계획 수립, 프로그래밍, 디버깅, 그리고 문서화 작업을 실습한다."
                    },
                    {
                        "과목 코드": "CSE4155",
                        "과목명": "디지털 시스템",
                        "강의 시간": "강의 3시간：이론 3",
                        "학점": "3학점",
                        "내용": "다중 미니 컴퓨터구조, 다중 마이크로 컴퓨터구조, interconnection 설계 및 그 응용 분야를 다룬다."
                    },
                    {
                        "과목 코드": "CSE4158",
                        "과목명": "그래프 이론 및 알고리즘",
                        "강의 시간": "강의 3시간：이론 3",
                        "학점": "3학점",
                        "내용": "컴퓨터학에 관한 그래프 이론과 그 응용을 위한 알고리즘을 다룬다."
                    },
                    {
                        "과목 코드": "CSE4170",
                        "과목명": "기초 컴퓨터그래픽스",
                        "강의 시간": "강의 3시간：이론 3",
                        "학점": "3학점",
                        "선수과목": "STS2005",
                        "내용": "3차원 그래픽스에 기초가 되는 렌더링, 애니메이션, 모델링 등의 기본 이론들을 다루고, 실습을 통하여 구현기법들을 익힌다."
                    },
                    {
                        "과목 코드": "CSE4175",
                        "과목명": "컴퓨터 네트워크",
                        "강의 시간": "강의 3시간：이론 3",
                        "학점": "3학점",
                        "내용": "본 교과목에서는 기본적인 컴퓨터 네트워크 내부 동작 원리와 사용되는 다양한 프로토콜들을 소개한다. Internet 5 계층 중 물리계층을 제외한 데이터링크 계층(data link), 네트워크 계층(network), 트랜스포트 계층(transport), 그리고 응용(application) 계층을 공부한다. 데이터 전송 서비스를 제공하는 IP, 고급의 부가적인 전송 서비스를 제공하는 TCP/UDP, 그리고 응용 계층에서 사용하는 다양한 응용 프로그램들(WWW, FTP, SMTP), 오디오와 비디오 등의 멀티미디어 데이터 전송을 위한 트랜스 프로토콜(RTP/RTCP, RTSP, H.323)을 소개한다."
                    },
                    {
                        "과목 코드": "CSE4177",
                        "과목명": "인터넷 프로그래밍 및 응용",
                        "강의 시간": "강의 3시간：이론 3",
                        "학점": "3학점",
                        "내용": "인터넷을 이루는 여러 컴퓨터 관련 기술들 (예를 들면, TCP/IP, WWW, HTML/HTTP, HTTP CGI Programming, Web 서버, Java/JavaScript Programming, PHP, ASP 등)에 대하여 기본 개념 및 사용 방법, 구현 방법, 응용 분야 등을 여러 프로그래밍 실습을 통하여 학습한다."
                    },
                    {
                        "과목 코드": "CSE4178",
                        "과목명": "기초 SoC 설계",
                        "강의 시간": "강의 3시간：이론 3",
                        "학점": "3학점",
                        "선수과목": "CSE3015",
                        "내용": "SoC 소개 및 설계 흐름, 기본 MOS 트랜지스터, resistance와 capacitance 등의 동작 원리, MOS 회로, 회로설계, 레이아웃, 레이아웃 실습, HDL을 이용한 고수준 프로그래밍 등을 학습하며 추가로 SoC 구성 및 이해를 위한 간단한 하드웨어 설계 및 실습을 수행한다."
                    },
                    {
                        "과목 코드": "CSE4181",
                        "과목명": "SW 경제성 분석 및 창업",
                        "강의 시간": "강의 3시간：이론 3",
                        "학점": "3학점",
                        "내용": "SW분야의 R&D를 수행할 공학도들에게 SW경제성 분석, 원가/회계 관련 기본지식(재무분석기초), 연구개발비 관리, 목표원가 관리, 기술가치평가 등 개발 업무와 관련된 회계지식을 배양하여, R&D의 경쟁력을 높이고 창업을 위한 기본기술을 학습한다. 연구개발 예산의 수립 및 통제, 연구개발 과제 평가, 창업 과정에서의 세무전략에 대해 SW분야 중심으로 학습하며, 기초회계 및 원가회계에 대해 회계정보를 생산하는 회계담당자 중심의 학습 형식이 아닌, 정보이용자 중심의 학습 형식으로 해당 연구를 다룬다."
                    },
                    {
                        "과목 코드": "CSE4182",
                        "과목명": "설계패턴(25-1 폐지)",
                        "강의 시간": "강의 3시간：이론 3",
                        "학점": "3학점",
                        "내용": "전문가의 설계지식을 패턴화한 설계 패턴과 기존 소프트웨어의 외부 기능은 변경하지 않으면서 내부 구조를 바꾸어 소프트웨어 설계를 개선할 수 있는 방법을 제공하는 리팩토링 기법을 학습한다."
                    },
                    {
                        "과목 코드": "CSE4183",
                        "과목명": "SW 명세화 기법",
                        "폐지 정보": "25-1 폐지",
                        "강의 시간": "강의 3시간： 이론 3",
                        "학점": 3,
                        "내용": "SW 재사용성 향상을 위한 SW 개발 프로세스 단계별 명세화 기법을 다룬다. SW 개발 표준 프로세스 및 프로세스 단계별 활동에 대해서 공부하며, 각 단계별 작성해야 하는 산출물이 SW 품질에 어떠한 영향을 미치는지를 다룬다. 상품전략/기획(product concept planning), 설계 기획(project planning), 설계 검증(design verification) 단계를 중심으로 프로젝트 제안서 및 risk assessment, work breakdown structure, high level design, low level design, S/W test plan, 형상관리 계획, installation guide, user manual의 명세화를 학습한다."
                    },
                    {
                        "과목 코드": "CSE4185",
                        "과목명": "기초 인공지능",
                        "강의 시간": "강의 3시간： 이론 3",
                        "학점": 3,
                        "선수과목": "CSE3080",
                        "내용": "인공지능의 기본적인 이론과 비수치 자료를 처리하는 프로그램을 다룬다."
                    },
                    {
                        "과목 코드": "CSE4186",
                        "과목명": "캡스톤디자인",
                        "강의 시간": "강의 3시간：이론 1, 설계 2",
                        "학점": 3,
                        "선수과목": "CSE3080",
                        "내용": "수학, 기초과학, 전문교양으로부터 얻은 지식과 전공에서 배운 이론과 개념을 바탕으로 하여, 보다 심화된 설계능력을 함양시키는 것을 목적으로 한다. 스마트폰 상에서의 앱 개발에 초점을 맞추어, 팀을 구성하여 프로젝트 단위로 과제를 수행하게 하여 종합적인 문제 해결 능력을 훈련한다. Android 및 iOS상에서의 프로그래밍에 필요한 환경 설정 및 프로그래밍 기법을 배우고, 이후 체계적인 개발 프로세스에 바탕을 두고 이들 플랫폼에 초점을 맞춘 팀 프로젝트를 수행한다."
                    },
                    {
                        "과목 코드": "CSE4187",
                        "과목명": "산학프로젝트",
                        "강의 시간": "강의 3시간：설계 3",
                        "학점": 3,
                        "선수과목": "CSE3080",
                        "내용": "수학, 기초과학, 전문교양으로부터 얻은 지식과 전공에서 배운 이론과 개념을 바탕으로 하여, 보다 심화된 설계 능력을 함양시키는 것을 목적으로 한다. 실습 위주의 과목 운영을 통하여 종합적인 문제 해결 능력을 갖추기 위한 제반 설계 능력을 훈련한다, 특히 체계적인 프로세스에 바탕을 둔 S/W 설계, 구현, 테스트 및 S/W 유지보수에 초점을 맞춘다. 이 과목은 종합설계 교과목으로서 졸업 전 마지막 학기(최소 8학기 이상, 조기 졸업의 경우 7학기)에만 이수가 가능하다."
                    },
                    {
                        "과목 코드": "CSE4188",
                        "과목명": "암호학기초",
                        "강의 시간": "강의 3시간：이론 3",
                        "학점": 3,
                        "내용": "고전적인 암호화 기법들과 근대 암호기법들을 다룬다. 또한 암호기법들에 대한 보안성에 대한 정의와 그와 관련된 기법들을 다룬다. 자료의 인증과 무결성에 관한 전자 서명 기법에 대해서도 공부한다."
                    },
                    {
                        "과목 코드": "CSE4189",
                        "과목명": "산학과제실습",
                        "학점": 3,
                        "내용": "담당 교수의 지도 아래 산업체와 연계된 프로젝트를 진행함으로써 소프트웨어 개발의 전체적인 과정을 경험할 수 있도록 한다. 이를 통해 학생들이 산업 현장에서 필요로 하는 능력을 갖출 수 있도록 한다."
                    },
                    {
                        "과목 코드": "CSE4190",
                        "과목명": "컴퓨터공학 현장실습",
                        "학점": 3,
                        "내용": "개별적으로 산업체와 연계된 인턴십을 수행한다."
                    },
                    {
                        "과목 코드": "CSE4191",
                        "과목명": "SW인턴십",
                        "학점": 3,
                        "내용": "학생들이 산업체와 연계된 프로젝트를 진행함으로써 소프트웨어 개발의 전체적인 과정을 경험할 수 있는 기회를 제공한다. 인턴십 진행을 통해 산업 현장에서의 실무를 경험할 수 있도록 한다."
                    },
                    {
                        "과목 코드": "CSE4199",
                        "과목명": "졸업프로젝트",
                        "폐지 정보": "25-1 폐지",
                        "강의 시간": "강의 3시간：이론 3",
                        "학점": 3,
                        "내용": "졸업반 학생의 선택과목으로서 4학년 마지막 학기에 지도교수 지도에 따라 개별적으로 특수연구를 수행한다. 전공과목에서 포함되지 않으며, 졸업학점에만 포함된다."
                    },
                    {
                        "과목 코드": "CSE4200",
                        "과목명": "기초추천시스템",
                        "강의 시간": "강의 3시간：이론 3",
                        "학점": 3,
                        "내용": "본 과목은 인터넷 서비스의 필수 요소로 자리잡은 추천 시스템을 이해하고, 서비스의 종류에 따른 추천 모델과 그 평가 방법에 대하여 학습하는 것을 목표로 한다. 본 과목에서는 기본적인 추천 모델부터 최신 딥러닝 기반 추천 모델까지 다룬다. 마지막으로, 실제 추천 모델을 학습하고 평가해 보는 프로젝트를 통하여 추천 시스템에 대한 이해를 심화한다."
                    },
                    {
                        "과목 코드": "CSE4310",
                        "과목명": "클라우드 컴퓨팅 및 응용",
                        "강의 시간": "강의 3시간：이론 3",
                        "학점": 3,
                        "내용": "클라우드 컴퓨팅의 기본 구조 및 가상화 기술을 익히고, 현장에서 많이 사용되는 클라우드 플랫폼들의 서비스 API를 활용하여 직접 클라우드 서비스를 개발해 본다. 또한 컨테이너를 활용한 API를 활용하여 직접 클라우드 서비스를 개발해 본다. 또한 컨테이너를 활용한 MSA의 구조 및 DevOps 환경에 대하여 학습하고, 실제 컨테이너 관리 플랫폼(Kubernetes) 상에서 DevOps 환경을 구축하여 소프트웨어를 개발해 본다."
                    },
                    {
                        "과목 코드": "CSE4320",
                        "과목명": "블록체인 이론 및 응용",
                        "강의 시간": "강의 3시간：이론 3",
                        "학점": 3,
                        "내용": "블록체인의 작동 원리, 분산 원장 기술, 스마트 컨트랙트 프로그래밍 등을 소개한다. 실제 사례에 대한 케이스 스터디 및 프로젝트를 통하여, 학생들이 블록체인 기술을 실제 비즈니스 및 기술적인 문제에 적용하는 방법을 배울 수 있도록 한다."
                    },
                    {
                        "과목 코드": "CSE4330",
                        "과목명": "메타버스 및 가상현실",
                        "강의 시간": "강의 3시간：이론 3",
                        "학점": 3,
                        "내용": "사용자가 실제 세상과 가상의 세상을 결합한 확장 현실 환경과 상호작용할 수 있도록 하는 요소 기술을 배운다. 특히, 가상현실(Virtual reality), 증강현실(Augmented reality), 그리고 혼합현실(Mixed reality) 기반의 다양한 기술들이 어떠한 방식으로 메타버스 시스템 구축에 사용될 수 있는지 알아본다."
                    },
                    {
                        "과목 코드": "CSEG109",
                        "과목명": "오디오인식및합성변환",
                        "강의 시간": "강의 3시간：이론 3",
                        "학점": 3,
                        "내용": "본과목의 목표는 오디오 이벤트 인식, 음악 인식, 화자 인식, 음성 합성, 음성 변환, 음성인식용 언어모델에 필요한 기술을 이해하는 것이다. 이의 이해에 필요한 딥뉴럴넷 모델에 대해서 공부한다."
                    },
                    {
                        "과목 코드": "CSEG311",
                        "과목명": "음성인식(구 대화형 사용자 인터페이스 개론)",
                        "강의 시간": "강의 3시간：이론 3",
                        "학점": 3,
                        "내용": "대화형 사용자 인터페이스에 대한 HMM 기반의 음향모델, 통계 기반의 언어모델, 탐색기능구현 중심으로 대화형 사용자 인터페이스 설계방법을 소개한다. Audio fingerprint의 생성 및 검색 방법을 공부하며, 이를 이용한 응용인 음악검색에 대해서 소개한다."
                    },
                    {
                        "과목 코드": "CSEG312",
                        "과목명": "데이터마이닝",
                        "강의 시간": "강의 3시간：이론 3",
                        "학점": "3학점",
                        "내용": "데이터로부터 지식을 도출해내는 데이터마이닝의 개념을 소개하고 지식도출을 위한 기계학습의 개념 및 알고리즘을 이해하고 다양한 응용에 적용해본다. 구체적인 주제로는 연관성 분석, 의사결정 트리, 베이지언 추론, 지지벡터머신, 군집화 등이다."
                    },
                    {
                        "과목 코드": "CSEG321",
                        "과목명": "인간 언어 기술 개론",
                        "강의 시간": "강의 3시간：이론 3",
                        "학점": "3학점",
                        "내용": "본 과목에서는 컴퓨터가 어떻게 언어를 처리하여 다양한 응용에 활용하는지 소개한다. 형태소 분석, 개체명 분석을 통한 세만틱 정보검색 기술과 음성대화 인터페이스 기술의 기본적인 원리를 다룬다."
                    },
                    {
                        "과목 코드": "CSEG414",
                        "과목명": "병렬 분산 컴퓨팅",
                        "강의 시간": "강의 3시간：이론 3",
                        "학점": "3학점",
                        "내용": "인터넷에 연결된 여러 컴퓨터들의 처리 능력을 이용하여 문제를 해결하기 위한 분산처리 프로그래밍 기법 및 알고리즘을 소개하고 실제 응용에 적용해 본다."
                    },
                    {
                        "과목 코드": "CSEG416",
                        "과목명": "패턴인식",
                        "강의 시간": "강의 3시간：이론 3",
                        "학점": "3학점",
                        "내용": "패턴인식은 패턴매칭, 통계적 분석, 구조적 분석, 신경망 처리 등을 이용하여 패턴의 특성을 분석하는 학문이다. 본 교과목에서는 통계적 패턴인식 방법, 고차원 데이터 처리, 군집화 및 신경망 기반 처리 방법 등에 대하여 학습하게 된다. 다양한 데이터를 분석하는 알고리즘의 학습과 프로젝트에서의 구현을 통하여 데이터를 처리하는 통찰력을 배양하도록 한다."
                    },
                    {
                        "과목 코드": "CSEG418",
                        "과목명": "컴퓨터 비전",
                        "강의 시간": "강의 3시간： 이론 3",
                        "학점": "3학점",
                        "내용": "본 교과목은 영상의 형성, 표현, 처리에 대한 내용을 이해하고 컴퓨터비전 관련 문제 해결을 위한 전통적인 기법에서부터 대표적인 딥러닝 기법들에 대하여 학습을 한다. 일반적인 2D 및 3D 이미지에 대한 피처 추출, 인식 및 3D 형상 복원 등에 관한 내용을 알아보고, 대표적인 컴퓨터 비전 문제들은 프로젝트를 통하여 직접 구현해 보도록 한다."
                    },
                    {
                        "과목 코드": "CSEG437",
                        "과목명": "수치 컴퓨팅 및 GPU 프로그래밍(25-1 폐지)",
                        "강의 시간": "강의 3시간：이론 3",
                        "학점": "3학점",
                        "내용": "다양한 분야에서 발생하는 수치 계산 문제의 해결에 필요한 수치 해석 알고리즘을 다룬다. 또한 방대한 계산을 요하는 수치계산 문제에 대하여 고성능 GPU 상에서의 병렬 프로그래밍을 통한 효과적인 문제 해결 방법에 대하여 익힌다."
                    },
                    {
                        "과목 코드": "CSEG450",
                        "과목명": "확장 현실 시스템",
                        "강의 시간": "강의 3시간： 이론 3",
                        "학점": "3학점",
                        "내용": "가상 현실(Virtual Reality, VR), 증강 현실(Augmented Reality, AR), 그리고 혼합 현실(Mixed Reality, MR) 기술을 아우르는 확장 현실(Extended Reality, XR) 기술에 대한 이해도를 높이고 그에 대한 소프트웨어 구현 능력을 습득한다."
                    },
                    {
                        "과목 코드": "CSEG483",
                        "과목명": "기초 GPU 프로그래밍(구 GPGPU 컴퓨팅)",
                        "강의 시간": "강의 3시간： 이론 3",
                        "학점": "3학점",
                        "내용": "고성능 병렬 컴퓨팅에서 중추적인 역할을 하는 GPU 상에서의 효과적인 문제 해결을 위한 GPGPU(General-Purpose Graphics Processing Unit) 컴퓨팅 기술에 대하여 이해한 후, CUDA API를 사용하여 다양한 문제에 대한 병렬 프로그래밍을 실습하여 본다."
                    },
                    {
                        "과목 코드": "CSEG494",
                        "과목명": "계산적 지능 최적화",
                        "강의 시간": "강의 3시간：이론 3",
                        "학점": "3학점",
                        "내용": "바이오 생명체 집단 또는 물리적인 현상을 근거로 하여 만들어진 최적화 문제들을 풀기 위한 계산적 지능 최적화 알고리즘들의 분석 및 응용을 다룬다. 개미 집단 최적화(Ant Colony Optimization), 유전자 알고리즘(Genetic Algorithm), 담금질 기법(Simulated Annealing), Particle Swarm Optimization(PSO) 등의 알고리즘들과 강화학습(Reinforcement Learning)의 기초 또한 다룬다."
                    },
                    {
                        "과목 코드": "CSEG501",
                        "과목명": "멀티미디어 콘텐츠 표현 및 처리",
                        "강의 시간": "강의 3시간：이론 3",
                        "학점": "3학점",
                        "내용": "멀티미디어 콘텐츠를 이루는 텍스트, 이미지, 동영상, 오디오, 음악 등이 컴퓨터 안에서 표현되는 방식을 소개하고, 이런 콘텐츠를 압축하는 방법 및 컴퓨터 안에서의 처리 방법에 대하여 학습한다."
                    },
                    {
                        "과목 코드": "CSEG516",
                        "과목명": "강화학습개론",
                        "강의 시간": "강의 3시간：이론 3",
                        "학점": "3학점",
                        "내용": "강화학습은 연속적인 의사결정을 위해 사용되는 머신러닝 패러다임으로서, 주어진 상황에서 최적의 행동을 효과적으로 찾아내기 위한 방법론이다. 본 과목에서는 강화학습의 기반이 되는 수학적 이론과 최신 강화학습 알고리즘을 학습하고, 실습 및 프로젝트를 통해 새로운 문제에 강화학습을 적용하여 문제를 해결할 수 있는 능력을 갖추는 것을 목표로 한다."
                    },
                    {
                        "과목 코드": "CSEG601",
                        "과목명": "공간 데이터베이스 시스템",
                        "강의 시간": "강의 3시간：이론 3",
                        "학점": "3학점",
                        "내용": "공간 데이터베이스 시스템에서는 스마트폰 기반의 위치기반서비스(LBS), 지리정보, 멀티미디어, 이미지 프로세싱과 같은 다양한 응용 분야에서 사용되는 핵심 데이터인 다차원 공간데이터를 효과적으로 처리하고 관리하는 기술에 대하여 배운다. 특히, 공간 데이터 모델, 공간 데이터 SQL 질의어, 공간 데이터 인덱싱 기법, 공간 조인 처리 기술, 공간 응용질의어 처리 기법, Road Network에서의 LBS 질의처리 기술, 공간 키워드 검색 기법들을 배운다."
                    },
                    {
                        "과목 코드": "CSEQ981",
                        "과목명": "컴퓨터 교과교육론",
                        "강의 시간": "강의 3시간：이론 3",
                        "학점": "3학점",
                        "내용": "컴퓨터학 교과교육의 목적, 내용, 방법, 평가 등에 대한 다양한 이론과 관점을 고찰하며, 중·고등학교 컴퓨터학 교육과정의 실제를 구체적으로 분석한다."
                    },
                    {
                        "과목 코드": "CSEQ982",
                        "과목명": "컴퓨터학 교과교재연구 및 지도법",
                        "강의 시간": "강의 3시간：이론 3",
                        "학점": "3학점",
                        "내용": "중·고등학교 컴퓨터학 교과 교육과정 및 교과서 등에 대한 체계적 분석과 컴퓨터학 교수방법의 이론과 실제에 대한 이해를 통해, 컴퓨터학 교과를 효과적으로 가르칠 수 있는 실천적 자질을 함양한다."
                    },
                    {
                        "과목 코드": "CSEQ983",
                        "과목명": "컴퓨터학 교과 논리 및 논술",
                        "강의 시간": "강의 3시간：이론 3",
                        "학점": "3학점",
                        "내용": "컴퓨터학 교과의 구조와 특성에 대한 전반적인 이해를 토대로, 컴퓨터학의 내용과 원리를 소재로 한 사고력의 함양과 논술지도 능력을 기른다."
                    }
                ]
            },
            "인공지능학과":{
                "과목 정보": {
                    "AIE2050": {
                    "과목 코드": "AIE2050",
                    "합반 수업": "CSE2003",
                    "과목명": "컴퓨터프로그래밍Ⅰ",
                    "강의 시간": "3시간",
                    "이론": "3",
                    "학점": "3",
                    "내용": "컴퓨터 프로그래밍 언어의 구문 및 기법을 C언어를 기반으로 학습한다. 학습한 내용에 대한 프로그래밍 실습 위주의 수업을 통하여 문제해결 능력을 함양한다."
                    },
                    "AIE2051": {
                    "과목 코드": "AIE2051",
                    "합반 수업": "CSE2035",
                    "과목명": "컴퓨터프로그래밍 Ⅱ",
                    "강의 시간": "3시간",
                    "이론": "3",
                    "학점": "3",
                    "선수과목": "AIE2050",
                    "내용": "C 언어의 구문 및 프로그래밍과 프로그램 개발에 필수적인 기초 설계 기법을 다룬다."
                    },
                    "AIE2070": {
                    "과목 코드": "AIE2070",
                    "합반 수업": "CSE3006",
                    "과목명": "이산구조",
                    "강의 시간": "3시간",
                    "이론": "3",
                    "학점": "3",
                    "내용": "대수학 구조의 기초적인 이론과 이의 전자계산기에의 응용을 다룬다."
                    },
                    "AIE3010": {
                    "과목 코드": "AIE3010",
                    "합반 수업": "CSE4130",
                    "과목명": "기초머신러닝",
                    "강의 시간": "3시간",
                    "이론": "3",
                    "학점": "3",
                    "내용": "본 교과목에서는 머신러닝에 관한 이론과 실용적인 알고리즘을 이해함으로써 머신러닝의 기초, 응용분야, 가능성과 한계에 대하여 학습하도록 한다. 머신러닝에서 주로 다루어지는 Bayes rule, decision tree, Support Vector Machine 등의 분류기법을 소개하고, 지도/준지도/비지도학습 등의 일반적인 학습 이론과 HMM, Active Learning, Reinforcement Learning, Artificial Neural Networks 등에 대하여 학습한다."
                    },
                    "AIE3050": {
                    "과목 코드": "AIE3050",
                    "합반 수업": "CSE3080",
                    "과목명": "자료구조",
                    "강의 시간": "3시간",
                    "이론": "3",
                    "학점": "3",
                    "선수과목": "AIE2051",
                    "내용": "배열, 스택, 큐, 링크드리스트, 트리, 그래프 등의 자료구조들을 소개하고 그것들을 이용한 구현과 분석을 다루어, 효율적인 알고리즘(프로그램) 개발 능력의 기초를 함양한다."
                    },
                    "AIE3051": {
                    "과목 코드": "AIE3051",
                    "합반 수업": "CSE3081",
                    "과목명": "알고리즘설계와분석",
                    "강의 시간": "3시간",
                    "이론": "3",
                    "학점": "3",
                    "선수과목": "AIE3050",
                    "내용": "문제해결을 위한 여러 다양한 알고리즘 설계방법과 이들의 분석기법을 다룬다. 학습할 주요 알고리즘 설계방법은 greedy method, divide and conquer, dynamic programming, backtracking, branch and bound 등이며 설계방법과 함께 이들의 시간 및 공간 복잡도의 분석방법을 익힌다. 아울러 다양한 프로그래밍 과제를 수행하여 습득한 알고리즘 설계방법을 실습한다."
                    },
                    "AIE3052": {
                    "과목 코드": "AIE3052",
                    "합반 수업": "CSE3040",
                    "과목명": "JAVA언어",
                    "강의 시간": "3시간",
                    "이론": "3",
                    "학점": "3",
                    "내용": "Java 언어의 구문 및 프로그래밍을 다룬다. 여러 가지 예제 프로그램을 통하여 그래픽, 통신, 그리고 자료구조를 익히고 산업체에서 요구하는 기본 프로그램의 설계를 실습한다."
                    },
                    "AIE3053": {
                    "과목 코드": "AIE3053",
                    "합반 수업": "CSE3015",
                    "과목명": "디지털회로개론",
                    "강의 시간": "3시간",
                    "이론": "3",
                    "학점": "3",
                    "내용": "불리안 대수를 기초로 스위칭 이론, 조합논리 및 순차논리회로의 설계 및 분석 등을 다룬다. 이들 회로의 집적회로를 이용한 구현 등을 실습한다."
                    },
                    "AIE3054": {
                    "과목 코드": "AIE3054",
                    "합반 수업": "CSE3030",
                    "과목명": "컴퓨터시스템개론",
                    "강의 시간": "3시간",
                    "이론": "3",
                    "학점": "3",
                    "내용": "컴퓨터의 기본 구성 및 동작 원리를 프로그래머 관점에서 이해하는 것을 목표로 한다. CPU와 메모리 간의 명령어 처리 과정을 논리적인 관점에서 학습하며 어셈블리 언어를 이해하여 다양한 프로그래밍 과제를 통해 컴퓨터시스템의 동작을 구체적으로 이해한다."
                    },
                    "AIE3070": {
                    "과목 코드": "AIE3070",
                    "과목명": "인공지능수학",
                    "강의 시간": "3시간",
                    "이론": "3",
                    "학점": "3",
                    "내용": "인공지능, 그 중에서도 기계학습 및 딥러닝 분야의 기술들의 동작에 대하여 수학적으로 분석 및 모델링하는 방법에 대하여 학습한다. 본 교과목은 수강생들이 미적분, 확률과 통계, 선형대수를 알고 있다고 가정한다."
                    },
                    "AIE3071": {
                    "과목 코드": "AIE3071",
                    "과목명": "지능형랜덤프로세스",
                    "강의 시간": "3시간",
                    "이론": "3",
                    "학점": "3",
                    "내용": "기초적인 확률 및 통계를 학습한 수강생을 대상으로 보다 심화적인 확률분포, 랜덤변수와 다중랜덤변수, 랜덤변수의 함수 및 변환, 랜덤프로세스와 인공지능 분야에서의 응용 사례를 학습한다."
                    },
                    "AIE3072": {
                    "과목 코드": "AIE3072",
                    "과목명": "지능형선형시스템",
                    "강의 시간": "3시간",
                    "이론": "3",
                    "학점": "3",
                    "내용": "선형 시스템에 대하여 학습한다. 구체적으로는 아날로그 및 디지털 신호의 기본 개념과 변환 방식을 학습한다. 특히 푸리에 변환과 z-변환 방식의 학습을 통해 시간 및 주파수 공간에서의 시그널의 특성을 이해한다. FIR 및 IIR 필터를 정의하고, 이것이 최신 인공지능 기술에 어떻게 적용되고 있는지에 대하여 배운다."
                    },
                    "AIE3090": {
                    "과목 코드": "AIE3090",
                    "과목명": "인공지능실험",
                    "실험 시간": "6시간",
                    "실험·실습": "3",
                    "학점": "3",
                    "내용": "학습한 머신러닝 및 인공지능 이론을 토대로 다양한 분야에 기계학습을 활용한 인공지능 어플리케이션을 직접 개발한다. 머신러닝 기술 및 다양한 신경망 구조(CNN, RNN, LSTM, Transformer, Diffusion 모델)를 컴퓨터과학 관련분야에 직접 접목해봄으로써 학생의 창의력 및 인공지능 어플리케이션 개발 역량을 향상한다."
                    },
                    "AIE3091": {
                    "과목 코드": "AIE3091",
                    "합반 수업": "CSE3013",
                    "과목명": "컴퓨터공학설계및실험 Ⅰ",
                    "실험 시간": "6시간",
                    "실험·실습": "3",
                    "학점": "3",
                    "선수과목": "AIE2051",
                    "내용": "개인용 컴퓨터의 조작, 운영체제, 인터페이스, 프로그래밍과 관련 소프트웨어 등을 다룬다."
                    },
                    "AIE3092": {
                    "과목 코드": "AIE3092",
                    "합반 수업": "CSE3016",
                    "과목명": "컴퓨터공학실험 Ⅱ",
                    "실험 시간": "6시간",
                    "실험·실습": "3",
                    "학점": "3",
                    "내용": "디지털 집적회로를 이용한 각종 logic 소자, MSI logic, flip-flop, decoder, MUX, 다중 output 회로, 가감연산장치, counter, shift register 등의 실험을 다룬다."
                    },
                    "AIE4010": {
                    "과목 코드": "AIE4010",
                    "합반 수업": "CSE4185",
                    "과목명": "기초인공지능",
                    "강의 시간": "3시간",
                    "이론": "3",
                    "학점": "3",
                    "선수과목": "AIE3050",
                    "내용": "인공지능의 기본적인 이론과 비수치 자료를 처리하는 프로그램을 다룬다."
                    },
                    "AIE4011": {
                    "과목 코드": "AIE4011",
                    "과목명": "기초추천시스템",
                    "강의 시간": "3시간",
                    "이론": "3",
                    "학점": "3",
                    "내용": "추천시스템은 사용자에게 맞춤형 유용한 정보를 제공함으로써, 사용자가 효율적인 의사 결정을 가능하게 한다. 본 교과목은 텍스트, 그래프, 수치형, 범주형 데이터를 효율적으로 분석하여 인공지능 기반의 추천시스템을 구축하는 방법을 습득한다. 내용 기반 필터링, 협업 필터링부터 최신 딥 뉴럴 네트워크 기반의 모델까지 다양한 추천시스템 알고리즘을 학습한다."
                    },
                    "AIE4012": {
                    "과목 코드": "AIE4012",
                    "합반 수업": "CSE4170",
                    "과목명": "기초컴퓨터그래픽스",
                    "강의 시간": "3시간",
                    "이론": "3",
                    "학점": "3",
                    "선수과목": "STS2005",
                    "내용": "3차원 그래픽스에 기초가 되는 렌더링, 애니메이션, 모델링 등의 기본 이론들을 다루고, 실습을 통하여 구현기법들을 익힌다."
                    },
                    "AIE4014": {
                    "과목 코드": "AIE4014",
                    "과목명": "딥러닝개론",
                    "합반 수업": "CSE4014",
                    "강의 시간": "3시간",
                    "이론": "3",
                    "학점": "3학점",
                    "내용": "심층신경망은 인공지능분야 기술의 혁신을 가능케한 핵심 기술이다. 본 수업에서는 심층신경망에 대한 기초적인 내용에 대하여 학습한다. 특히, 기초적인 퍼셉트론부터 시작하여 합성곱신경망(CNN) 등 최신 딥러닝 기술까지 학습한다."
                    },
                    "AIE4030": {
                    "과목 코드": "AIE4030",
                    "과목명": "지능형영상처리",
                    "강의 시간": "3시간",
                    "이론": "3",
                    "학점": "3학점",
                    "내용": "디지털 이미지의 취득, 변환, 화질 개선, 복원, 압축 등 이미지 프로세싱의 다양한 응용 예 등을 포함한 영상처리 기법에 대해 다룬다. 또한 이러한 영상처리 기술이 어떻게 최신 인공지능 기술에 적용되고 있는지에 대하여 배운다."
                    },
                    "AIE4050": {
                    "과목 코드": "AIE4050",
                    "과목명": "시스템프로그래밍",
                    "합반 수업": "CSE4100",
                    "강의 시간": "3시간",
                    "이론": "3",
                    "학점": "3학점",
                    "내용": "기계어의 구조와 매크로 언어의 특성, 그리고 어셈블러, 링커 및 로더, 매크로프로세서와 같은 대표적인 시스템 소프트웨어의 원리를 학습하고, 실제 시스템의 설계 및 구현에 대한 실습을 수행한다."
                    },
                    "AIE4051": {
                    "과목 코드": "AIE4051",
                    "과목명": "컴퓨터아키텍쳐",
                    "합반 수업": "CSE4010",
                    "강의 시간": "3시간",
                    "이론": "3",
                    "학점": "3학점",
                    "선수과목": "AIE3053",
                    "내용": "컴퓨터의 다양한 구조를 평가하는 평가기준을 학습하고, 컴퓨터 하드웨어와 소프트웨어의 인터페이스 역할을 하는 기계어의 구조 및 디자인 원리, 연산기의 구조, 기계어를 실행하는 CPU 회로, 메모리, 스토리지 구조 등 컴퓨터 시스템 구조의 다양한 주제를 학습한다."
                    },
                    "AIE4052": {
                    "과목 코드": "AIE4052",
                    "과목명": "기초컴퓨터네트워크",
                    "합반 수업": "CSE4175",
                    "강의 시간": "3시간",
                    "이론": "3",
                    "학점": "3학점",
                    "내용": "Internet, LAN, ATM 네트워크의 구조, 매체다중접근 방식, 네트워크 트래픽 흐름 및 혼잡제어방식, 라우팅 알고리즘, 성능평가 방법 등을 다룬다."
                    },
                    "AIE4053": {
                    "과목 코드": "AIE4053",
                    "과목명": "운영체제",
                    "합반 수업": "CSE4070",
                    "강의 시간": "3시간",
                    "이론": "3",
                    "학점": "3학점",
                    "선수과목": "AIE3050",
                    "내용": "컴퓨터 운영 체제에 대한 기본 개념과 운영 체제의 각 부분에 (프로세스 관리, 메모리 관리, 파일 시스템, 분산 처리 시스템) 대한 관리 방법을 다룬다. 또한 현존하는 여러 운영 체제에 대한 실 예를 통하여 각 운영 체제에 대한 특징을 이해하고, 실제 습득한 내용을 실습 및 프로젝트를 통하여 구현해 봄으로써 과목에 대한 이해를 높인다."
                    },
                    "AIE4054": {
                    "과목 코드": "AIE4054",
                    "과목명": "지능형통신시스템",
                    "합반 수업": "CSE4060",
                    "강의 시간": "3시간",
                    "이론": "3",
                    "학점": "3학점",
                    "내용": "데이터 통신과 네트워크의 기초가 되는 정보통신의 기본원리와 기반이론에서부터 그 응용에 이르기까지 다양하고 폭넓은 내용을 터득하여 차세대 정보통신 분야에서 활용할 수 있는 능력을 키운다. 먼저 데이터통신을 위한 기본적인 작동원리를 배우고 또한 네트워크의 기초 보안기술에 대해 학습한다. 또한 차세대 무선통신 기술들과 차세대 지능형 시스템의 운용을 위한 기초적인 적용이론과 기초개념을 다룬다."
                    },
                    "AIE4055": {
                    "과목 코드": "AIE4055",
                    "과목명": "데이터베이스시스템",
                    "합반 수업": "CSE4110",
                    "강의 시간": "3시간",
                    "이론": "3",
                    "학점": "3학점",
                    "내용": "파일처리 시스템과의 차이점, 데이터베이스의 특성, 데이터 모형 등 데이터베이스 시스템의 기본개념과 구조를 다룬다."
                    },
                    "AIE4056": {
                    "과목 코드": "AIE4056",
                    "과목명": "자동장치이론",
                    "합반 수업": "CSE4085",
                    "강의 시간": "3시간",
                    "이론": "3",
                    "학점": "3학점",
                    "내용": "유한자동장치, 정규식, 튜링기계, 계산가능함수, 정규언어, 문맥자유언어 등의 문법과 그들을 인지하는 기계 등을 다룬다."
                    },
                    "AIE4090": {
                    "과목 코드": "AIE4090",
                    "과목명": "인공지능캡스톤디자인 Ⅰ",
                    "강의 시간": "3시간",
                    "이론": "3",
                    "학점": "3학점",
                    "내용": "본 과목은 인공지능 전공과목으로부터 습득한 이론적 지식과 개념을 바탕으로 산업현장에서 발생하고 있는 기술적 문제점을 파악 및 정의하여 해결할 수 있는 방안을 설계하고 실제 구현해봄으로써 체계적인 프로세스에 바탕을 둔 실제적 문제 해결 능력을 함양시키는 것을 목표로 한다."
                    },
                    "AIE4091": {
                    "과목 코드": "AIE4091",
                    "과목명": "인공지능캡스톤디자인 Ⅱ",
                    "강의 시간": "3시간",
                    "이론": "3",
                    "학점": "3학점",
                    "내용": "본 과목은 인공지능캡스톤디자인I에서 습득한 문제 정의, 설계 및 구현을 통한 문제 해결 능력을 고도화하여 보다 완성도 높은 결과물을 개발하는 과정을 경험함으로써 산업현장에서 적용 가능한 실무 역량을 함양시키는 것을 목표로 한다."
                    },
                    "AIE4092": {
                    "과목 코드": "AIE4092",
                    "과목명": "인공지능세미나",
                    "강의 시간": "3시간",
                    "이론": "3",
                    "학점": "3학점",
                    "내용": "인공지능 분야의 이론 및 응용 분야의 최근 연구 주제와 발전 동향을 세미나 형식으로 발표하고 토론함으로써, 학계와 산업계의 주요 관심사와 연구 및 개발 방향을 공유하는 것을 목표로 한다."
                    },
                    "AIE4093": {
                    "과목 코드": "AIE4093",
                    "과목명": "인공지능인턴십",
                    "강의 시간": "",
                    "이론": "",
                    "학점": "3학점",
                    "내용": "산업체에서 인턴십을 수행하며 문제점과 해결 방안을 현장에서 체험하고 구현 및 적용해봄으로써 산업체 현장에서의 문제 해결 역량을 함양시키는 것을 목표로 한다."
                    },
                    "AIEG101": {
                    "과목 코드": "AIEG101",
                    "과목명": "강화학습개론",
                    "합반 수업": "CSEG516",
                    "강의 시간": "3시간",
                    "이론": "3",
                    "학점": "3학점",
                    "내용": "강화학습은 연속적인 의사결정을 위해 사용되는 머신러닝 패러다임으로서, 주어진 상황에서 최적의 행동을 효과적으로 찾아내기 위한 방법론이다. 본 과목에서는 강화학습의 기반이 되는 수학적 이론과 최신 강화학습 알고리즘을 학습하고, 실습 및 프로젝트를 통해 새로운 문제에 강화학습을 적용하여 문제를 해결할 수 있는 능력을 갖추는 것을 목표로 한다."
                    },
                    "AIEG102": {
                    "과목 코드": "AIEG102",
                    "과목명": "패턴인식",
                    "합반 수업": "CSEG416",
                    "강의 시간": "3시간",
                    "이론": "3",
                    "학점": "3학점",
                    "내용": "패턴인식은 패턴매칭, 통계적 분석, 구조적 분석, 신경망 처리 등을 이용하여 패턴의 특성을 분석하는 학문이다. 본 교과목에서는 통계적 패턴인식 방법, 고차원 데이터 처리, 군집화 및 신경망 기반 처리 방법 등에 대하여 학습하게 된다. 다양한 데이터를 분석하는 알고리즘의 학습과 프로젝트에서의 구현을 통하여 데이터를 처리하는 통찰력을 배양하도록 한다."
                    },
                    "AIEG103": {
                    "과목 코드": "AIEG103",
                    "과목명": "기초확률적기계학습",
                    "강의 시간": "3시간",
                    "이론": "3",
                    "학점": "3학점",
                    "내용": "기계학습의 방법론 중 하나인 확률적 접근에 기반한 학습에 대해서 다룬다. 특히 확률이론, 가우시안 모델, 가우시안 프로세스, 베이지언 통계, 베이지언 네트워크 및 베이지언 최적화, 확률적추론, MCMC 등에 대해서 다룬다. 본 교과목은 수강생들이 기초적인 머신러닝과 확률 및 통계, 랜덤 프로세스에 대하여 알고 있다고 가정한다."
                    },
                    "AIEG104": {
                    "과목 코드": "AIEG104",
                    "과목명": "인과적기계학습",
                    "강의 시간": "강의 3시간：이론 3",
                    "학점": "3학점",
                    "내용": "현재 기계학습 기술들은 인과적인 관계에 의해 추론을 한다기보다는 상관적인 관계에 의존하여 추론을 하고 있다. 비록 높은 성능을 달성하고는 있지만 현 상태에서는 고수준의 신뢰수준이 요구되는 작업에 기계학습 기술을 활용하기 어렵다. 본 교과목에서는 기계학습 기법들의 현 상황에 대하여 점검하고 인과적 관계를 활용하기 위해 어떤 장벽들을 해결해야 하는지 학습한다."
                    },
                    "AIEG105": {
                    "과목 코드": "AIEG105",
                    "과목명": "컴퓨터비전",
                    "강의 시간": "강의 3시간：이론 3",
                    "학점": "3학점",
                    "내용": "본 교과목에서는 이미지 생성, 표현, 처리에 대한 내용과, 딥러닝을 이용한 컴퓨터비전 문제 해결 방법에 대하여 배운다. 이미지의 기본적인 처리 및 인식 방법, 2차원 또는 3차원 데이터로부터 피처를 추출하여 활용하고, 3차원 데이터를 처리하거나 합성하는 방법에 대하여도 배우게 된다. 학생들은 다수의 프로그래밍 실습 프로젝트를 수행함으로써 다양한 컴퓨터비전 문제 해결 능력을 배양하게 된다.",
                    "비고": "합반 수업: CSEG418"
                    },
                    "AIEG106": {
                    "과목 코드": "AIEG106",
                    "과목명": "기초자연어처리",
                    "강의 시간": "강의 3시간：이론 3",
                    "학점": "3학점",
                    "내용": "본과목의 목표는 최신 자연어처리의 기본 개념을 이해하는 것이다. Word vector, context vector 생성 방법 및 ELMO(Embeddings from Language Model), GPT(Generative Pre-trained Transformer), BERT(Bidirectional Encoder Representations from Transformer)의 개념을 이해하고, 이의 이해에 필요한 딥뉴럴넷 모델에 대해 공부한다."
                    },
                    "AIEG107": {
                    "과목 코드": "AIEG107",
                    "과목명": "음성인식",
                    "강의 시간": "강의 3시간：이론 3",
                    "학점": "3학점",
                    "내용": "본 과목의 목표는 대화형 사용자 인터페이스 시스템을 구성하고 있는 주요 요소인 음성인식의 기본 개념을 이해하는 것이다. 딥러닝 기반의 음성인식 주요 기술 및 최근 기술 동향을 NN-WFST, CTC, RNN-T, Seq2Seq, Tramsformer 중심으로 살펴보고, 음향 모델은 DNN-HMM을 중심으로, 언어 모델은 n-gram 중심으로, 디코딩 네트워크는 WFST 중심으로 공부한다. 그리고, 음성인식 관련 오픈 소스 기반 프로그램을 소개한다.",
                    "비고": "합반 수업: CSEG311"
                    },
                    "AIEG108": {
                    "과목 코드": "AIEG108",
                    "과목명": "확장현실시스템",
                    "강의 시간": "강의 3시간：이론 3",
                    "학점": "3학점",
                    "내용": "가상 현실(Virtual Reality, VR), 증강 현실(Augmented Reality, AR), 그리고 혼합 현실(Mixed Reality, MR) 기술을 아우르는 확장 현실(Extended Reality, XR) 기술에 대한 이해도를 높이고 그에 대한 소프트웨어 구현 능력을 습득한다.",
                    "비고": "합반 수업:CSEG450"
                    },
                    "AIEG109": {
                    "과목 코드": "AIEG109",
                    "과목명": "오디오인식및합성변환",
                    "강의 시간": "강의 3시간：이론 3",
                    "학점": "3학점",
                    "내용": "본 과목의 목표는 오디오 이벤트 인식, 음악 인식, 화자인식, 음성 합성, 음성 변환, 음성인식용 언어모델에 필요한 기술을 이해하는 것이다. 이의 이해에 필요한 딥뉴럴넷 모델에 대해서 공부한다."
                    },
                    "AIEG110": {
                    "과목 코드": "AIEG110",
                    "과목명": "기초대화처리",
                    "강의 시간": "강의 3시간：이론 3",
                    "학점": "3학점",
                    "내용": "본과목의 목표는 목적지향 대화처리, chit-chat 대화처리 관련 최신 대화처리의 기본 개념을 이해하는 것이다. 대화처리에 관련된 강화학습, end-to-end 방법, semantic decoder, dialogue state tracking등에 대해 공부한다."
                    },
                    "AIEG111": {
                    "과목 코드": "AIEG111",
                    "과목명": "딥러닝과음악예술개론",
                    "강의 시간": "강의 3시간：이론 3",
                    "학점": "3학점",
                    "내용": "본 교과목은 딥러닝을 이용하여 음악 데이터의 특성을 이해하고, 악보 채보와 새로운 음악 및 오디오를 합성하는 기초 이론에 대하여 설명한다. 이를 바탕으로 적절한 딥러닝 구조를 설계하여, 딥러닝을 통해 음악을 이해하고 생성해내는 개요를 이해한다."
                    },
                    "AIEG112": {
                    "과목 코드": "AIEG112",
                    "과목명": "소셜미디어데이터분석",
                    "강의 시간": "강의 3시간：이론 3",
                    "학점": "3학점",
                    "내용": "다양한 소셜 미디어 데이터를 분석하는 기초 기술을 배운다. 이를 위하여 소셜 미디어 데이터의 그래프 모델링, 탐색 및 측정 기법등에 대한 기초 이론을 배우고, 소셜 미디어 데이터 분석에 기본적으로 필요한 기술들을 공부한다."
                    },
                    "AIEG113": {
                    "과목 코드": "AIEG113",
                    "과목명": "기초시계열데이터분석및예측",
                    "강의 시간": "강의 3시간：이론 3",
                    "학점": "3학점",
                    "내용": "시계열 분석의 이해를 위해 다양한 시계열 자료 기초 분석기법을 학습한다. 패널자료 분석, 시계열 분해 모델, ARMA, ARMAX, SARMAX 모델, 스펙트럴 분석, 딥러닝 모델의 개요를 학습한다. 시계열 분석의 주요 개념들에 대한 기초이론에 대해 학습한다."
                    },
                    "AIEG114": {
                    "과목 코드": "AIEG114",
                    "과목명": "데이터마이닝",
                    "강의 시간": "강의 3시간：이론 3",
                    "학점": "3학점",
                    "내용": "데이터로부터 지식을 도출해내는 데이터마이닝의 개념을 소개하고 지식도출을 위한 기계학습의 개념 및 알고리즘을 이해하고 다양한 응용에 적용해본다. 구체적인 주제로는 연관성분석, 의사결정트리, 베이지언추론, 지지벡터머신, 군집화, 심층학습, 강화학습 등이다.",
                    "비고": "합반 수업: CSEG312"
                    },
                    "AIEG115": {
                    "과목 코드": "AIEG115",
                    "과목명": "수치컴퓨팅및GPU프로그래밍",
                    "강의 시간": "강의 3시간：이론 3",
                    "학점": "3학점",
                    "내용": "다양한 분야에서 발생하는 수치 계산 문제의 해결에 필요한 수치 해석 알고리즘을 다룬다. 또한 방대한 계산을 요하는 수치 계산 문제에 대하여 고성능 GPU 상에서의 병렬 프로그래밍을 통한 효과적인 문제 해결 방법에 대하여 익힌다.",
                    "비고": "합반 수업: CSEG437"
                    },
                    "AIEG116": {
                    "과목 코드": "AIEG116",
                    "과목명": "병렬분산컴퓨팅",
                    "강의 시간": "강의 3시간：이론 3",
                    "학점": "3학점",
                    "내용": "인터넷에 연결된 여러 컴퓨터들의 처리 능력을 이용하여 문제를 해결하기 위한 분산처리 프로그래밍 기법 및 알고리즘을 소개하고 실제 응용에 적용해 본다.",
                    "비고": "합반 수업:CSEG414"
                    }
                }
            },
            "AI기반 자유전공학부": {
                "과목 정보": {
                    "AII1001": {
                        "과목 코드": "AII1001",
                        "과목명": "자유전공진로탐색 Ⅰ",
                        "학점": "0학점",
                        "내용": "본 교과는 AI를 기반으로 하는 다양한 전공에 대한 전반적인 이해를 통해 학생들의 적성에 부합하는 진로를 찾고 설계할 수 있도록 하는 교과목이다. 주로 AI분야로부터 비롯된 현상을 이해하고 그 인과관계의 분석이 우리의 삶과 밀접한 관계가 있다는 것을 배운다."
                    },
                    "AII2010": {
                        "과목 코드": "AII2010",
                        "과목명": "인공지능입문 Ⅰ",
                        "강의 시간": "3시간",
                        "학점": "3학점",
                        "내용": "인공지능의 기본 개념부터 인공지능 기술 구현에 필요한 소프트웨어, 하드웨어 등 요소 기술에 대해 학습한다. 인공지능 모델 개발에 필요한 기본 알고리즘 등에 대하여 학습하고, 딥러닝, 자연어처리, 컴퓨터비전 등 주요 인공지능 기술에 대하여 소개한다."
                    }
                }
            }
        }
    }
}