{
    "2025 서강대학교 요람": {
        "자연과학대학":{
            "수학과": {
                "과목 정보": {
                    "교양": [
                        {
                            "과목 코드": "STS2005",
                            "과목명": "미적분학 Ⅰ",
                            "강의시간": "강의 3시간",
                            "학점": "3학점",
                            "내용": "실수, 함수, 극한과 연속성, 미분계수, 도함수, 미분, 함수의 극치, 평균치 정리, 극대·극소의 응용, 정적분, 미적분학의 기본정리, 정적분의 응용, 초월함수의 미분 및 적분과 그 응용, 미분법, 극좌표, 극방정식 등을 다룬다."
                        }
                    ],
                    "전공입문": [
                        {
                            "과목 코드": "STS2004",
                            "과목명": "대학수학",
                            "강의시간": "강의 3시간",
                            "학점": "3학점",
                            "내용": "Boole 대수, 벡터와 볼록집합, 행렬과 행렬식, 미분법과 그 응용, 적분, 편미분법과 그 응용, 차분방정식과 미분방정식, 통계 중 적당한 내용을 선정하여 다룬다.",
                            "비고": "경제학부, 경영학부 대상"
                        },
                        {
                            "과목 코드": "STS2006",
                            "과목명": "미적분학 Ⅱ",
                            "강의시간": "강의 3시간",
                            "학점": "3학점",
                            "내용": "편미분, 유향미분계수, 이중적분, 이중적분의 응용, 삼중적분, 삼중적분의 응용, 선적분, 면적분, 그린정리, 스토크스정리, 다이버전스정리 등을 다룬다.",
                            "선수과목": "STS2005"
                        }
                    ],
                    "전공": [
                        {
                            "과목 코드": "MAT1050",
                            "과목명": "미적분학실습 Ⅰ",
                            "강의시간": "실습 2시간",
                            "학점": "1학점",
                            "내용": "미적분학 I에서 배운 내용을 토대로 컴퓨터를 이용한 여러 활용을 실습한다.",
                            "선수과목": "STS2005, SCI1011 (동시 수강 가능)"
                        },
                        {
                            "과목 코드": "MAT1060",
                            "과목명": "미적분학실습 Ⅱ",
                            "강의시간": "실습 2시간",
                            "학점": "1학점",
                            "내용": "미적분학 II에서 배운 내용을 토대로 컴퓨터를 이용한 여러 활용을 실습한다.",
                            "선수과목": "STS2006, SCI1011 (동시 수강 가능)"
                        },
                        {
                            "과목 코드": "MAT2010",
                            "과목명": "집합론",
                            "강의시간": "강의 3시간",
                            "학점": "3학점",
                            "내용": "공리, 명제, 논리, 집합과 그 연산, 관계와 함수, 동치관계, 함수의 합성, 전, 단사 함수, 역함수, 유한 및 무한집합, 가산집합, 기수와 그 연산, Cantor-Bernstein 정리, 순서집합, 정열집합, 선택공리와 그 응용, 서수와 그 연산 등을 다룬다."
                        },
                        {
                            "과목 코드": "MAT2110",
                            "과목명": "선형대수학",
                            "강의시간": "강의 3시간",
                            "학점": "3학점",
                            "내용": "행렬, 행렬의 기본변형, Gauss-Jordan 소거법, 행렬식, 연립일차방정식, 벡터공간, 부분공간, 기저와 차원, 선형변환, 선형변환과 행렬, 고유치와 고유벡터, 고유공간, 대각화, 내적공간, 정규직교기저, 직교변환, 직교행렬, 불변부분공간, 최소다항식 등 선형대수학의 기초를 다룬다.",
                            "선수과목": "STS2005 또는 STS2004, SCI1011"
                        },
                        {
                            "과목 코드": "MAT2120",
                            "과목명": "정수론",
                            "강의시간": "강의 3시간",
                            "학점": "3학점",
                            "내용": "정수의 기본성질, 최대공약수와 최소공배수, 소수, 인수분해, 합동식의 성질, 잉여류, Fermat의 정리, Euler의 정리, 중국인의 나머지 정리, 합동식의 응용, 이차잉여, Legendre 기호, 이차잉여의 응용, 연분수, 연분수 전개, 대수적 정수 등 정수론의 기본 사항을 다룬다."
                        },
                        {
                            "과목 코드": "MAT2210",
                            "과목명": "고등미적분학 Ⅰ",
                            "강의시간": "강의 3시간",
                            "학점": "3학점",
                            "내용": "실수계, 유계집합, 함수, 수열과 함수의 극한, 함수의 연속성, 연속함수의 성질, 함수의 미분, 평균값정리, L’Hopital의 정리, Riemann 적분, 미적분학의 기본정리, 함수의 수열과 급수 등을 다룬다"
                        },
                        {
                            "과목 코드": "MAT2220",
                            "과목명": "고등미적분학 Ⅱ",
                            "강의시간": "강의 3시간",
                            "학점": "3학점",
                            "내용": "유클리드 공간, 다변수함수의 극한과 연속성, 다변수함수의 편미분과 전미분, 역함수정리, 중적분의 정의와 그 응용, 중적분의 변수변환 등을 다룬다.",
                            "선수과목": "MAT2210"
                        },
                        {
                            "과목 코드": "MAT2230",
                            "과목명": "미분방정식",
                            "강의시간": "강의 3시간",
                            "학점": "3학점",
                            "내용": "도함수를 포함하는 방정식의 해법을 취급하는 과목으로 관련되는 용어의 정의, 1계 미분방정식의 여러 가지 해법, 선형 미분방정식의 해법, 고계 미분방정식의 급수해, Laplace 변환과 그 성질, 초기치 문제의Laplace 변환에 의한 해법 등을 다뤄 수학 및 다른 이공계과목을 공부하기 위한 기초를 마련한다."
                        },
                        {
                            "과목 코드": "MAT2410",
                            "과목명": "응용수학 Ⅰ",
                            "강의시간": "강의 3시간",
                            "학점": "3학점",
                            "내용": "MAT3020과 동등한 과목이다."
                        },
                        {
                            "과목 코드": "MAT2420",
                            "과목명": "응용수학 Ⅱ",
                            "강의시간": "강의 3시간",
                            "학점": "3학점",
                            "내용": "벡터해석, 벡터함수의 미분학, 선적분 및 면적분과 그 응용, Fourier 급수, Fourier 변환, 1계 및 2계 편미분 방정식의 해법과 이에 관련한 수학적 모델, 열전도 방정식과 파동 방정식의 해법을 다룬다.",
                            "선수과목": "MAT2410"
                        },
                        {
                            "과목 코드": "MAT2510",
                            "과목명": "푸리에 해석 및 응용",
                            "강의시간": "강의 3시간",
                            "학점": "3학점",
                            "내용": "국소 긴밀 군상에서 콘볼루션 작용소 및 푸리에 변환의 기본성질을 공부하고 관련된 적분 작용소의 연속성을 공부한다. 이를 디지털 오디오(영상) 처리 등에 적용하여 공학적 현상을 이해한다."
                        },
                        {
                            "과목 코드": "MAT3020",
                            "과목명": "통계학입문",
                            "강의시간": "강의 3시간",
                            "학점": "3학점",
                            "내용": "MAT2410과 동등한 과목이다. 자료의 정리방법, 확률, 확률분포, 표본분포, 추정, 검정 등에 대한 기초개념을 다루고, 또한 통계 팩키지를 이용하여 실제문제의 처리방법을 다룬다."
                        },
                        {
                            "과목 코드": "MAT3110",
                            "과목명": "이산수학",
                            "강의시간": "강의 3시간",
                            "학점": "3학점",
                            "내용": "수리논리, 순서집합, 격자, 대수적격자, 개념격자, 대수적 ∩－구조, 부울대수, 반군, 그래프, 유향그래프, 나무그래프, 그래프채색, 순열과 조합, 점화관계, 생성함수 등에서 선정하여 다룬다."
                        },
                        {
                            "과목 코드": "MAT3310",
                            "과목명": "다양체기하학",
                            "강의시간": "강의 3시간",
                            "학점": "3학점",
                            "내용": "유클리드 공간의 미분형식과 그 연산방법들을 다루며, 곡선과 곡면을 일반화한 개념으로써 미분다양체라는 공간을 정의하고, 미분다양체 상의 미분형식과 연산법 그리고 미분과 적분을 학습한다. 기하학과 해석학 그리고 물리학, 공학 등에서도 중요한 스토크스 정리를 다룬다."
                        },
                        {
                            "과목 코드": "MAT3410",
                            "과목명": "확률론입문",
                            "강의시간": "3시간",
                            "학점": "3학점",
                            "선수과목": [
                                "MAT2210",
                                "MAT3020"
                            ],
                            "내용": "조건부 확률, 독립성, 확률변수, 기대값 등의 기본적인 개념들을 학습하고 현대 확률론의 기본정리인 대수의 법칙과 중심극한 정리를 증명한다. 그리고 응용 및 심화과정으로 통계적 추론 또는 포아송과정, 마팅겔, 브라운운동 등의 특수한 확률과정들에 대한 기초이론을 다룬다."
                        },
                        {
                            "과목 코드": "MAT3420",
                            "과목명": "금융수학",
                            "강의시간": "3시간",
                            "학점": "3학점",
                            "내용": "금융이론의 해석을 목적으로 다음의 내용을 다룬다. 수익과 위험, 금융포트폴리오 이론, 파생상품이론, Black-Sholes Formula, Ito's Lemma, 추계적 과정을 다룬다."
                        },
                        {
                            "과목 코드": "MAT3430",
                            "과목명": "응용통계학 및 실습",
                            "강의시간": "3시간, 실습",
                            "학점": "3학점",
                            "선수과목": "MAT3020",
                            "내용": "실제적인 통계문제를 SAS 등을 사용하여 계산하는 방법을 배운다."
                        },
                        {
                            "과목 코드": "MAT3440",
                            "과목명": "통신수학",
                            "강의시간": "3시간",
                            "학점": "3학점",
                            "선수과목": [
                                "MAT2110",
                                "MAT2120",
                                "MAT2210",
                                "MAT2220",
                                "MAT4210",
                                "SCI1021"
                            ],
                            "내용": "격년제로 대칭통신로, 오류정정부호, 해밍거리와 해밍무게, 최적복호방법, 선형부호, 생성행렬과 검사행렬, 쌍대부호, 맥윌리엄스의 항등식, 유한체의 구조, 순환부호, BCH 및 RS 부호, 비밀 및 공개키 암호체계, RSA 및 Elgamal 암호체계, 타원곡선 암호체계를 다루거나 디지털 이미지의 수리적 이해, 콘볼루션 (마스크 처리), Laplace 방정식 및 평균값 의 정리, 이산 푸리에 변환, 이산 코사인 변환, 압축을 이용한 행렬의 근사, 표본이론, Gibbs현상을 다룬다."
                        },
                        {
                            "과목 코드": "MAT3450",
                            "과목명": "계산수학 및 실습",
                            "강의시간": "3시간, 실습",
                            "학점": "3학점",
                            "선수과목": [
                                "MAT2110",
                                "MAT2210",
                                "MAT2220",
                                "MAT4210",
                                "SCI1021"
                            ],
                            "내용": "Matlab (Mathematica) 또는 c-언어의 기본개념으로부터 응용과학에서 나타나는 미분방정식, 적분 문제, 최적화 문제 등을 수치해석적인 관점에서 알고리즘을 구현할 수 있는 능력을 키운다."
                        },
                        {
                            "과목 코드": "MAT3451",
                            "과목명": "전공진로설계Ⅰ",
                            "강의시간": "0시간",
                            "학점": "0학점",
                            "내용": "학생들은 본 교과를 통해 지도교수로부터 전공 진로 관련 상담을 받을 수 있으며, 해당 전공 출신 선배의 진학/취업/진로 등 사례를 통해 자기 주도적 계획을 설계할 수 있다."
                        },
                        {
                            "과목 코드": "MAT3460",
                            "과목명": "수학인턴쉽",
                            "강의시간": "실습",
                            "학점": "3학점",
                            "내용": "수학 분야에서 현장 적응력과 창의력을 지닌 인재를 양성하기 위하여 기업과 공동으로 운영하며 정해진 기간동안 국내외 산업현장에서 실습교육을 실시하여 현장경험 및 실무능력을 배운다."
                        },
                        {
                            "과목 코드": "MAT3470",
                            "과목명": "수리적 데이터분석",
                            "강의시간": "3시간",
                            "학점": "3학점",
                            "내용": "수리적 데이터분석에서는 다음과 같은 주제를 다룬다. 인공지능에 필요한 인공 신경망, 모호한 데이터를 다루는 퍼지집합의 이론, 유한개의 스냅샷을 이용하여 비선형 동역학계 근사, 관측 데이터와 수학적 모델 예측을 결합하여 보다 정확한 매개변수 추정치를 제공하는 데이터 동화 기법 등을 다룬다."
                        },
                        {
                            "과목 코드": "MAT4110",
                            "과목명": "추상대수학 Ⅰ",
                            "강의시간": "3시간",
                            "학점": "3학점",
                            "선수과목": [
                                "MAT2110",
                                "SCI1021"
                            ],
                            "내용": "군, 부분군, Lagrange의 정리, 정규부분군, 잉여군, 준동형사상, 핵, 군에 대한 동형 정리, 직적과 직합, Cayley의 정리, 켤레류 등군론에 관한 기본사항과 그리고 환, 가환환, 정역, 나눗셈환, 체, 부분환, 이데알, 잉여환, 환에 대한 동형정리, 직합 등 환론에 관한 기본사항을 다룬다."
                        },
                        {
                            "과목 코드": "MAT4120",
                            "과목명": "추상대수학 Ⅱ",
                            "강의시간": "3시간",
                            "학점": "3학점",
                            "선수과목": "MAT4110",
                            "내용": "극대이데알과 소이데알, 분수체, 다항식환, 기약다항식, Eisenstein의 정리, 행렬환, 벡터공간, 벡터공간의 차원, 선형사상, 확대체, 작도 가능성, 분해체, Galois군, 가해군, 다항식의 가해성을 다룬다."
                        },
                        {
                            "과목 코드": "MAT4210",
                            "과목명": "복소수함수론 Ⅰ",
                            "강의시간": "3시간",
                            "학점": "3학점",
                            "선수과목": "MAT2210",
                            "내용": "고등수학의 기본이 되는 복소함수의 이론을 마련하기 위한 과목으로 복소수계, 복소 평면상의 위상, 곡선과 영역, 복소함수의 미분 및 적분, 정칙함수 및 그의 성질, 정 칙함수의 적분, 멱급수와 정칙함수간의 관계 등을 다룬다."
                        },
                        {
                            "과목 코드": "MAT4220",
                            "과목명": "복소수함수론 Ⅱ",
                            "강의시간": "3시간",
                            "학점": "3학점",
                            "선수과목": "MAT4210",
                            "내용": "복소수함수론 Ⅰ의 계속 과목으로 정칙함수에 관한 Cauchy의 정리, 최대값 원리, 특이점에서의 Laurent 급수 전개, 유수정리와 적분법, 특이적분에의 응용, 조화함 수, Poisson의 적분공식과 Dirichlet 원리, 등각사상 등을 다룬다."
                        },
                        {
                            "과목 코드": "MAT4310",
                            "과목명": "미분기하학",
                            "강의시간": "3시간",
                            "학점": "3학점",
                            "선수과목": [
                                "MAT2110",
                                "MAT2210",
                                "SCI1021"
                            ],
                            "내용": "공간곡선, 곡선에 관한 존재성과 유일성의 정리, 평면곡선에 관한 대역적 정리, 정칙곡면, 접공간과 미분사상, 가우스 사상, 평행이동과 축지선, 등각사상, The second fundamental form과 Weingarten map, Principal, Gaussian, mean and normal curvatures 등을 다룬다."
                        },
                        {
                            "과목 코드": "MAT4320",
                            "과목명": "위상수학개론 Ⅰ",
                            "강의시간": "3시간",
                            "학점": "3학점",
                            "선수과목": [
                                "MAT2010",
                                "MAT2210"
                            ],
                            "내용": "거리공간, 정의와 예, 개집합, 폐집합, 기, 근방, 폐포, 내부, 연속성, 동치거리, 부분공간, 곱공간, 완비거리공간, 실수의 연결집합, 옹골집합 등을 다룬다."
                        },
                        {
                            "과목 코드": "MAT4330",
                            "과목명": "위상수학개론 Ⅱ",
                            "강의시간": "3시간",
                            "학점": "3학점",
                            "선수과목": "MAT4320",
                            "내용": "위상공간, 새로운 위상공간, 연결성, 옹골성, 분리공간, 가산공간과 거리화 정리, 완비거리공간, 함수공간 등의 주제를 다룬다."
                        },
                        {
                            "과목 코드": "MAT4331",
                            "과목명": "산업수학종합설계",
                            "강의시간": "3시간",
                            "학점": "3학점",
                            "선수과목": [
                                "STS2005",
                                "STS2006",
                                "MAT2110",
                                "SCI1011",
                                "SCI1021"
                            ],
                            "내용": "빅데이터 분석에 꼭 필요한 데이터 마이닝의 기본방법과 머신러닝에 대하여 소개한다. 빅데이터 분석 언어인 R을 기초 사용하는 방법까지 소개한다."
                        },
                        {
                            "과목 코드": "MAT4340",
                            "과목명": "편미분방정식",
                            "강의 시간": "3시간",
                            "학점": "3학점",
                            "선수과목": [
                            "MAT2210",
                            "MAT2230"
                            ],
                            "내용": "선형 및 비선형 편미분방정식에 대한 기본적인 결과들을 소개한다. 특히, 일계 선형편미분방정식, 운송방정식, 파동방정식, 열(확산)방정식, 라플라스방정식, 초기조건 및 경계조건, 푸리에급수, 해의 안정성, 최대원리 등을 다룬다."
                        },
                        {
                            "과목 코드": "MAT4510",
                            "과목명": "학부개별연구",
                            "강의 시간": "3시간",
                            "학점": "3학점",
                            "내용": "3,4학년 전공학생을 대상으로 하는 과목이며 지도교수를 정하여 개별적으로 세미나 또는 연구를 수행한다. 특수연구로서 전공학점으로 인정되지 않음."
                        },
                        {
                            "과목 코드": "MATG110",
                            "과목명": "고급선형대수학",
                            "강의 시간": "3시간",
                            "학점": "3학점",
                            "선수과목": [
                            "MAT2110",
                            "SCI1021"
                            ],
                            "내용": "대각화, 불변 부분공간, 내적공간, 정규변환과 정규행렬, 유니티리 변환과 유니티리 행렬, 직교변환과 직교행렬, 표준형, 대칭형, 반대칭형, 고전선형군, 리대수 등의 주제를 다룬다."
                        },
                        {
                            "과목 코드": "MATG210",
                            "과목명": "실변수함수론",
                            "강의 시간": "3시간",
                            "학점": "3학점",
                            "선수과목": "MAT2220",
                            "내용": "실수 집합의 위상, Borel 집합, Lebesgue 측도, 측도의 성질, 가측함수, Lebesgue 적분, 적분의 수렴성 등을 다룬다."
                        }
                    ],
                    "교직": [
                        {
                            "과목 코드": "MATQ981",
                            "과목명": "수학교과교육론",
                            "강의 시간": "3시간",
                            "학점": "3학점",
                            "내용": "수학교육의 발달과정과 이론적 배경을 탐색한다. 교수학습 이론, 교육과정 개발의 원리, 문제 해결력, 교사의 전문성, 교수 공학의 활용, 그리고 평가 등을 다룬다.",
                            "비고": "교직이수자에게만 전공학점으로 인정됨"
                        },
                        {
                            "과목 코드": "MATQ982",
                            "과목명": "수학교과 논리 및 논술",
                            "강의 시간": "3시간",
                            "학점": "3학점",
                            "내용": "수학교육의 목표는 논리적인 사고력 배양과 표현능력이다. 수학의 논리적 사고력에 대한 체계적이고 학술적인 이해와 함께, 논리적인 글씨기 능력 계발을 위한 다양한 이론과 교수 방법을 살펴본다."
                        },
                        {
                            "과목 코드": "MATQ983",
                            "과목명": "수학교과교재연구 및 지도법",
                            "강의 시간": "3시간",
                            "학점": "3학점",
                            "내용": "중등 수학교과 교육과정 및 교과서에 대한 체계적인 분석과 수학교과교육론에서 탐색한 여러 이론과 다양한 교수 방법을 적용하여 학습자 중심의 수학 교수법을 탐구하고 개발한다."
                        }
                    ]
                }
            },
            "물리학과": {
                "과목 정보": {
                    "전공 과목 정보" : [
                        {
                            "과목 코드": "PHY1001",
                            "과목명": "일반물리I",
                            "강의시간": "강의 3시간",
                            "학점": "3학점",
                            "내용": "역학과 열물리의 기초를 다룬다. 뉴턴의 운동법칙, 에너지, 운동량, 회전운동, 만유인력, 진동, 유체, 파동방정식, 온도와 열, 열역학법칙 등을 다룬다."
                        },
                        {
                            "과목 코드": "PHY1002",
                            "과목명": "일반물리Ⅱ",
                            "강의시간": "강의 3시간",
                            "학점": "3학점",
                            "내용": "전자기학의 기초를 다룬다. 정전기, 전기포텐셜, 전류와 움직이는 전하의 전기장과 자기장, 전자기파와 기하광학 및 파동광학 현상에 대해 다룬다. 물질파와 현대물리에 대한 기초를 배운다."
                        },
                        {
                            "과목 코드": "PHY1101",
                            "과목명": "일반물리 실험I",
                            "강의시간": "실험 2시간",
                            "학점": "1학점",
                            "내용": "역학에 관한 기초적인 실험을 다룬다. 확률 및 오차론, 중력가속도, 운동량 및 에너지 보존, 힘의 평형에 관한 실험, 열의 일당량, 물성(표면장력, 영률), 파동 등에 관한 실험을 한다."
                        },
                        {
                            "과목 코드": "PHY1102",
                            "과목명": "일반물리 실험Ⅱ",
                            "강의시간": "실험 2시간",
                            "학점": "1학점",
                            "내용": "광학에 관한 기초적인 실험을 다룬다. 기하 광학, 빛의 반사와 굴절, 전반사와 분산현상, 빛깔, 편극, 격자, 거울, 렌즈와 수차 등을 다룬다."
                        },
                        {
                            "과목 코드": "PHY2001",
                            "과목명": "역학I",
                            "강의시간": "강의 3시간",
                            "학점": "3학점",
                            "내용": "행렬, 벡터 연산, 뉴튼 법칙, 기준틀, 보존법칙, 중력 위치에너지, 뉴우튼 역학의 한계, 단순 조화진동자, 감쇠 진동, 전기적 진동, 강제 진동, 라플라스 변환 방법, 비선형 진동, 변분법, 오일러 방정식, 해밀톤 원리 등을 다룬다."
                        },
                        {
                            "과목 코드": "PHY2002",
                            "과목명": "역학Ⅱ",
                            "강의시간": "강의 3시간",
                            "학점": "3학점",
                            "내용": "라그랑지안, 해밀토니안 역학, 그리고  관련된 보존법칙 등을 다룬다. 또한 이를 일반화시켜서 파동현상 등에 적용한다. 특수 상대성이론 그리고 관련된 충돌이론을 다룬다"
                        },
                        {
                            "과목 코드": "PHY2003",
                            "과목명": "전자기학I",
                            "강의시간": "강의 3시간",
                            "학점": "3학점",
                            "내용": "쿨롱 법칙, 가우스 법칙, 정전기들의 보존성과 기적 위치 에너지, 라플라스 방정식과 그 해의 응용, 도체 전기적 성질과 저항 및 유전체의 전기적 성질과 유전 상수, 전류와 자기들 사이의 관계, 솔레노이드의 자장특성, 자기쌍극자와 물질의 자기적 성질 등을 다룬다. ",
                            "비고": "전자 EEE2101, 전자장론I로 대체할 수 있으며 이 중에서 한 과목만을 학점 이수로 인정"
                        },
                        {
                            "과목 코드": "PHY2004",
                            "과목명": "전자기학Ⅱ",
                            "강의시간": "강의 3시간",
                            "학점": "3학점",
                            "내용": "맥스웰의 방정식, 파동방정식과 전자파의 성질, 빛의 물질 표면에서의 굴절, 흡수 및 투과율 계산, 빛의 간섭과 파브리－페로현상 분석, 전자파의 발생과 그린 함수 및 레오나드－존스 포텐샬 함수 유도, 전기들과 자기들의 상대론적 변환 등을 다룬다.",
                            "비고": "전자 EEE2102, 전자장론Ⅱ로 대체할 수 있으며 이 중에서 한 과목만을 학점 이수로 인정"
                        },
                        {
                            "과목 코드": "PHY2005",
                            "과목명": "수리물리학I",
                            "강의시간": "강의 3시간",
                            "학점": "3학점",
                            "내용": "물리학의 바탕이 되는 무한급수, 급수의 수렴 및 발산 멱급수, 복소수, 오일러 공식, 벡터, 행렬연산, 편미분, 라이프니쯔 공식, 중적분, 제이코비안, 벡터해석, 발산정리, 스톡스정리, 프리에급수, 복소수꼴의 푸리에 급수, 상미분 방정식을 다룬다."
                        },
                        {
                            "과목 코드": "PHY2006",
                            "과목명": "수리물리학Ⅱ",
                            "강의 시간": "3시간",
                            "학점": "3학점",
                            "내용": "PHY2005 수리물리학I에 이어서 오일러 방정식과 변분법, 고유값과 고유 벡터, 텐서 해석, 다이아딕, 감마함수, 벡터함수, 단순진자, 타원적분, 르장드르 방정식, 르장드르 다항식, 베셀함수, 라게르 함수, 라플라스 방정식, 포아송 방정식, Contour 적분, Residue 정리, 등각변환, 라플라스 변환, 프리에 변환, 디락델타 함수, 그린 함수, 확률 등을 배운다."
                        },
                        {
                            "과목 코드": "PHY2007",
                            "과목명": "전자물리학Ⅰ",
                            "강의 시간": "3시간",
                            "학점": "3학점",
                            "내용": "직류 및 교류 회로의 키르호프 제일, 제이법칙을 통한 분석, 반도체의 전자 띠 이론, 불순물과 정공 발생 및 p형과 n형 반도체의 접합 특성, 다이오드와 트랜지스터의 특성과 함께 트랜지스터 증폭 회로의 구성과 응용을 다룬다."
                        },
                        {
                            "과목 코드": "PHY2008",
                            "과목명": "전자 물리학Ⅱ",
                            "강의 시간": "강의 2시간, 실험 2시간",
                            "학점": "3학점",
                            "내용": "PHY2007 전자물리학I에서 학습한 트랜지스터 증폭 원리를 토대로 Operational 증폭기의 특성과 다양한 응용, NOT, OR, AND 논리 소자의 특성, 논리 회로의 설계, Analog/Digital 및 Digital/Analog 변환 원리를 강의와 실험을 통하여 다룬다."
                        },
                        {
                            "과목 코드": "PHY2009",
                            "과목명": "현대물리학",
                            "강의 시간": "3시간",
                            "학점": "3학점",
                            "내용": "특수상대성 이론, 도플러 효과, 질량과 결합에너지, 전하, 빛, 에너지의 양자화, 원자의 세계, 원자핵의 세계, 입자와 파동의 이중성, 슈뢰딩거 방정식, 고유값과 고유함수, 각운동량, 수소원자, 지만 효과, 분자의 에너지 준위와 스펙트럼 등을 다룬다."
                        },
                        {
                            "과목 코드": "PHY2101",
                            "과목명": "실험물리학Ⅰ",
                            "실험 시간": "4시간",
                            "학점": "2학점",
                            "내용": "전류, 전압, 저항의 측정을 통해 Ohm의 법칙을 이해하고, Cathode Ray Tube의 구성과 원리를 전자장내의 전자의 운동을 관찰하여 전자기학의 기본원리와 Oscilloscope 사용법을 학습한 후 전기적 감쇄진동, 공진과 함께 diode의 특성을 직접 측정한다."
                        },
                        {
                            "과목 코드": "PHY2102",
                            "과목명": "실험물리학Ⅱ",
                            "강의 시간": "실험 4시간",
                            "학점": "2학점",
                            "내용": "저항, 축전기, 코일로 구성된 교류 회로를 구성하고 전압과 전류를 측정하여 교류회로의 특성을 이해한 후 파의 푸리에 분석, 다중 결합공진의 맥놀이와 분산효과를 실험하고, 트랜지스터의 증폭 특성을 측정하여 전류증폭 및 발진기를 제작한다.",
                            "비고": "병행과목: PHY2007"
                        },
                        {
                            "과목 코드": "PHY3001",
                            "과목명": "양자물리학Ⅰ",
                            "강의 시간": "3시간",
                            "학점": "3학점",
                            "내용": "흑체복사, 광전효과, 보어모델, 조화진동자, 컴프톤 산란, 프리에 변환, 파동다발, 슈뢰딩거 방정식, 기대값, 불확정성 원리, 중첩의 원리, 파동다발의 운동, 계단 포텐셜, 우물 포텐셜, 직교성 WKB 근사, 연산자와 고유함수 등을 다룬다."
                        },
                        {
                            "과목 코드": "PHY3002",
                            "과목명": "양자물리학Ⅱ",
                            "강의 시간": "3시간",
                            "학점": "3학점",
                            "내용": "구대칭계의 슈뢰딩거 방정식, 조화함수, 각운동량, 수소원자, 평면파, 부분파, 그린함수, 보른근사, 행렬역학, 힐버트 공간, 스핀, 지만 효과, 선택률, 시간에 무관한 섭동이론, 시간에 의존하는 섭동이론, 동등입자, 헬륨원자 등을 다룬다.",
                            "비고": "선수과목: PHY3001"
                        },
                        {
                            "과목 코드": "PHY3003",
                            "과목명": "열역학",
                            "강의 시간": "3시간",
                            "학점": "3학점",
                            "내용": "온도, 비열, 열팽창 및 열전도, 이상 기체, 반데르발스 기체, 상태 방정식, 열역학 제1법칙과 제2법칙, 엔트로피, 카르노 싸이클, 열역학 함수, 맥스웰 관계식 및 상전이, 속도 분포, 에너지 등분배 원리 등의 열역학적 문제들과 함께 보스－아인슈타인, 페르미-디락 및 맥스웰-볼츠만 분포 등과 분배함수, 엔트로피의 통계역학적 정의 및 계산 등과 같은 통계 물리학의 입문을 배운다."
                        },
                        {
                            "과목 코드": "PHY3004",
                            "과목명": "통계물리학",
                            "강의 시간": "3시간",
                            "학점": "3학점",
                            "내용": "열적 평형, 열역학 함수, 확률론, 분배 함수, 미시이론과 거시이론, 캐노니칼 분포 및 평균치 계산, 질점계의 고전통계 및 양자통계, 이상기체 운동론, 양자 통계의 응용 등을 다룬다.",
                            "비고": "선수과목: PHY3003"
                        },
                        {
                            "과목 코드": "PHY3101",
                            "과목명": "실험물리학Ⅲ",
                            "강의 시간": "실험 4시간",
                            "학점": "2학점",
                            "내용": "비틀림 진동자, magnetic torque, 전자의 전하량과 질량의 비(e/m)측정, 광전효과에서 Plank 상수측정, 편광과 굴절, 이중 슬릿 실험 등의 역학, 전자기학과 광학에 대한 실험 및 양자 역학의 기본 개념을 다루는 실험을 한다.",
                            "비고": "선수과목: PHY2101, 2102"
                        },
                        {
                            "과목 코드": "PHY3102",
                            "과목명": "실험물리학Ⅳ",
                            "강의 시간": "실험 4시간",
                            "학점": "2학점",
                            "내용": "양자 역학의 개념을 실험화하여 구현해 보고, 각종 간섭계를 이용한 광학 실험, Faraday Rotation, Blackbody radiation, spectroscopy 등 고급 물리학에서 다루는 내용과 물리학 연구에 기본이 될 수 있는 실험을 한다."
                        },
                        {
                            "과목 코드": "PHY3501",
                            "과목명": "물리 캡스톤 디자인Ⅰ",
                            "학점": "3학점",
                            "내용": "물리학과 학생들이 실제 물리학적 고급실험 및 산업적 응용에 필요한 기초 및 응용문제를 직접 해결할 수 있는 능력을 갖도록 학부과정 동안 배운 이론을 바탕으로 프로젝트를 기획, 설계, 제작하는 전 과정을 수행한다. 이 교과목에서 경험을 통하여 산업현장에 필요한 신기술을 창출할 수 있는 적합한 창의적 기술을 개발하며 종합설계 교육 프로그램으로 창의적 프로젝트를 수행한다. 수행한 프로젝트는 학과 및 학외 경진대회에 출품하여 경쟁에 출품 및 참여한다."
                        },
                        {
                            "과목 코드": "PHY3502",
                            "과목명": "물리 캡스톤 디자인Ⅱ",
                            "학점": "3학점",
                            "내용": "이론적으로 습득한 물리학적 지식을 종합 프로젝트를 통해 구체적인 목표를 설정하여 결과물을 구현한다. 프로젝트를 수립하는 개념, 관리 기법을 습득하고 소그룹으로 구성된 팀을 통해 개발하고자 하는 목표를 설정하고 S/W, 모델설정, 분석, 구현, 테스트 및 실용화 방안에 대해 실습 및 강의를 통해 구현한다."
                        },
                        {
                            "과목 코드": "PHY3510",
                            "과목명": "물리 현장실습",
                            "학점": "3학점",
                            "내용": "물리 분야에서 현장 적응력과 창의력을 지닌 인재를 양성하기 위하여 기업과 공동으로 운영하며 정해진 기간동안 국내의 산업현장에서 실습교육을 실시하여 현장경험 및 실무능력을 배운다."
                        },
                        {
                            "과목 코드": "PHY3515",
                            "과목명": "전공진로설계Ⅰ",
                            "강의 시간": "0시간",
                            "학점": "0학점",
                            "내용": "학생들은 본 교과를 통해 지도교수로부터 전공 진로 관련 상담을 받을 수 있으며, 해당 전공 출신 선배의 진학/취업/진로 등 사례를 통해 자기 주도적 계획을 설계할 수 있다."
                        },
                        {
                            "과목 코드": "PHY4001",
                            "과목명": "고체물리학Ⅰ",
                            "강의 시간": "3시간",
                            "학점": "3학점",
                            "내용": "고체, 액체, 기체 및 비정질 상의 안정성, 단결정에 있어서의 점군, Bravais 격자, 역격자 및 X선, 전자, 중성자 산란에 의한 구조의 결정 등과 이온 및 공유결합, 격자파동, 포논, Brillouin 및 라만 산란, 주기조건, 상태밀도, Debye 및 Einstein 모델, 고체의 비열, 열팽창, 열전도도, 에너지 띠이론, Hall 효과, 싸이클로트론 공명 등을 다룬다."
                        },
                        {
                            "과목 코드": "PHY4002",
                            "과목명": "고체물리학Ⅱ",
                            "강의 시간": "3시간",
                            "학점": "3학점",
                            "선수과목": "PHY4001",
                            "내용": "반도체의 에너지 띠와 갭, 페르미 에너지, 전자 및 hole 농도, 주개 및 받개, 이동도, Hall 효과, Gunn 효과, p-n 접합, 다이오드 반도체 레이저 등과 유전체의 쌍극자, 이온 및 전자 편극률, 압전현상, 강유전 특성, 자성체의 Langevin 반자성, 강자성, 자기구역, 핵자기 공명, 스핀파, 초전도체의 전기저항, Meissner 효과, 임계자기장, London 이론, BCS 이론, 죠셉슨 효과 등을 다룬다."
                        },
                        {
                            "과목 코드": "PHY4003",
                            "과목명": "현대광학Ⅰ",
                            "강의 시간": "3시간",
                            "학점": "3학점",
                            "내용": "빛의 전달, 전자기파로서의 빛, Poynting 벡터, Jones 행렬, 가간섭성 전자기파의 성질, 선폭, 파브리－페로 간섭계, 다층박막에서의 빛의 전달, 회절, Fraunhofer와 Fresnel 회절을 다룬다."
                        },
                        {
                            "과목 코드": "PHY4004",
                            "과목명": "현대광학Ⅱ",
                            "강의 시간": "3시간",
                            "학점": "3학점",
                            "내용": "고체 내에서의 빛의 전달, 등방형 유전체, Faraday 회전, 흑체 복사, 빛의 양자성, 광자의 운동량과 에너지, 광압, 유도방출과 자발적인 천이, 광공진기 이론, 레이저 이론, 색소 레이저, 가스 레이저, 링 레이저, 비선형 광학 등을 다룬다."
                        },
                        {
                            "과목 코드": "PHY4005",
                            "과목명": "기초입자이론Ⅰ",
                            "강의 시간": "3시간",
                            "학점": "3학점",
                            "내용": "현대물리학의 내용을 토대로 핵물리 및 소립자에 관한 내용을 다룬다. 핵의 구조 및 핵 모형, 핵의 붕괴 및 방사선, 핵분열 및 핵융합, 경입자 및 강입자, 기본 힘과 매개입자 등을 다룬다."
                        },
                        {
                            "과목 코드": "PHY4006",
                            "과목명": "기초입자이론Ⅱ",
                            "강의 시간": "3시간",
                            "학점": "3학점",
                            "선수과목": "PHY4005",
                            "내용": "소립자 이론에 필요한 라그란지안, 게이지 대칭성, 디락 방정식을 다루며, 전자기힘, 약력 및 강력을 아우르는 표준 모델과 새로운 입자이론 및 최근 실시되고 있는 입자 실험을 소개한다."
                        },
                        {
                            "과목 코드": "PHY4007",
                            "과목명": "전산물리학Ⅰ",
                            "강의 시간": "강의 2시간, 실험 2시간",
                            "학점": "3학점",
                            "내용": "Runge-Kutta 방법 등의 수치해석에 관한 얼개를 배우고, 이것을 개인용 컴퓨터 및 대형 컴퓨터에서 구현하여 물리 문제를 수치계산으로 해결하는 방법과 이때 필요한 프로그램 기법에 대하여 배운다."
                        },
                        {
                            "과목 코드": "PHY4008",
                            "과목명": "전산물리학Ⅱ",
                            "강의 시간": "강의 2시간, 실험 2시간",
                            "학점": "3학점",
                            "내용": "디지털 회로와 고급 수준 언어, 기호 연산언어, 인공 지능 언어인 Lisp 등을 배우고, 이것을 인터페이스에 응용하여 외부 실험기계의 컴퓨터 실시간 제어에 관한 기법을 배운다."
                        },
                        {
                            "과목 코드": "PHY4009",
                            "과목명": "반도체물리학",
                            "강의 시간": "3시간",
                            "학점": "3학점",
                            "내용": "반도체의 에너지 띠 이론, 전하 운반자에 대한 통계, 생성 및 재결합 과정, 운반자 운송 등에 대한 중요한 기본 개념을 다루고, 전자 및 광전자 소자응용에 대해 배운다."
                        },
                        {
                            "과목 코드": "PHY4010",
                            "과목명": "일반상대성이론",
                            "강의 시간": "3시간",
                            "학점": "3학점",
                            "내용": "아인슈타인의 특수 상대성이론과 일반상대성이론을 다루고 이를 바탕으로 천체 운동과 현대 우주론을 소개한다. (구 천체물리학I)"
                        },
                        {
                            "과목 코드": "PHY4011",
                            "과목명": "천체물리학",
                            "강의 시간": "3시간",
                            "학점": "3학점",
                            "내용": "일반상대성이론을 바탕으로 은하와 우주에 대해 다룬다. FRW 우주론, 빅뱅이론, 우주의 팽창과정, 입자물리학과의 연관성 등을 소개한다. (구 천체물리학II)"
                        },
                        {
                            "과목 코드": "PHY4012",
                            "과목명": "나노물리",
                            "강의 시간": "3시간",
                            "학점": "3학점",
                            "내용": "나노구조 디바이스 제조 및 공정, 분석방법, 광학적 특성에 대한 기초 및 현재 학문의 발전 동향을 다룬다."
                        },
                        {
                            "과목 코드": "PHY4013",
                            "과목명": "바이오물리",
                            "강의 시간": "3시간",
                            "학점": "3학점",
                            "내용": "생물학의 기본내용, 열 및 통계, 반응속도론, 형광 분광학, 질량분석법, 전기영동법, AFM, FRET, FCS 등의 단분자 현광 분광학 등을 다룬다."
                        },
                        {
                            "과목 코드": "PHY4015",
                            "과목명": "의학물리",
                            "강의 시간": "3시간",
                            "학점": "3학점",
                            "내용": "뉴튼의 운동법칙, 파동, 열 현상, 생체전기 현상, 기하광학, 시각, 방사능을 중심으로 한 핵물리학 등을 다룬다."
                        },
                        {
                            "과목 코드": "PHY4016",
                            "과목명": "디스플레이물리",
                            "강의 시간": "3시간",
                            "학점": "3학점",
                            "내용": "브라운관, 플라즈마 디스플레이 PDP, Electroluminescences/VFD/LED/LCD, 유기물 transistor 작동 원리/OLED, 디스플레이와 인간 공학 등을 다룬다."
                        },
                        {
                            "과목 코드": "PHY4017",
                            "과목명": "원자물리학",
                            "강의 시간": "3시간",
                            "학점": "3학점",
                            "내용": "원자 질량, 주기율표, 볼츠만 분배 법칙, 전하, 동위원소, 입자성과 파동성, 흑체복사, 광전효과, 러더포드의 산란실험, 보어 모델, 컴프톤 산란, 불확정성 원리, 슈뢰딩거방정식, 수소 원자의 구조, 헬률의 구조, 분광학, 분자의 구조, 반도체, 고전통계, 양자통계, 고체의 띠 이론을 다룬다."
                        },
                        {
                            "과목 코드": "PHY4019",
                            "과목명": "분광학",
                            "강의 시간": "강의 2시간, 실험 2시간",
                            "학점": "3학점",
                            "내용": "수소 원자 구조, 스핀, 파울리 원칙, Shell의 구조, Zeeman과 Stark효과, 혹체 복사, 흡수분광, 자외선-적외선 감지기, Doppler, Collision, Radiative Broadenings의 선택 법칙, 회전, 진동, 전기작용에 의한 분자 분광학을 다룬다."
                        },
                        {
                            "과목 코드": "PHY4101",
                            "과목명": "고급물리학 실험",
                            "강의 시간": "실험 4시간",
                            "학점": 2,
                            "내용": "물리학의 여러 분야에 관한 고급 실험을 한다."
                        },
                        {
                            "과목 코드": "PHY4201",
                            "과목명": "특수연구",
                            "학점": 3,
                            "내용": "졸업반 학생의 선택과목으로서 지도교수의 지도에 따라 개별적으로 특수실험 또는 특수연구를 수행한다."
                        },
                        {
                            "과목 코드": "PHY4202",
                            "과목명": "물리학 특강",
                            "강의 시간": "3시간",
                            "학점": 3,
                            "내용": "최신 연구 분야 및 다양한 주제를 소개한다."
                        },
                        {
                            "과목 코드": "PHY4203",
                            "과목명": "물리 특허와 기술이전",
                            "강의 시간": "3시간",
                            "학점": 1,
                            "내용": "물리학의 유용한 연구결과를 지적재산권화하기 위해 필요한 과정과 관련 내용을 다룬다. 이를 위해 지적재산권에 대한 중요성과 그 형성과정 및 기술이전에 관한 내용을 현행 제도와 실례를 통하여 배운다.",
                            "비고": "(생명 BIO4203, 화학 CHM4203) 과목과 중복수강 할 수 없다."
                        },
                        {
                            "과목 코드": "PHY4204",
                            "과목명": "졸업 프로젝트",
                            "학점": 3,
                            "내용": "졸업반 학생의 선택과목으로서, 물리학 전공교육과정을 바탕으로, 지도교수의 지도에 따라 학생이 설계한 연구프로젝트를 수행하고 그 결과를 발표한다."
                        },
                        {
                            "과목 코드": "PHYG001",
                            "과목명": "고전물리Ⅰ",
                            "강의 시간": "3시간",
                            "학점": 3,
                            "내용": "라그란즈 방정식, 고유치, 적분 방정식, 해밀턴 운동방정식, 카노니칼 변환, 하밀턴야코비 이론을 다룬다. 정전기학의 경계치 문제를 다룬다."
                        },
                        {
                            "과목 코드": "PHYG003",
                            "과목명": "통계역학",
                            "강의 시간": "3시간",
                            "학점": 3,
                            "내용": "앙상블 이론, 미시 카노닐칼 앙상블, 큰 카노니칼 앙상블, 양자통계, 디바이의 비열이론, 비이상 기체, 강자성체 이론, 상전이 및 임계현상을 다룬다."
                        },
                        {
                            "과목 코드": "PHYG004",
                            "과목명": "기계학습응용",
                            "강의 시간": "3시간",
                            "학점": 3,
                            "내용": "회귀, 분류, 군집화, 인공신경망 등 기초적인 기계학습 방법론을 학습하고, 이를 활용한 물리학 문제 사례들을 소개한다. 실습을 통해 pytorch, keras, jax 등의 기계학습 프로그래밍 프레임워크의 사용법을 익히고, 이를 대용량 실험 데이터 처리, 상전이 인식, 분자동역학 시뮬레이션 등 물리적으로 의미 있는 문제에 적용한다."
                        },
                        {
                            "과목 코드": "PHYG005",
                            "과목명": "인공지능과 물리",
                            "강의 시간": "3시간",
                            "학점": 3,
                            "내용": "인공지능의 다양한 응용 중 물리학과의 관련성에 초점을 두고 신경망 그리고 딥러닝에 대한 기본적인 개념과 알고리즘을 다룬다. 실습을 통해 pytorch, keras, 또는 jax를 이용한 단일/다층 신경망, 복합 신경망, 순환 신경망 구현을 다룬다. 통계역학의 개념을 이용하여 비지도 학습의 한 예인 restricted Boltzmann Machine을 구현한다. 위의 결과를 상전이 현상, 텐서 파동함수 등의 다양한 물리 문제에 적용한다."
                        },
                        {
                            "과목 코드": "PHYG006",
                            "과목명": "양자장이론Ⅰ",
                            "강의 시간": "3시간",
                            "학점": 3,
                            "내용": "스핀이 0, 1/2, 1인 입자들을 기술하는 상대론적 양자장의 기본성질을 표준 및 경로적분의 관점에서 논의한다. 먼저 자유입자들을 다루고, 이후 상호작용하는 입자들에 대해 논의하는 과정에서 섭동이론과 파인만 다이어그램을 공부한다. 추가로 양자전기역학, 게이지이론, 재규격화 등의 주요 개념들을 간략하게 소개한다."
                        }
                    ],
                    "교직과목": [
                        {
                        "과목 코드": "EDUS981",
                        "과목명": "과학교과 교육론",
                        "강의 시간": "3시간",
                        "학점": 3,
                        "내용": "물리학교과 교육의 목적, 내용, 방법, 평가 등에 대한 다양한 이론과 관점을 고찰하며, 중·고등학교 물리학 교육과정을 구체적으로 분석한다."
                        },
                        {
                        "과목 코드": "EDUS982",
                        "과목명": "과학교과 논리 및 논술",
                        "강의 시간": "3시간",
                        "학점": 3,
                        "내용": "물리학교과의 구조와 특성에 대한 전반적인 이해를 토대로 물리학 혹은 과학의 내용과 원리를 소재로 한 사고력의 함양과 논술지도 능력을 기른다."
                        },
                        {
                        "과목 코드": "EDUS983",
                        "과목명": "과학교과 교재연구 및 지도법",
                        "강의 시간": "3시간",
                        "학점": 3,
                        "내용": "중·고등학교 물리학교과 교육과정 및 교과서 등에 대한 체계적 분석과 물리학 교수 방법의 이론과 실제에 대한 이해를 통해 물리학교과를 효과적으로 가르칠 수 있는 실천적 자질을 함양한다."
                        },
                        {"비고": "※교직이수자만 전공학점으로 인정됨."}
                    ]
                }   
            },
            "화학과": {
                "과목 정보": {
                    "전공 과목 정보": [
                        {
                            "과목 코드": "CHM1001",
                            "과목명": "일반화학 Ⅰ",
                            "학점": 3,
                            "내용": "현대 화학의 기본적인 개념에 필요한 근본원리들을 이해한다. 기본적인 화학 계산법, 수용액에서의 화학, 기체의 성질, 열화학, 원자구조, 전자 배치와 주기율표, 화학결합, 결합이론과 분자구조, 분자간 인력 등을 배운다."
                        },
                        {
                            "과목 코드": "CHM1002",
                            "과목명": "일반화학 Ⅱ",
                            "학점": 3,
                            "내용": "일반화학 I의 계속이며, 용액의 성질, 반응속도론, 화학평형, 산－염기 평형, 착물형성과 관련된 평형, 열역학(자발성, 엔트로피, 자유에너지 등에 대한 개념), 전기화학, 핵화학, s－블록 원소들, p－블록 원소들, d－블록 원소들, 생명현상과 화학(유기화학과 생화학 그리고 의약화학에 대한 개념의 소개), 소재화학, 환경과 화학 등이 소개된다."
                        },
                        {
                            "과목 코드": "CHM1051",
                            "과목명": "일반화학실험 Ⅰ",
                            "학점": 1,
                            "내용": "CHM1001에서 다루어지는 교과 내용을 실험을 통해 직접 관찰하며 실험실에서의 안전수칙을 습득하고 기본적인 화학 실험기구를 다루는 법을 터득한 뒤 질량과 부피 측정, 화합물의 물리적 성질과 확인, 아보가드로 수 결정과 분자 길이 추정, 기체상수의 결정, 엔탈피의 측정, 불꽃실험과 전자전이 스펙트럼의 관찰, 비누화 반응, 아스피린의 합성, 카페인의 추출과 분리 등을 다룬다."
                        },
                        {
                            "과목 코드": "CHM1052",
                            "과목명": "일반화학실험 Ⅱ",
                            "학점": 1,
                            "내용": "CHM1051의 계속이며, CHM1002에서 다루어지는 내용을 직접 실험을 통해 관찰하는 데 목적이 있다. 산화환원 적정 및 표백제의 정량, 시계반응을 이용한 화학반응속도의 측정, 화학 평형과 평형상수의 결정, pH의 측정과 이온화 상수의 결정, 화학전지와 전기화학적 서열, 전기분해와 도금, 양이온 정성 분석, 나일론의 합성, 착염의 성질과 제법, 니켈팔면체 착물과 사가평면 착물의 형성 등을 다룬다."
                        },
                        {
                            "과목 코드": "CHM2101",
                            "과목명": "분석화학",
                            "학점": 3,
                            "내용": "정량분석화학의 기본 원리를 이해하고 습득함을 목표로 한다. 오차론과 통계, 무게분석법, 부피분석법과 화학평형의 기본을 익힌다. 산 / 염기 평형, 착물형성 평형, 산화 / 환원 평형, 분광광도법에 대해 각각 상세히 익힌 후, 이를 이용한 분석방법과 응용을 다룬다."
                        },
                        {
                            "과목 코드": "CHM2102",
                            "과목명": "기기분석",
                            "학점": 3,
                            "내용": "기기를 이용한 화학적 측정법의 원리와 응용을 취급한다. 흡수분광 광도법, 발광분광 분석법, 형광 분석법, X－선 분석법, 질량 분석법 등의 분광학적 방법의 원리, 기기장치, 응용에 관해 자세히 다룬다. 기체 및 액체 크로마토그라피법에 대한 기본적인 원리와 응용에 관하여도 다룬다. 미세유체소자 및 모세관 전기영동법, 첨단 바이오센서에 관한 원리와 응용법을 포함한다."
                        },
                        {
                            "과목 코드": "CHM2151",
                            "과목명": "분석화학실험",
                            "학점": 2,
                            "내용": "측정용기의 보정, 표준물의 제조 및 정량, 무게분석, 산-염기 적정, EDTA 적정, 산화－환원 적정, 분광광도법에 의한 분석 등의 실험을 한다."
                        },
                        {
                            "과목 코드": "CHM2152",
                            "과목명": "첨단화학기기분석실험",
                            "학점": "2학점",
                            "내용": "화학기기 장치에 유용한 간단한 전자회로 및 Data Acquistion에 관한 실험, 흡수 분광광도법 등 여러 분광학적 방법에 의한 분석, 순환 전위전압법 등의 전기화학적인 실험, 그리고 기체 및 액체 크로마토그라피법 미세유체소자를 이용한 분석실험 등을 한다."
                        },
                        {
                            "과목 코드": "CHM2201",
                            "과목명": "물리화학 Ⅰ",
                            "학점": "3학점",
                            "내용": "기체의 성질, 열역학 제 1, 2, 3법칙, 상태변화, 화학 평형, 평형 전기화학 등을 다룬다."
                        },
                        {
                            "과목 코드": "CHM2202",
                            "과목명": "물리화학 Ⅱ",
                            "학점": "3학점",
                            "내용": "양자화학의 원리와 응용, 원자 구조와 원자 스펙트럼, 분자 구조, 분자 대칭과 군론, 분자 분광법, 자기 공명 등을 다룬다."
                        },
                        {
                            "과목 코드": "CHM2203",
                            "과목명": "물리화학 Ⅲ",
                            "학점": "3학점",
                            "내용": "기체운동론, 운반과정, 화학 반응 속도론, 반응동력학, 표면 현상, 동적 전기화학 등을 다룬다."
                        },
                        {
                            "과목 코드": "CHM2231",
                            "과목명": "물리화학 특론",
                            "학점": "3학점",
                            "내용": "통계 열역학의 개념과 응용, X－선 회절법, 분자의 전기적 및 자기적 성질, 고분자의 구조와 성질 등을 다룬다."
                        },
                        {
                            "과목 코드": "CHM2251",
                            "과목명": "물리화학 실험 Ⅰ",
                            "학점": "2학점",
                            "내용": "화학 열역학, 화학 평형, 전해질의 전기 전도성, 표면 및 계면 현상, 상평형, 전지의 열역학 등에 관한 실험을 한다."
                        },
                        {
                            "과목 코드": "CHM2252",
                            "과목명": "물리화학 실험 Ⅱ",
                            "학점": "2학점",
                            "내용": "자기공명과 UV 및 IR 분광법을 이용한 물질의 성질 규명, 표면 화학, 고분자 화합물의 물리화학적 성질 등에 관한 실험을 한다."
                        },
                        {
                            "과목 코드": "CHM2301",
                            "과목명": "유기화학 Ⅰ",
                            "학점": "3학점",
                            "내용": "유기화합물의 구조와 결합, 알칸 및 사이클로알칸의 명명법 및 형태이성질체, 알켄과 알킨의 구조, 반응성 및 합성, 입체화학, 알킬 할라이드의 반응 및 합성, 친핵체 치환반응 및 제거 반응, 구조결정(질량분석, 적외선분광기, 핵자기공명분광기), 컨쥬게이트 다이엔 및 자외선분광기 등에 대하여 다룬다."
                        },
                        {
                            "과목 코드": "CHM2302",
                            "과목명": "유기화학 Ⅱ",
                            "학점": "3학점",
                            "내용": "방향족 화합물의 개념과 친전자체 방향족 치환반응, 알코올 및 페놀, 에테르와 에폭사이드, 알데히드와 케톤, 카복실산, 카복실산 유도체 및 친핵체 아실 치환반응, 카보닐 알파－치환반응, 카보닐 축합반응, 그리고 아민 등을 소개한다."
                        },
                        {
                            "과목 코드": "CHM2303",
                            "과목명": "유기화학 Ⅲ",
                            "학점": "3학점",
                            "내용": "중요한 생체내 고분자인 탄수화물, 질소를 포함하는 아미노산, 펩티드 및 단백질, 지방성분인 리피드, 헤테로고리 화합물 및 핵산, 유기화학적 관점에서의 생체내 대사과정, 오비탈 및 화학반응, 합성폴리머 등을 다룬다."
                        },
                        {
                            "과목 코드": "CHM2331",
                            "과목명": "유기화학특론 Ⅰ",
                            "학점": "3학점",
                            "선수과목": "CHM2302",
                            "내용": "엔올산염이나 엔아민과 같은 화합물의 여러 친핵성 반응, 유기 작용기의 상호변환, 탄소－탄소 다중결합에 대한 첨가반응, 고리형 협동반응, 유기금속 화합물과 전자부족 유기 중간체의 반응 등에서 특정 부분을 심도 있게 다룬다."
                        },
                        {
                            "과목 코드": "CHM2332",
                            "과목명": "유기화학특론 Ⅱ",
                            "학점": "3학점",
                            "선수과목": "CHM2302",
                            "내용": "유기화합물의 구조와 반응성 사이의 관계를 이해하기 위하여 유기화합물의 열역학적, 양자역학적 구조 해석, 반응중간체 및 전이상태의 구조, 반응성, 반응 메카니즘, 반응속도론 등 물리유기화학적 부분을 심도 있게 다룬다."
                        },
                        {
                            "과목 코드": "CHM2351",
                            "과목명": "유기화학실험 Ⅰ",
                            "학점": "2학점",
                            "내용": "유기화학의 실험에 필요한 여러 가지 분리기술(증류, 분별증류, 수증기 증류, 추출, 크로마토그라피법, 재결정, 광학 분할 등)을 실습하며, 화학발광현상, 용해도 및 분류시험, 유기 정성분석실험과 그리고 간단한 유기화학 반응을 실험한다."
                        },
                        {
                            "과목 코드": "CHM2352",
                            "과목명": "유기화학실험 Ⅱ",
                            "학점": "2학점",
                            "선수과목": "CHM2351",
                            "내용": "유기화학의 실험에 필요한 여러 가지 합성기술 및 다단계 반응을 실습하여 장차 유기화학 반응을 설계 및 수행하는 능력을 키운다."
                        },
                        {
                            "과목 코드": "CHM2401",
                            "과목명": "무기화학 Ⅰ",
                            "학점": "3학점",
                            "내용": "원자구조, 군론, 무기화합물에서 화학결합, 무기화합물의 분자구조 및 반응성, 무기고체 화합물의 구조 그리고 물리적 및 화학적 성질, 산－염기(수용액 및 비수용액) 및 산화－환원 등에 관한 것을 전반적으로 소개하고, 구체적으로 금속 및 비금속 원소들에 대한 성질 및 반응성을 다룬다. 전이금속－배위화합물에 관한 결합, 스펙트럼, 자기적 성질, 분자구조 및 반응성 일부를 소개한다."
                        },
                        {
                            "과목 코드": "CHM2402",
                            "과목명": "무기화학 Ⅱ",
                            "학점": "3학점",
                            "내용": "전이금속-배위화합물의 반응성, 반응속도론 및 반응메카니즘을 소개한다. 다양한 유기금속 화합물을 소개하고, 유기금속 화합물의 반응성, 유기금속 화합물에 의한 균일 촉매반응 등을 다룬다. 여러 종류의 고리, 사슬, 바구니, 뭉치화합물, 할로겐 및 18족 원소 화합물에 관한 화학 그리고 생물무기화학을 소개한다."
                        },
                        {
                            "과목 코드": "CHM2451",
                            "과목명": "무기화학실험",
                            "학점": "2학점",
                            "내용": "무기화합물(배위화합물, 유기금속화합물, 고체화합물)의 합성-분리 및 물리적 성질조사를 통한 확인, 무기화합물의 반응 메카니즘 조사를 위한 반응속도 측정, X－선 회절 측정, 적외선 스펙트럼, 전자흡수 스펙트럼, 핵자기공명 스펙트럼, 용액의 전기전도도 측정, 크로마토그라피법을 이용한 분리법, 산소 및 습기에 민감한 화합물의 취급방법 등을 익힌다."
                        },
                        {
                            "과목 코드": "CHM2501",
                            "과목명": "고분자 화학",
                            "학점": "3학점",
                            "선수과목": "CHM2202",
                            "내용": "고분자의 합성 및 합성 메카니즘, 고분자의 화학적 성질, 고분자 용액 물성 및 고체물성과 같은 물리적 성질, 구조 / 물성의 상호관계, 고분자 재료과학, 특수 기능성 고분자 등에 대하여 공부한다."
                        },
                        {
                            "과목 코드": "CHM2601",
                            "과목명": "생화학 Ⅰ",
                            "강의 시간": "3시간",
                            "학점": "3학점",
                            "선수과목": "CHM2302",
                            "내용": "생체물질, 생체 에너지 및 대사, 인체 생화학 및 유전정보의 분자단위에서의 전달을 다룬다. 이 과정에서 여러 생체분자, 물, 펩티드와 단백질, 탄수화물, 지방 및 효소의 구조, 기능, 역할, 생화학적 변화를 취급한다."
                        },
                        {
                            "과목 코드": "CHM2602",
                            "과목명": "생화학 Ⅱ",
                            "강의 시간": "3시간",
                            "학점": "3학점",
                            "선수과목": "CHM2601",
                            "내용": "생체분자를 분해하는 과정을 통하여 에너지를 생산하고 저장하는 것과 필요한 생체분자를 합성하는 과정을 다룬다. 또한 DNA의 유전정보로부터 RNA를 거쳐서 단백질을 합성하는 과정과 이를 조절하는 과정을 화학적인 관점에서 배운다."
                        },
                        {
                            "과목 코드": "CHM2651",
                            "과목명": "생화학실험",
                            "실험 시간": "4시간",
                            "학점": "2학점",
                            "내용": "생화학 Ⅰ, Ⅱ를 통하여 배운 단백질 정제, DNA 전기영동, PCR 등의 생화학적 방법들을 실험하여 생화학 실험의 기초를 배운다."
                        },
                        {
                            "과목 코드": "CHM3100",
                            "과목명": "전공진로설계Ⅰ",
                            "강의 시간": "0시간",
                            "학점": "0학점",
                            "내용": "학생들은 본 교과를 통해 지도교수로부터 전공 진로 관련 상담을 받을 수 있으며, 해당 전공 출신 선배의 진학/취업/진로 등 사례를 통해 자기 주도적 계획을 설계할 수 있다."
                        },
                        {
                            "과목 코드": "CHM4051",
                            "과목명": "연구프로젝트 Ⅰ",
                            "실습 시간": "6시간",
                            "학점": "3학점",
                            "내용": "3, 4학년을 대상으로 한 일반선택과목으로 지도교수의 지도아래 첨단 화학 분야의 연구 프로젝트를 수행한다."
                        },
                        {
                            "과목 코드": "CHM4052",
                            "과목명": "창의적 연구 프로젝트 설계",
                            "실습 시간": "6시간",
                            "학점": "3학점",
                            "내용": "3, 4학년을 대상으로 한 일반선택과목으로 지도교수의 지도아래 첨단 화학 분야의 연구 프로젝트를 수행한다."
                        },
                        {
                            "과목 코드": "CHM4053",
                            "과목명": "화학 인공지능 기초",
                            "강의 시간": "2시간",
                            "실험 시간": "2시간",
                            "학점": "3학점",
                            "내용": "화학과 인공지능 원리 학습에 필요한 수학을 습득한 후 인공지능의 기본 원리와 활용 기초를 다룬다. 화학 및 화학 관련 산업에 활용되는 인공지능 사례를 익힌다."
                        },
                        {
                            "과목 코드": "CHM4054",
                            "과목명": "화학기기 종합설계",
                            "강의 시간": "1시간",
                            "실험실습 시간": "2시간",
                            "설계 시간": "1시간",
                            "학점": "3학점",
                            "내용": "화학을 전공하는 학생들이 새로운 화학관련 현장에서 요구하는 새로운 계측기기를 직접 설계하고, 이 계측기기를 활용한 화학실험을 구현해 보는 설계과목이다. 분석화학 및 기기분석과목에서 배운 지식과 이론을 바탕으로 새로운 화학기기를 기획, 실습한다."
                        },
                        {
                            "과목 코드": "CHM4055",
                            "과목명": "첨단화학캡스톤디자인",
                            "강의 시간": "3시간",
                            "학점": "3학점",
                            "내용": "산업체나 연구소의 전문가를 초빙하여 실제 최첨단 현장의 업무내용을 제공하며, 내용이 어려운 부분에 대해서는 지도교수가 보완설명을 하여 이해도를 높이는 방식으로 진행한다."
                        },
                        {
                            "과목 코드": "CHM4056",
                            "과목명": "화학 현장실습1",
                            "강의 시간": "3시간",
                            "학점": "3학점",
                            "내용": "학교에서 배운 화학 이론을 바탕으로 화학분야의 산업체와 연계해 실질적으로 적용해보고 경험하는 현장실습을 수행한다."
                        },
                        {
                            "과목 코드": "CHM4057",
                            "과목명": "화학 현장실습2",
                            "강의 시간": "3시간",
                            "학점": "3학점",
                            "내용": "학교에서 배운 화학 이론을 바탕으로 화학분야의 산업체와 연계해 실질적으로 적용해보고 경험하는 현장실습을 수행한다."
                        },
                        {
                            "과목 코드": "CHM4203",
                            "과목명": "화학 특허와 기술이전",
                            "강의 시간": "1시간",
                            "학점": "1학점",
                            "내용": "화학의 유용한 연구 결과를 지적재산권화 하기위해 필요한 과정과 관련내용을 다룬다. 이를 위해 지적재산권에 대한 중요성과 그 형성과정 및 기술이전에 관한 내용을 현행 제도와 실례를 통하여 배운다."
                        },
                        {
                            "과목 코드": "CHMG101",
                            "과목명": "고급분석화학",
                            "강의 시간": "3시간",
                            "학점": "3학점",
                            "내용": "분광분석, 전기화학분석, 분리분석의 기본 개념과 응용을 다루고 현대분석화학의 활발한 응용분야인 생물질 분석, 표면분석, 센서 등에 초점을 맞춘다."
                        },
                        {
                            "과목 코드": "CHMG201",
                            "과목명": "고급물리화학 Ⅰ",
                            "강의 시간": "3시간",
                            "학점": "3학점",
                            "내용": "양자화학, 통계역학, 원자 및 분자 분광학, 화학열역학, 반응속도, 물성 등에서 제목을 택하여 강의한다."
                        },
                        {
                            "과목 코드": "CHMG202",
                            "과목명": "고급물리화학 Ⅱ",
                            "강의 시간": "3시간",
                            "학점": "3학점",
                            "내용": "양자화학, 통계역학, 원자 및 분자 분광학, 화학열역학, 반응속도, 물성 등에서 제목을 택하여 강의한다."
                        },
                        {
                            "과목 코드": "CHMG301",
                            "과목명": "고급유기화학 Ⅰ",
                            "강의 시간": "3시간",
                            "학점": "3학점",
                            "선수과목": "CHM2302",
                            "내용": "유기화학Ⅰ－Ⅲ에서 취급된 교과내용을 바탕으로 화학결합의 형성 및 분자 궤도함수론 등 이론적인 개념들을 습득한다. 그리고 이러한 개념을 Aromaticity, Pericyclic 반응, Diels-Alder 반응, 이온 및 라디칼 반응, 그리고 Anomeric 효과 등에 적용하는 능력을 기른다."
                        },
                        {
                            "과목 코드": "CHMG302",
                            "과목명": "고급유기화학 Ⅱ",
                            "강의 시간": "3시간",
                            "학점": "3학점",
                            "선수과목": "CHM2302",
                            "내용": "유기화합물의 여러 중요한 분광학적 분석법[핵자기공명 분광법(1H 및 13C), 적외선 분광법, 자외선분광법, 질량분석법 등]을 이론과 연습을 통해 미지 화합물의 구조를 유추할 수 있도록 다룬다."
                        },
                        {
                            "과목 코드": "CHMG401",
                            "과목명": "고급무기화학",
                            "강의 시간": "3시간",
                            "학점": "3학점",
                            "내용": "기초 리간드장 이론, 원자가 결합 이론, 분자궤도함수 이론을 소개하고, 전이금속 착물의 구조 및 반응과 간단한 유기금속화합물을 다루며 생무기화학을 소개한다."
                        },
                        {
                            "과목 코드": "CHMG402",
                            "과목명": "무기재료화학",
                            "강의 시간": "3시간",
                            "학점": "3학점",
                            "내용": "나노소재, 양자점, 양자선, 반도체, 초전도체, 자성물질, 유전체, 태양전지 관련 무기소재, 연료전지 관련 무기소재, 디스플레이 관련 무기소재, 다공성물질들의 구조와 성질 그리고 응용을 다룬다."
                        },
                        {
                            "과목 코드": "CHMG501",
                            "과목명": "고급생화학Ⅰ",
                            "강의 시간": "3시간",
                            "학점": "3학점",
                            "내용": "생화학 I, II 에서 다루지 못한 탄수화물, 생합성, 대사과정 등을 다루고, 최근 생화학분야 주요 연구주제를 소개한다."
                        },
                        {
                            "과목 코드": "CHMG502",
                            "과목명": "고급생화학 Ⅱ",
                            "강의 시간": "3시간",
                            "학점": "3학점",
                            "내용": "생화학 I, II 에서 다루지 못한 탄수화물, 생합성, 대사과정 등을 다루고, 최근 생화학분야 주요 연구주제를 소개한다."
                        },
                        {
                            "과목 코드": "CHMG601",
                            "과목명": "자연과학논문작성 및 발표법",
                            "강의 시간": "3시간",
                            "학점": "3학점",
                            "내용": "독립적인 연구자로서 성장하는데 필요한 영문 논문 작성 능력 및 발표능력을 키우는데 중점을 둔다."
                        }
                    ],
                    "교직과목": [
                        {
                            "과목 코드": "EDUS981",
                            "과목명": "과학 교과교육론",
                            "강의 시간": "3시간",
                            "학점": "3학점",
                            "내용": "화학 교과교육의 목적, 내용, 방법, 평가 등에 대한 다양한 이론과 관점을 고찰하며, 중·고등학교 생명과학 교육과정의 실제를 구체적으로 분석한다."
                        },
                        {
                            "과목 코드": "EDUS982",
                            "과목명": "과학 교과논리 및 논술",
                            "강의 시간": "3시간",
                            "학점": "3학점",
                            "내용": "생명과학 교과의 구조와 특성에 대한 전반적인 이해를 토대로, 생명과학 혹은 과학의 내용과 원리를 소재로 사고력의 함양과 논술지도 능력을 기른다."
                        },
                        {
                            "과목 코드": "EDUS983",
                            "과목명": "과학 교과 교재연구 및 지도법",
                            "강의 시간": "3시간",
                            "학점": "3학점",
                            "내용": "중·고등학교 생명과학 교과 교육과정 및 교과서 등에 대한 체계적 분석과 생명과학 교수방법의 이론과 실제에 대한 이해를 통해, 생명과학 교과를 효과적으로 가르칠 수 있는 실천적 자질을 함양한다."
                        }
                    ]
                }
            },
            "생명과학과": {
                "과목 정보": {
                    "전공 과목 정보": [
                        {
                            "과목 코드": "BIO1101",
                            "과목명": "일반생물학 Ⅰ",
                            "강의시간": "3시간",
                            "학점": "3학점",
                            "내용": "생물의 기본적 구조, 기능, 유전, 생리, 발생, 진화, 생태에 대한 현상, 원리 및 개념 등의 제 문제를 다룬다."
                        },
                        {
                            "과목 코드": "BIO1102",
                            "과목명": "일반생물학 Ⅱ",
                            "강의시간": "3시간",
                            "학점": "3학점",
                            "내용": "BIO1101의 계속"
                        },
                        {
                            "과목 코드": "BIO1105",
                            "과목명": "일반생물학실험 Ⅰ",
                            "실험시간": "3시간",
                            "학점": "1학점",
                            "내용": "BIO1101의 내용을 실험을 통하여 배운다."
                        },
                        {
                            "과목 코드": "BIO1106",
                            "과목명": "일반생물학실험 Ⅱ",
                            "실험시간": "3시간",
                            "학점": "1학점",
                            "내용": "BIO1102의 내용을 실험을 통하여 배운다."
                        },
                        {
                            "과목 코드": "BIO2111",
                            "과목명": "첨단 생명과학 기술(탐구공동체)",
                            "강의시간": "1.5시간",
                            "학점": "1.5학점",
                            "내용": "최근 급속하게 생명과학이 발전되고 있으며 이에 따라 의료계 및 산업계까지 큰 파급 효과를 낳고 있다. 본 과목에서는 생명과학 분야의 최신 기술 동향과 발전 방향을 탐색한다. 특히 유전자 편집, 줄기세포, 인공지능, mRNA 치료제 등 다양한 첨단 기술들이 어떻게 생명과학 연구에 활용되고 있는지, 그리고 미래에는 어떤 새로운 가능성을 열어줄지를 탐구하며 또한, 첨단 생명과학 기술의 윤리적, 사회적 문제점들도 함께 논의하여 책임감 있는 기술 개발과 활용에 대해 생각해 볼 수 있다."
                        },
                        {
                            "과목 코드": "BIO2121",
                            "과목명": "현대생물학실험 Ⅰ",
                            "강의시간": "1시간",
                            "실험시간": "4시간",
                            "학점": "3학점",
                            "내용": "생명과학의 거의 모든 분야에서 기본적으로 필요로 되는 단백질 분석의 원리와 방법을 완충 용액 제조, 단백질의 분리·정제, 효소의 활성 분석, 항체를 이용한 단백질 분석 등을 통해 체계적으로 습득하고, 아울러 2차원 전기영동을 이용한 단백질체 분석을 통해 이러한 원리들이 최신 연구기법에 어떻게 응용되는지 이해한다."
                        },
                        {
                            "과목 코드": "BIO2122",
                            "과목명": "현대생물학실험 Ⅱ",
                            "강의시간": "1시간",
                            "실험시간": "4시간",
                            "학점": "3학점",
                            "내용": "현대 생명과학에서 보편적으로 사용되는 유전자 클로닝의 기초를 플라즈미드 DNA 분리, 제한 절단과 분자 연결, 형질전환세포 제조와 형질전환체 분석 등을 통해 체계적으로 습득하고, 이러한 기법들이 발현체 프로파일링에 의해 유전체의 특성을 분석하는 최신 연구에 어떻게 적용되는지 이해한다."
                        },
                        {
                            "과목 코드": "BIO2131",
                            "과목명": "생화학 Ⅰ",
                            "강의시간": "3시간",
                            "학점": "3학점",
                            "내용": "생명체의 고분자 구성 물질인 탄수화물, 지방, 단백질, 핵산등과 이들 단위체들에 대한 분자적 특징과 수소 이온 농도, 해리상수, 효소 반응 속도론 및 능동 수송에 대해 다룬다."
                        },
                        {
                            "과목 코드": "BIO2132",
                            "과목명": "생화학 Ⅱ",
                            "강의시간": "3시간",
                            "학점": "3학점",
                            "내용": "생체 에너지 대사론과, 고분자 화합물의 생체내 합성 및 분해에 대한 것을 대사 경로의 조절 기작과 함께 다루며 ATP 형성기작에 대한 것도 다룬다."
                        },
                        {
                            "과목 코드": "BIO2141",
                            "과목명": "세포학",
                            "강의시간": "3시간",
                            "학점": "3학점",
                            "내용": "세포의 구성 성분과 고분자 화합물, 그로 이루어진 세포내의 미세구조와 이들의 기능을 공부하며, 총체적인 생명체로서의 세포에서 일어나는 현상, 세포분열, 증식, 세포간의 정보전달 및 노화에 관하여 배운다."
                        },
                        {
                            "과목 코드": "BIO2151",
                            "과목명": "분자생물학",
                            "강의시간": "3시간",
                            "학점": "3학점",
                            "내용": "DNA의 구조와 기능, 복제방법, 조작방법 등을 다루며 RNA 전사기전, 전사효소, 전사종결, 전사조절, 해독기구, 해독기전, 유전 암호, 발현조절방법 등을 배운다. 또한 플라즈미드, 트랜스포존, 바이러스의 구조, 특성을 다루며 유전자재조합 방법과 이를 바탕으로 한 염기서열 결정법, 유전자 증폭법 등을 다룬다."
                        },
                        {
                            "과목 코드": "BIO2311",
                            "과목명": "생명유기화학",
                            "강의시간": "3시간",
                            "학점": "3학점",
                            "내용": "생명체를 이루는 주요 화합물은 탄소 중심의 유기화합물이다. 본 교과목에서는 분자의 구조 및 화학 결합을 이해하고, 탄소 화합물들의 화학 구조적 특징을 배우고, 작용기들에 따른 분류와 기본적 유기화학 반응들을 이해하여 생명체 내에 존재하는 고분자 유기화합물, 지질과 막, 탄수화물, 단백질과 효소, 핵산의 분자 구조를 이해함으로써 궁극적으로 분자 수준에서 생명체를 이해하는 데 있다. 생화학 I(BIO2131)(전공필수)과 함께 수강하는 것을 적극 권장한다."
                        },
                        {
                            "과목 코드": "BIO2350",
                            "과목명": "숙주미생물상호작용",
                            "강의시간": "3시간",
                            "학점": "3학점",
                            "내용": "미생물과 숙주는 오랜 기간 동안 같이 살아오면서 공생 또는 질병을 유발하면서 서로에게 유익한 또는 해로운 영향을 미치고 있다. 본 과목에서는 이러한 상호작용에 대해 알아본다. 구체적으로 인체 장내 세균의 역할, 다양한 미생물 질병 유도 기작, 감염에 대한 다양한 숙주의 대응 기작, 미생물의 면역회피 기작, 면역결핍증, 항생제 등에 대해 이해한다."
                        },
                        {
                            "과목 코드": "BIO2511",
                            "과목명": "산업미생물학",
                            "강의시간": "3시간",
                            "학점": "3학점",
                            "내용": "산업 미생물의 특징과 이들의 응용 분야를 이해한다. 또한 박테리아, 곰팡이, 효모 등 미생물들의 특징과 중요성에 대하여 강의하고, 산업공정과 생산제품에 관련된 미생물효소, 바이오 연료, 식품 및 알콜발효, 환경관련 생물분해와 조절에 대해 배운다."
                        },
                        {
                            "과목 코드": "BIO2522",
                            "과목명": "식물생명과학",
                            "강의시간": "3시간",
                            "학점": "3학점",
                            "내용": "식물생명과학의 전반적인 개론과 더불어 최신 과학적 지식을 학습하여 식물생명과학의 기초를 다지는 것을 목표로 한다. 식물 기초적인 계통과 식물 구조적, 세포학적, 생화학적, 분자생물학적 특징 그리고 식물생명과학의 응용을 다룬다."
                        },
                        {
                            "과목 코드": "BIO2601",
                            "과목명": "유전자클로닝개론",
                            "강의시간": "3시간",
                            "학점": "3학점",
                            "내용": "본 과목에서는 유전자 클로닝과 관련된 최신 기법을 학습할 예정이다. 학생들은 박테리아 배양 원리, 형질전환, 아가로스 젤전기영동, 플라즈미드 DNA, genomic DNA, RNA 정제 원리, 핵산 정량, DNA 제한효소 절단 및 분석, Southern hybridization, 라이브러리 제작, 중합효소 반응(polymerase chain reaction, PCR), 컴퓨터 기반 DNA 염기서열 분석 및 이와 관련된 기초적인 사항, 그리고 인터넷을 통한 data acquisition 등의 내용을 이론적으로 학습한다. 또한 DNA 클로닝벡터, 제한효소, modifying enzymes, polymerases, 기타 분자생물학 연구에 사용되는 reagent들, 차세대 sequencing 이나 microarray 등을 포함한 다양한 최신 omics 분야의 기본적인 내용을 학습한다."
                        },
                        {
                            "과목 코드": "BIO2701",
                            "과목명": "환경과학론",
                            "강의시간": "3시간",
                            "학점": "3학점",
                            "내용": "다양한 생물들이 서식하는 환경 및 생태계의 개념을 이해하고, 생태계 내에서 인간의 활동이 환경/생태계에 미치는(또는 미칠 수 있는) 영향을 파악(또는 예상)하여, 현재 상존하는 환경문제를 인식하고 그 해결을 위한 접근방식을 익힌다. 또한 주요 개념들의 논리적, 체계적인 이해를 바탕으로 타 학문분야와의 접목을 시도하고, 이를 통하여 지구생태계를 지속가능성 시각에서 해석 할 수 있는 능력을 함양 한다."
                        },
                        {
                            "과목 코드": "BIO3100",
                            "과목명": "전공진로설계Ⅰ",
                            "강의시간": "0시간",
                            "학점": "0학점",
                            "내용": "학생들은 본 교과를 통해 지도교수로부터 전공 진로 관련 상담을 받을 수 있으며, 해당 전공 출신 선배의 진학/취업/진로 등 사례를 통해 자기 주도적 계획을 설계할 수 있다."
                        },
                        {
                            "과목 코드": "BIO3123",
                            "과목명": "현대생물학실험 Ⅲ",
                            "강의시간": "1시간",
                            "실험시간": "4시간",
                            "학점": "3학점",
                            "내용": "분리집단 개체의 분자표지 분석을 통해 유전법칙의 원리를 이해하고, 생식세포의 특성과 발생의 특징, 분화에 따른 변화의 기본 메커니즘을 관찰과 실험을 통해 학습한다. 이어 동·식물의 생리적 특성을, 식물체 내 수분 이동, 광합성 반응 및 식물 호르몬의 작용 분석과, 동물세포의 세포막 전위 및 활성전위측정을 통해 심도 있게 탐구한다."
                        },
                        {
                            "과목 코드": "BIO3124",
                            "과목명": "현대생물학실험 Ⅳ",
                            "강의시간": "1시간",
                            "실험시간": "4시간",
                            "학점": "3학점",
                            "내용": "상동 재조합 분석과 transposon을 이용한 돌연변이체 구축 및 선별을 통해 미생물의 유전현상을 이해하고 분자유전학적 기법을 습득한다. 발효를 통한 세포의 증식 및 진단 실험과 면역세포의 분리 및 분석을 통해 세포간 상호작용을 비롯한 다양한 생명현상에 대한 이해의 폭을 넓힌다."
                        },
                        {
                            "과목 코드": "BIO3161",
                            "과목명": "유전학",
                            "강의시간": "3시간",
                            "학점": "3학점",
                            "내용": "고전유전학과 분자생물학을 상호 연관시켜 현대유전학의 개념을 확립한다. 즉, 유전 및 변이 현상의 원리를 분자, 세포, 및 개체(군) 수준에서 공부함으로써 생명현상을 이해한다. 이를 위해 유전자의 구조와 기능 및 유전체학과 기능유전체를 학습하고, 멘델의 유전 법칙과 변이, 양적형질의 개념을 이해하며, 물질 대사, 분화와 발달의 유전학적 원리와 집단유전학의 개념, 그리고 유전형과 환경과의 상호작용에 대해 학습한다."
                        },
                        {
                            "과목 코드": "BIO3212",
                            "과목명": "생명공학개론",
                            "강의시간": "3시간",
                            "학점": "3학점",
                            "내용": "이미 우리 생활과 밀접한 연관이 있는 여러 종류의 바이오 테크놀로지의 다양한 이론적 배경, 각 이론의 실제 적용의 예시와 앞으로의 발전 방향에 대해 다양한 각도로 살펴본다. 실제 적용의 예시로는 미생물, 식물, 동물, DNA, 생물적 환경정화, 수생과 의약학 바이오 테크놀로지 등이며, 이러한 산업과 관련된 기초적인 규정, 법률, 윤리와 사업에 대해서도 같이 배운다."
                        },
                        {
                            "과목 코드": "BIO3311",
                            "과목명": "발생학",
                            "강의시간": "3시간",
                            "학점": "3학점",
                            "내용": "생물의 발생과정 중 생식 세포의 형성, 초기 발생과정, 조직의 기원 및 분화, 기관의 형성 등을 개괄적으로 다루고, 발생 현상의 원리를 세포 및 조직간 상호작용, 내재적 요인과 외부적 요인, 유전자 발현 조절 측면에서 고찰한다. 또한 패턴형성의 원리를 세포 및 분자 수준에서 조명하고 기형, 암의 발생과 재생의 원리를 이와 결부하여 다룬다."
                        },
                        {
                            "과목 코드": "BIO3711",
                            "과목명": "미생물학",
                            "강의시간": "3시간",
                            "학점": "3학점",
                            "내용": "미생물의 구조, 구성, 특성, 대사과정을 비롯하여 미생물을 순수분리한 후 이를 유지하는 방법에 관하여 배우고 이들의 생장과 생리적 근거를 규명하며, 변이와 유전물질의 교환 기전을 배운다. 또한 미생물의 다양성과 각 무리의 형태적, 생리학적, 산업적, 의학적, 환경적, 면역학적 특성을 다룬다."
                        },
                        {
                            "과목 코드": "BIO3712",
                            "과목명": "미생물생리학",
                            "강의시간": "3시간",
                            "학점": "3학점",
                            "내용": "미생물이 무생물적 요인(자연 환경)과 생물적 인자(숙주, 공생체, 경쟁생물)에 적응하는 방식의 다양성에 대해 유전학적, 분자생물학적인 관점에서 소개한다. 이러한 미생물의 다양한 생리적 특성을 부여하는 생화학적, 유전학적, 생리학적 반응에 대한 기초적인 지식을 개관한 후, 각각을 조합한 시스템 수준에서 이해함으로서 '미생물 생리체'라는 개념을 획득한다. 또한 미생물의 생리적 특성을 진화의 관점에서 계통 유전체학적인 미생물의 다양성과도 연결할 수 있는 지적 능력을 함양한다."
                        },
                        {
                            "과목 코드": "BIO4100",
                            "과목명": "생명과학 현장실습",
                            "실험실습": "4주 이상",
                            "학점": "3학점",
                            "내용": "생명과학에서 배운 이론 지식을 바탕으로 생명과학 분야의 산업체와 연계해 실질적으로 적용해 보고 경험해 보는 현장실습을 수행한다."
                        },
                        {
                            "과목 코드": "BIO4203",
                            "과목명": "생명과학 특허와 기술이전",
                            "강의시간": "1시간",
                            "학점": "1학점",
                            "내용": "생명과학의 유용한 연구결과를 지적재산권화하기 위해 필요한 과정과 관련 내용을 다룬다. 이를 위해 지적재산권에 대한 중요성과 그 형성과정 및 기술이전에 관한 내용을 현행 제도와 실례를 통하여 배운다.",
                            "비고": "(물리 특허와 기술이전(PHY4023), 화학 특허와 기술이전(CHM4203) 과목과 중복 수강 할 수 없다.)"
                        },
                        {
                            "과목 코드": "BIO4251",
                            "과목명": "생물통계학",
                            "강의시간": "3시간",
                            "학점": "3학점",
                            "내용": "생물학적인 자료수집과 실험에 있어서 그 기획과 분석 그리고 해석하는 원리와 방법을 배운다."
                        },
                        {
                            "과목 코드": "BIO4252",
                            "과목명": "암생물학",
                            "강의시간": "3시간",
                            "학점": "3학점",
                            "내용": "본 과목에서는 암생물학과 관련된 전반적인 내용을 다룬다. 정상세포가 암세포로 형질전환되는 유전적 변화의 원인과 기전을 이해하기 위해 이와 관련된 암유전자(oncogenes), 암억제 유전자 (tumor suppressor genes), 암줄기세포 (cancer stem cells), tumor microenvironment, chemotherapy, 그리고 drug resistance에 관해 학습한다."
                        },
                        {
                            "과목 코드": "BIO4321",
                            "과목명": "인체생리학",
                            "강의시간": "3시간",
                            "학점": "3학점",
                            "내용": "인체를 포함하여, 고등동물의 세포, 조직기관의 구조와 기능, 세포막을 통한 물질의 이동과 생체의 전기현상, 정보전달 및 반응, 동물의 배설, 호흡, 순환, 감각, 조절과 통제의 기능과 원리를 세포학, 생화학, 분자생물학적 지식을 토대로 하여 배우며, 이에 관련된 과제들을 다룬다."
                        },
                        {
                            "과목 코드": "BIO4331",
                            "과목명": "신경생물학",
                            "강의시간": "3시간",
                            "학점": "3학점",
                            "내용": "동물은 뇌와 신경계를 통하여 환경의 변화와 상호간의 작용에 학습과 기억으로 반응을 한다. 본 과목에서는 중추신경계와 말초 신경계의 구조와 개개의 구조를 이루는 세포와 조직의 기능을 세포분자 생물학의 개념으로 배운다. 수업의 개요는, 신경세포들의 종류와 기능, 전기적 신호의 생성과 전달, 화학적 시냅스 전달과정의 메커니즘, 시냅스 가소성, 뇌의 구조와 기능, 감각과 운동 신경세포의 기능, 뇌의 신경세포들의 연결, 학습과 기억의 생성과 뇌 신경질환의 발생들을 살펴본다."
                        },
                        {
                            "과목 코드": "BIO4351",
                            "과목명": "면역학",
                            "강의시간": "3시간",
                            "학점": "3학점",
                            "내용": "본 과목에서는 병원균의 감염에 대항하는 인체의 방어기작에 대해 배운다. 면역현상의 전체적인 개괄과 면역계를 이루는 구성요소인 선천성 면역계, 항원의 인식, 림프구의 발달, 후천성 면역계의 역동적 상호작용 등에 대해 구체적으로 다룬다."
                        },
                        {
                            "과목 코드": "BIO4441",
                            "과목명": "분자세포생물학",
                            "강의시간": "3시간",
                            "학점": "3학점",
                            "내용": "세포와 환경사이에 일어나는 세포신호전달 과정과 세포주기의 조절 기전, 세포자살 현상, 세포와 외부와의 상호작용 과정, 배아와 성체줄기세포의 특성 및 응용에 관련된 최근의 경향을 공부하고 분자세포학 연구에 사용되는 주요 테크닉에 대한 원리를 학습한다."
                        },
                        {
                            "과목 코드": "BIO4521",
                            "과목명": "식물발달생물학",
                            "강의시간": "3시간",
                            "학점": "3학점",
                            "내용": "식물발달생물학은 중급 및 고급 수준의 강의이다. 식물은 동물과 달리 그 형태적 발달이 배발생 이후에도 계속적으로 이루어지는 특징을 가지고 있다. 이 과목에서는 이러한 식물의 형태를 구성하는 발달학적 특징을 배우고, 이것의 발달 프로그램을 발달 돌연변이체의 유전학적 분석과 많은 유전자의 발현 및 활성 조절을 통해 이해하고 학습한다."
                        },
                        {
                            "과목 코드": "BIO4721",
                            "과목명": "분자세포종양학",
                            "강의시간": "3시간",
                            "학점": "3학점",
                            "내용": "암의 실험 연구 모델과 연구 방법론, 그리고 암발생의 위험인자들과 암의 진단법, 치료를 위해 진행되는 임상 시험에 대해서 다룬다. 또한 최신 연구에서 밝혀진 암을 치유하기 위해 표적으로 삼을만한 분자에 대해 학습함으로써, 효과적인 암치료전략에 대해 알아본다."
                        },
                        {
                            "과목 코드": "BIO4911",
                            "과목명": "식물유전공학",
                            "강의시간": "3시간",
                            "학점": "3학점",
                            "내용": "식물 생명 현상의 기본 원리, 유전체 기능 및 식물 생명공학 기술을 이해하고, 이를 바탕으로 인간과 환경에 친화적인 고생산성/고기능성 식물체 개발에 대한 사례를 익힘으로써, 분자적 수준에서 식물 생명현상에 대한 이해의 폭을 넓히고, 미래 식물자원 개발에 대한 중요성을 인식한다."
                        },
                        {
                            "과목 코드": "BIO4921",
                            "과목명": "특수연구",
                            "학점": "3학점",
                            "내용": "졸업반(7∼8학기) 학생의 선택과목으로서 지도교수의 지도에 따라 개별적으로 특수연구 또는 이에 준하는 과제를 수행한다.",
                            "비고": "(응용바이오기술실험(BIO4931) 과목과 동일한 학기에 동시에 수강 할 수 없다)"
                        },
                        {
                            "과목 코드": "BIO4931",
                            "과목명": "응용바이오기술실험",
                            "실험시간": "6시간",
                            "학점": "3학점",
                            "내용": "졸업반(7∼8학기) 학생 중 산업체 취업이나 전문 연구원 과정을 목표로 하는 학생들을 위해 필수적인 실험 기술들인 유전자 재조합 기술, 유전자 발현 기술, 세포배양기술, 유용 단백질 분리 기술 등을 다루고, 실험을 통하여 습득한다. 연구결과는 리포트로 제출하고 슬라이드로 발표하여 그 우수성을 평가한다.",
                            "비고": "(특수연구(BIO4921) 과목과 동일한 학기에 동시에 수강 할 수 없다)"
                        },
                        {
                            "과목 코드": "BIOG001",
                            "과목명": "바이오텍의 기술사업화 종합설계",
                            "강의시간": "2시간",
                            "설계시간": "1시간",
                            "학점": "3학점",
                            "내용": "이 과목을 통하여 학생들은 바이오텍 산업에 관련된 여러가지 제반 사항에 대해 배우고 분석하고 적용할 기회를 얻게 된다. 생명과학에 대한 충분한 지식을 갖춘 학생 중 산업계 취업이나 창업을 계획하는 학생들이 필요한 이론을 배우고, 각 분야의 초청된 전문가와 실무경험을 나누는 기회가 된다. 테크놀로지의 R&D, 상품개발, 지적재산과 특허, 허가와 절차, 비즈니스 모델, 재무계획 등의 개요를 배우고, 이를 바탕으로 한 시제품 제작과 사업제안서를 팀별로 작성 발표한다."
                        },
                        {
                            "과목 코드": "BIOG153",
                            "과목명": "고급분자생물학",
                            "강의시간": "3시간",
                            "학점": "3학점",
                            "내용": "핵산의 구조와 물리화학적 특성, 유전자 발현조절에 관한 분자생물학적 기전을 배우며, 핵산 및 유전자 발현을 연구하는데 필요한 생화학적·분자생물학적 실험기법에 대해 알아봄으로써, 연관된 전공과목을 공부하는데 필요한 지식을 익힌다."
                        },
                        {
                            "과목 코드": "BIOG232",
                            "과목명": "생물리학",
                            "강의시간": "3시간",
                            "학점": "3학점",
                            "내용": "생물계의 일반적인 물리적 성질, 생체 거대물질, 생체막, 신경, 근육, 광합성 및 시각 시스템의 구조 및 기능에 대한 물리적 요인의 영향에 관하여 배우고, 생물리학적인 개념, 기기 사용 및 분석 방법의 응용을 다룬다."
                        },
                        {
                            "과목 코드": "BIOG241",
                            "과목명": "구조생물학",
                            "강의시간": "3시간",
                            "학점": "3학점",
                            "내용": "생명의 기능을 조절하는 단백질, DNA, 지질 등의 구조를 규명하는 방법에 대하여 배우고, 이들 구조의 비교분석, 예측, 분류, 데이터베이스 및 분석 프로그램들을 이용하는 방법 등을 다루어 생명현상을 이해하는 데 필요한 기초 지식을 배운다."
                        },
                        {
                            "과목 코드": "BIOG322",
                            "과목명": "동물대사학",
                            "강의시간": "3시간",
                            "학점": "3학점",
                            "내용": "동물의 에너지 대사, 탄수화물, 지질, 단백질 대사, 대사 조절 및 대사 장애 등에 대한 기본 개념을 다룬다. 또한, 대사 효소, 대사 네트워크, 에너지 대사의 조절 기전 및 에너지 대사와 질병과의 관계에 대해 탐구한다. 특히 에너지 대사조절에 중요한 내분비계와의 상호작용과 간, 근육, 지방조직 등 다양한 대사 기관에서의 에너지 대사 조절 살펴봄으로써 에너지 항상성 유지와 질병 발생 기전에 대한 폭넓은 시야를 제공하여, 동물 생물학 분야에서의 연구 및 응용 가능성을 향상시키고자 한다."
                        },
                        {
                            "과목 코드": "BIOG511",
                            "과목명": "식물분자생리학",
                            "강의시간": "3시간",
                            "학점": "3학점",
                            "내용": "식물은 지구상의 1차 생산자로써 빛에너지를 화학에너지로 전환시키고, 고분자 물질 (탄수화물, 단백질, 지질, 핵산)을 생산하기 위하여 주위 환경으로부터 물, 무기염, 기체 분자 등을 식물체 내로 흡수한다. 그 후 일련의 대사과정 (광합성, 호흡, 지질대사 등)을 거쳐 생체고분자를 합성하여 식물의 조직과 기관의 분화에 사용하는 일련의 과정을 이해하며, 더불어 움직이지 못하는 식물은 다양한 해충, 병원균, 환경 스트레스(저온, 가뭄 등)로부터 공격을 받는데 이를 극복하는 기작을 분자 수준에서 이해한다."
                        }
                    ],
                    "교직과목": [
                        {
                            "과목 코드": "EDUS981",
                            "과목명": "과학 교과교육론",
                            "강의 시간": "3시간",
                            "학점": "3학점",
                            "내용": "생명과학 교과교육의 목적, 내용, 방법, 평가 등에 대한 다양한 이론과 관점을 고찰하며, 중·고등학교 생명과학 교육과정의 실제를 구체적으로 분석한다."
                        },
                        {
                            "과목 코드": "EDUS982",
                            "과목명": "과학 교과논리 및 논술",
                            "강의 시간": "3시간",
                            "학점": "3학점",
                            "내용": "생명과학 교과의 구조와 특성에 대한 전반적인 이해를 토대로, 생명과학 혹은 과학의 내용과 원리를 소재로 사고력의 함양과 논술지도 능력을 기른다."
                        },
                        {
                            "과목 코드": "EDUS983",
                            "과목명": "과학 교과 교재연구 및 지도법",
                            "강의 시간": "3시간",
                            "학점": "3학점",
                            "내용": "중·고등학교 생명과학 교과 교육과정 및 교과서 등에 대한 체계적 분석과 생명과학 교수방법의 이론과 실제에 대한 이해를 통해, 생명과학 교과를 효과적으로 가르칠 수 있는 실천적 자질을 함양한다."
                        }
                    ]
                }
            },
            "SCIENCE기반 자유전공학부":{
                "과목 정보": [
                    {
                        "과목 코드": "SCI1001",
                        "과목명": "자유전공진로탐색",
                        "학점": "0학점",
                        "내용": "본 교과는 자연과학을 기반으로 하는 다양한 전공에 대한 전반적인 이해를 통해 학생들의 적성에 부합하는 진로를 찾고 설계할 수 있도록 하는 교과목이다. 주로 수학, 물리학, 화학, 생명과학 등에서 나타나는 자연현상을 이해하고 그 인과관계의 분석이 우리의 삶과 밀접한 관계가 있다는 것을 배운다."
                    },
                    {
                        "과목 코드": "SCI1011",
                        "과목명": "과학수학",
                        "학점": "3학점",
                        "내용": "다변량 구조로 이루어져 있는 다양한 과학적 데이터를 분석하고 필요한 정보를 도출하기 위해서는 다변수 함수의 미분 및 적분론의 이해가 필요하다. 본 교과는 미적분학Ⅰ과 Ⅱ를 포괄하는 교과로서 벡터해석을 공부한다."
                    },
                    {
                        "과목 코드": "SCI1012",
                        "과목명": "통합물리",
                        "학점": "3학점",
                        "내용": "본 교과는 뉴턴 운동방정식과 보존법칙, 진동/파동 현상, 열역학 1/2 법칙, 맥스웰 방정식과 전자기파, 그리고 양자물리학의 기본 개념을 다룬다. 본 교과는 일반물리Ⅰ과 Ⅱ를 포괄하는 교과이다."
                    },
                    {
                        "과목 코드": "SCI1013",
                        "과목명": "통합화학",
                        "학점": "3학점",
                        "내용": "본 교과는 현대 화학의 기본적인 개념인 화학 양론, 원자의 구조 및 주기율표, 화학결합 이론을 비롯하여 반응속도론, 화학평형 및 열역학 등 기본적인 화학의 원리를 다룬다. 더불어 이를 다른 학문 분야의 연구에 적용하는 예들을 공부하면서 중심 과학으로서 화학의 역할을 경험한다. 본 교과는 일반화학Ⅰ과 Ⅱ를 포괄하는 교과이다."
                    },
                    {
                        "과목 코드": "SCI1014",
                        "과목명": "통합생물학",
                        "학점": "3학점",
                        "내용": "본 교과는 미생물에서 인간에 이르기까지 주요 생명현상을 체계적으로 다루며, 현대 생명과학의 최신 주제들을 함께 탐구한다. 학생들은 세포 생물학, 생화학, 유전학, 생태학, 진화 등의 기초 개념을 배우고, 이를 바탕으로 생명체의 다양한 상호작용과 그 작용 메커니즘을 이해한다. 또한, 생명공학, 유전자 편집, 환경 문제와 같은 현재 과학계에서 주목받고 있는 최신 주제들을 심도 있게 다룬다. 본 교과는 일반생물학Ⅰ과 Ⅱ를 포괄하는 교과이다."
                    },
                    {
                        "과목 코드": "SCI1021",
                        "과목명": "과학도를 위한 선형대수",
                        "학점": "3학점",
                        "내용": "본 교과는 주식, 지진 또는 기상의 시계열 동역학계의 분석, 분자의 화학적 특성, 질병의 전이과정, DNA(RNA) 유형 분석 등의 선형적 인과관계를 분석하기 위한 교과목으로서 랜덤행렬의 특잇값 분할을 이용하여 주성분 분석과 독립성분 분석을 배운다."
                    }
                ]
            }
        }
    }
}