{
    "2025 서강대학교 요람": {
        "서강대학교 전인(全人) 교양 교육과정": {
            "교육목표": "지성ㆍ인성ㆍ영성을 겸비한 융·복합 창의 인재",
            "교육목적": {
            "창의적 지성 (Veritas)": [
                "① 미래 지향적 학문의 바탕이 되는 융합적 기초소양을 증진한다.",
                "② 새로운 시대를 선도하는 문제해결능력과 창의성을 기른다."
            ],
            "봉사적 인성 (Virtue)": [
                "③ 이웃에 대한 관심과 공감능력을 갖춘 리더십을 배양한다.",
                "④ 다양성을 포용할 수 있는 성숙한 시민의식을 함양한다."
            ],
            "통합적 영성 (Spiritualitas)": [
                "⑤ 나와 이웃, 인간과 사회, 자연과 우주를 통합적으로 성찰한다.",
                "⑥ 인간의 소명인 사랑을 실천하고 지행일치의 삶을 지향한다."
            ]
            },
            "서강 건학이념-인재상-교양교육과정 목적 및 목표 연계도": {
            "창의적 지성을 갖춘 인재 양성": [
                "미래 지향적 학문의 바탕이 되는 융합적 기초소양을 증진한다.",
                "새로운 시대를 선도하는 리더쉽과 창의성을 기른다."
            ],
            "통합적 영성을 갖춘 인재 양성": [
                "나와 이웃, 인간과 사회, 자연과 우주를 통합적으로 성찰한다.",
                "인간의 소명인 사랑을 실천하고 지행일치의 삶을 지향한다."
            ],
            "봉사적 인인성을 갖춘 인재 양성": [
                "이웃에 대한 관심과 공감능력을 갖춘 리더쉽을 배양한다.",
                "다양성을 포용할 수 있는 성숙한 시민의식을 함양한다."
            ]
            }
        },
        "인문대학": {
            "국어국문학과": {
                "교육목표": [
                    "학문의 질적 탁월성을 추구하여, 지식의 체계성과 깊이를 겸비하는 교육, 보편성과 특수성을 함께 탐구하는 교육에 역점을 두며, 실용에 이바지하는 교육, 시대 및 사회의 요구에 부응하는 교육, 세계화를 지향하는 교육을 중시한다. 이를 실천하기 위한 구체적 목표는 다음과 같다.",
                    "언어와 문학의 일반 이론을 폭넓게 탐구한다.",
                    "한국어와 한국문학의 역사적 흐름과 전통에 대해 올바로 이해한다.",
                    "한국어와 한국문학의 각 영역에 대한 체계적이고도 깊이 있는 지식을 축적한다.",
                    "한국어문학과 인접 학문과의 관계를 다각적으로 규명한다.",
                    "언어와 문학을 통해 문화를 이해한다.",
                    "다매체적 상황에서 한국어와 한국문학의 새로운 위상을 탐구한다.",
                    "한국어문학 연구 성과의 세계적 통용을 지향한다."
                ]
            },
            "사학과": {
                "교육목표": [
                    "한국사·아시아사·서양사 세 분야에 대한 균형 있는 학습을 통해 건전하고 합리적인 역사의식을 형성하고 그것을 토대로 아래의 능력을 배양하는 것을 목적으로 한다.",
                    "1. 과거의 관점에서 현재를 이해하고 현재의 관점에서 과거를 이해하도록 한다. 이를 통해 현대세계의 중요 문제의 배경과 추이를 이해하고 이러한 문제에 내재한 복잡성과 다양한 요인들의 상호작용에 대한 이해를 높인다.",
                    "2. 증거(사료)를 분석하는 능력과 비판적 독서능력을 키우면서 논점을 형성하고 평가하는 능력을 함양한다.",
                    "3. 논리적이고 객관적으로 표현할 수 있는 지성을 함양한다.",
                    "4. 편견과 선입관을 뛰어넘을 수 있는 균형적인 시각과 냉철한 비판정신을 함양한다.",
                    "5. 유연한 사고와 장기적 전망 그리고 폭넓은 국제적 시야를 지닌 인재를 육성한다."
                ]
            },
            "철학과": {
                "교육목표": "철학 전반에 걸친 기초적 소양 쌓기를 목적으로 삼고 있다. 철학 공부의 기본은 무엇보다 철학사적 지식을 얻는 데서 시작된다. 그러므로 1∼2학년 때는 서양철학사와 동양철학사를 중심으로 차근 차근 철학적 지식을 쌓아 나가는 한편, 논리학, 윤리학, 인식론, 형이상학 등 철학의 기본 과목을 익혀 나간다. 그 후, 3∼4학년에서는 개별 학문과 구체적 현실과 관련된 여러 전문 철학 분야를 공부하게 된다. 관심에 따라 서양철학 분야나 동양철학 분야를 심화시켜 공부할 수 있다. 졸업 후 교직에 진출하기를 희망하는 경우, 철학교직과목을 택해서 들을 수 있다."
            },
            "종교학과": {
                "교육목표": "종교학은 종교문화에 대한 학문적 이해와 연구를 목적으로 하는 학문 분과이다. 종교학 전공의 교육목표는 우선 전공자들이 종교현상에 대한 공감적이며 비판적인 탐구방식을 배움으로써 종교의 여러 문제를 비판적으로 사고하고 표현하는 인문과학적 기초소양을 얻는 것이다. 또한 전공자들이 인류 문화의 근간으로 현대세계의 인간의 삶에 큰 영향력을 미치고 있는 다양한 종교들의 세계관을 배움으로써 인류의 다원적 정신문화에 대해 넓은 이해를 추구해 나아가도록 돕는 것이다. 이를 위한 교과과정은 단계적으로 구성되어 있고 다음과 같은 네 가지 분야로 나누어져 있다. 첫째는 종교학의 여러 방법론과 이론을 습득하는 분야이고, 둘째는 개별 종교의 역사와 사상을 탐구하는 분야이고, 셋째는 개별 종교의 대표적 고전들을 강독하는 분야이고, 넷째는 특정 이론과 주제 하에 종교현상을 고찰하는 분야이다."
            },
            "영미어문전공": {
                "교육목표": [
                    "영미어문전공은 영문학과 영어학뿐아니라 영어교육의 영역까지 학문적 특성을 살리면서도 실용적인 교육을 통하여 21세기가 요구하는 창의적이고 개방적인 전문인과 직업인 및 교육자를 배출한다.",
                    "영미어문전공은 균형 있는 인문학 교육을 바탕으로 영어와 영문학, 영미문화와 역사에 대한 학제융합적인 교육을 통하여 다원화·글로벌화하는 현대사회를 선도할 수 있는 창의적 인재를 배양한다.",
                    "영미어문전공은 영어로 이루어지는 전공 강의, 소규모 토론 중심 강의를 통하여 학생들의 능동적 참여와 비판적 사고 역량을 진작하는 동시에 전공학문분야에서의 영어글쓰기와 토론 등 엄격하고 철저한 훈련을 체계적으로 제시한다.",
                    "영미어문전공은 전공학문, 외교, 통상, 방송, 언론, 교육 등 다양한 전문 분야 진출에 적합한 인재를 양성한다."
                ]
            },
            "미국문화전공": {
                "교육목표": [
                "21세기는 문화의 세기입니다. 물질문명과 정신문명 모두 초국가적으로 국경, 지역, 시간대 등을 복합적으로 넘나들며 교류되는 세상에서 국가와 개인의 생존을 위해 문화에 대한 정보와 이해가 모든 분야에서 절대적으로 필요합니다. 미국문화전공은 이러한 21세기의 새로운 요구에 부응하기 위하여 미국을 중심으로 한 영어권 세계의 문화를 폭 넓고 깊이 있게 연구하는 전공입니다. 미국문화전공 학생은 세계무대에서 정치, 경제, 문화를 선도하는 국제 전문인이 될 것입니다. 미국문화전공에서는 논리적, 창의적 사고로 자유롭게 자기를 표현할 수 있는 의사소통능력을 기르고, 미국문화와 미국문화의 세계적 영향에 대한 구체적이면서도 학제적이고 총체적인 이해를 바탕으로 한 국제 전문인 또는 미국학 전문가 양성을 목표로 합니다. 따라서 미국문화전공에서는 보다 실질적이면서도 포괄적인 미국문화에 대한 이해를 돕기 위하여 미국의 역사, 문학, 영화, 음악, 시각예술, 소수문화, 사회운동, 상업문화, 정치 등을 탐구하는 다양한 과목들을 제공합니다.",
                "미국문화전공 과정을 수료하고 나면 시대적 요청에 부응하는 국제적 전문인이 될 수 있습니다. 문화산업, 언론, 방송, 무역 및 경영, 은행권, 출판, 교직 등 모든 분야가 다 미국문화전공으로 졸업한 학생이 활동할 수 있는 무대입니다. 또한, 포괄적인 학제적 전공이므로 학부에서 미국문화를 전공한 다음에 이를 배경으로 어떤 분야에서도 학문 연구를 계속할 수 있습니다. 서강대학교의 미국학 대학원 과정은 물론, 영문학, 사학, 철학, 신문방송학, 심리학, 사회학, 정치외교학 등의 분야에서 대학원 과정을 계속할 수 있고, 미국학 관련 전공으로 유학을 가거나 미국 로스쿨에 진학할 수도 있습니다. 미국문화전공은 다양한 이런 진로로 진출할 수 있는 토대를 탄탄하게 쌓는 것을 목표로 합니다."
                ]
            },
            "유럽문화학과": {
                "교육목표": "독일어권과 프랑스어권을 중심으로 유럽의 언어, 문학 그리고 문화에 대하여 체계적 지식을 갖추고 유럽인의 삶과 문화양식을 실천적으로 이해하는 유럽 전문가를 육성한다. 또한 유럽 사회의 상호 문화적 소통에 대한 이해를 바탕으로 다문화 사회에 접어든 우리 사회의 바람직한 발전에 이바지하고 우리의 문화를 유럽에 널리 알릴 수 있는 미래형 인재를 배양한다. 이러한 목표를 실현하기 위한 구체적인 교육 방향은 다음과 같다.",
                "교육방향": [
                    "실용 및 소통 중심의 다언어 구사력 강화",
                    "문화적 이해와 문학적 상상력에 바탕을 둔 인문학적 소양의 제고",
                    "모두가 함께 행복한 삶을 실현하기 위한 미래지향적 직업역량의 함양"
                ]
            },
            "중국문화학과": {
                "교육목표": "중국을 움직이는 심층 기제인 문화를 통해 중국에 대해 가장 깊이 있고 총체적으로 이해하는 차별화된 중국 전문가를 양성한다. 이를 위해 중국어 습득은 물론이고 중국 문학, 중국 역사, 중국 철학 등을 포함한 중국 문화 전반에 대한 학제적이고, 유기적이며, 심층적인 교육과정을 통해 중국을 통합적으로 이해하고 중국에 대한 실용적이고 전문적 지식을 갖춘 미래형 중국 관련 인재를 양성한다."
            },
            "인문학기반 자유전공학부": {
                "교육목표": [
                    "학제적 사고력, 비판적 분석력, 윤리적 판단력을 갖춘 인문학적 창의 인재 양성 교육을 목표로 함.",
                    "끊임없이 변화하고 모든 것이 불확실한 시대에 세상을 유연하게 탐색하고 통찰력 있게 대응할 수 있게 해주는 인문학적 사고력 함양",
                    "인간과 AI의 협업이 중요한 과제로 떠오른 시대에 AI와 효과적으로 소통할 수 있는 인문학적 표현력 함양",
                    "공동체의 일원으로서 다양성을 존중하고 포용력을 발휘하며 책임감 있게 행동할 줄 아는 인문학적 공감력 함양"
                ]
            }
        },
        "사회과학대학":{
            "사회학과": {
                "교육목표": "현대 사회에서 인간을 둘러싼 모든 사회 현상들, 즉 제도, 문화, 구조, 정책, 네트워크, 갈등, 변화 등에 관해서 이해하고 분석하며, 사회적 논쟁의 이슈와 문제를 다양한 관점에서 해석하고, 사회적 비전과 구조적 전망을 제시할 수 있는 전문가적 소양을 갖춘 글로벌 인재 양성을 목적으로 한다."
            },
            "정치외교학과": {
                "교육목표": "교육목표는 정치 현상을 과학적으로 탐구하고 이해할 수 있는 다양한 지식을 체계적으로 습득 케 하여, 공동체의 책임 있는 구성원으로서 사회의 지도적 역할을 수행할 수 있는 전문 인력을 양성하는 데 있다."
            },
            "심리학과": {
                "교육목표": [
                    "1) 심리학의 기초 지식, 심리학 연구의 기능 및 심리학에 대한 긍정적 태도를 습득하고 그것을 적용할 수 있는 능력을 배양한다.",
                    "2) 현대 사회에서 야기되는 많은 사회문제들을 심리학적 지식을 통해 접근하고 그 해결방법을 모색하는 능력을 배양한다.",
                    "3) 심리학 및 심리학적 원리가 요구되는 분야에서 필요한 직업준비 교육을 함으로써 유능한 직업인으로서의 능력과 자세를 함양한다.",
                    "4) 보다 심화되고 전문적인 연구를 위해 대학원에 진학할 수 있는 기초 준비 교육을 한다.",
                    "5) 제반 인문·사회과학 및 컴퓨터 과학 등 인접분야와 공유할 수 있는 심리학적 지식과 기능을 배양한다."
                ]
            }
        },
        "자연과학대학":{
            "수학과": {
                "교육목표": {
                    "목표": "수학과 관련된 다양한 분야에서 창조적 사고능력과 전문적 지식을 바탕으로 능동적으로 일할 수 있는 미래의 유능한 인재를 양성하는 것을 목표로 한다. 더불어 서강대의 교육목표인 윤리의식, 협동심, 올바른 세계관, 훌륭한 인격을 갖춰 우리 사회와 인류에 공헌할 수 있는 인재를 양성하는 것을 목표로 한다. 구체적인 목표는 다음과 같다.",
                    "구체적인 목표": [
                        "논리적이고 창의적인 사고력을 배양하여 어떠한 분야에서도 능동적으로 일할 수 있는 유능한 인재를 양성한다.",
                        "학문의 질적 수월성과 차별화를 통하여 사회 및 산업체에서 선도적인 임무를 수행하는 인재를 양성한다.",
                        "국제화, 정보화 시대에 유연하게 대처할 수 있는 인재를 양성한다.",
                        "순수수학과 응용수학의 균형적이고 상호보완적인 발전을 이루는 데 주력하며 수학 전반에 대한 전문 지식을 습득하고 서로 관련된 분야를 이해하는 인재를 양성한다."
                    ]
                }
            },
            "물리학과": {
                    "교육목표": "물질의 성질과 자연법칙의 이해를 통한 창의력·적응력·책임감을 갖춘 전인적 과학인재의 양성을 목표로 한다. 물리학 전반에 걸친 기초지식과 아울러 시대적 요청에 따른 첨단 학문의 교육도 강조하여 사회와 국가의 발전에 기여할 수 있는 능력을 배양한다. 이러한 목표의 달성을 위해 학과는 학생들에게 순수성·창의성·보편성·첨단성·문화성의 다섯 가지에 대한 질적 수월성을 요구하고, 이를 뒷받침하기 위해 본과는 균형 있는 교과목을 편성, 우수한 교수진의 확보, 창의적인 교수법의 개발, 충분한 상담 등을 통해 제반 교육여건을 마련하고 질높은 교육을 수행하는 것을 목표로 하고 있다."
            },
            "화학과": {
                "교육목표": "화학은 물질의 성질, 구조 및 변화를 이해하고 변화에 수반되는 에너지의 상관관계를 규명하여 물질을 합성하는 학문이다. 물질을 탐구하는 화학은 자연과학의 중심학문이고 기초 학문이다. 동시에 화학은 질병을 치료하는 의약 바이오 물질 개발, 첨단 산업에 활용되는 환경, 에너지 신소재 합성 등을 연구하는 응용학문이다. 화학과의 교육목표는 화학에 대한 전문 지식과 연구 능력을 갖춘 유능한 화학자의 양성이다."
            },
            "생명과학과": {
                "교육목표": "자연 존중의 의식을 바탕으로 과학자의 사명과 책무를 다하는 전인적 소양을 지닌 생명과학 분야의 전문 인력을 양성하는 데 그 목적을 두고 있다. 이를 위하여 생명과학 분야의 기초 및 전문적인 지식을 균형 있게 습득하게 하고, 충실한 실험실습교육을 통해 과학적 분석력과 응용력을 갖추도록 하며, 창의적이고 선도적 능력을 겸비한 과학자가 되어 인류 사회를 위해 봉사 할 수 있는 건전하고 성실한 인재가 되도록 노력한다."
            },
            "SCIENCE기반 자유전공학부":{
                "교육목표": [
                    "과학적 기초사고방식의 함양을 바탕으로 전공 선택의 자율성과 자연과학, 공학, 사회과학, 인문학 등과의 학문적 연계, 교육의 수월성 제고 및 융합 교육을 목표로 과학적 사고력을 진작시키는 교육을 목표로 함.",
                    "다양한 과학 관련 문제들을 해결하기 위한 기본적인 과학적 사고력을 신장하고 통찰력을 키워 제반 사회 속에서 나타나는 문제들을 과학적으로 추론(推論, Inference) 할 수 있는 능력을 갖춘 인재를 양성함."
                ]
            }
        },
        "공과대학":{
            "전자공학과": {
                "교육목표": "실용적인 문제해결을 위한 창의력, 적응력, 판단력을 겸비한 전인적인 전자공학인을 양성한다. 서강대학교 전자공학과는 민주적 가치관과 예수회 교육이념에 입각한 인성교육과 풍부한 창의력, 탁월한 적응력, 올바른 판단력을 배양하기 위한 전공교육을 통하여 전인적인 전자공학인을 배출하는 것을 목표로 한다. 이와 같은 교육목표의 실현을 통해 국가와 인류의 요구에 부합하는 미래지향적이면서 책임감과 봉사정신을 겸비한 전문인력을 배출함으로써 무한경쟁시대에 혁신을 주도할 수 있는 국가적 역량을 제고함과 동시에 지식기반시대의 인류의 기술발전에도 기여할 수 있도록 한다.",
                "세부 교육 목표": [
                    {
                        "목표": "창의력을 갖춘 전자공학인의 양성",
                        "설명": "풍부한 기초과학 및 기초공학 지식에 기반을 두고 새로운 것을 창출하고 기술혁신을 이루어 낼 수 있는 능력을 지닌 전자공학인을 양성한다. 이는 선진국들을 비롯한 모든 국가들이 자국의 기술을 특허장벽으로 철저히 보호하는 기술전쟁의 시대에 독창적 원천기술의 확보를 통해 국가 경쟁력을 제고할 수 있는 역량을 확보하는 것을 의미한다."
                    },
                    {
                        "목표": "적응력을 갖춘 전자공학인의 양성",
                        "설명": "교육을 통해 습득한 지식들을 이용하여 빠른 시간에 실용적이고 실질적인 산물로 구체화할 수 있는 유연한 사고력과 실행능력을 갖춘 전자공학인을 양성한다. 이는 급변하는 현대의 기술 환경에 적절히 대처할 수 있는 능력을 갖추고 국가산업과 지역사회의 발전을 이끌어 갈 수 있게 되는 것을 의미한다."
                    },
                    {
                        "목표": "판단력을 갖춘 전자공학인의 양성",
                        "설명": "기술적 문제의 해결을 위해 가능한 모든 선택을 파악하고 이로부터 최선의 방안을 도출해 낼 수 있는 전자공학인을 양성한다. 이는 자신의 전문분야에서만 문제를 바라보지 않고, 보다 거시적인 관점에서 주어진 문제의 해결을 통해 얻고자 하는 바를 이해하고 궁극적인 목표를 달성할 수 있는 지름길을 제시함으로써 전자공학인의 기여범위를 단순 기술개발의 영역을 넘어서 경영/정책 분야까지 확대하는 것을 의미한다."
                    },
                    {
                        "목표": "전인적인 전자공학인의 양성",
                        "설명" :"다양한 전문분야의 인재와 상호신뢰를 기반으로 한 협력을 통해 자신의 능력을 극대화하고, 자신의 국가적/사회적 역할과 책임을 올바르게 인식하는 전자공학인을 양성한다. 이는 자신의 재능과 지식을 자신이 속한 조직, 더 나아가 궁극적으로 사회, 국가, 인류에 유익하게 활용하고자 하는 공학인 기본덕목의 재무장을 의미한다."
                    }
                ]
            },
            "화공생명공학과": {
                "교육목표": "본 화공생명공학과는 예수회 교육이념을 토대로 한 본교의 교육목표인 윤리의식, 협동심, 올바른 세계관과 시대의 변화에 대한 능동적 적응 능력을 갖춘 전인적 화공생명공학자를 양성함을 목표로 한다.",
                "세부 교육 목표": [
                    "화공생명산업의 문제점들을 분석하고 해결할 수 있는 능력",
                    "화공생명공학 문제를 창출하고 해결할 수 있는 연구 능력",
                    "화공생명공학 분야의 비전을 제시하고 선도해 나갈 수 있는 리더십"
                ]
            },
            "기계공학과": {
                "교육목표": {
                    "인류사회 공동번영에 기여하는 기계공학": "기계공학적 지식을 기반으로 혁신적인 도전을 통해 미래 가치를 창조함으로써 인류사회 공동번영에 기여할 수 있는 인재 양성과 연구 성과 창출을 목표로 한다.",
                    "세부 교육 목표": [
                        "급변하는 미래 사회에 대응할 수 있는 창의성 계발을 위한 기초 및 다양한 응용과 융합 기술에 대한 내실 있는 전공 교육",
                        "인류사회 공동 번영을 위한 개방적인 가치 지향적 교육 및 연구",
                        "공학적, 과학적인 도전적 문제 해결을 위한 세계적 수준의 혁신적 연구",
                        "사회적 문제 해결 및 국민의 삶의 질 향상을 위한 연구"
                    ]
                }
            },
            "시스템반도체공학과": {
                "교육목표": "차세대 반도체 리더는 다양한 환경에서 동작하는 반도체 소자 및 회로를 이해하고 설계하며, 이들을 소프트웨어를 통하여 유기적이고 효과적으로 결합하여 활용할 수 있는 능력을 갖춘 인력이므로, 해당 분야의 이론적인 지식뿐만 아니라 실무능력까지 겸비함으로써 세계 반도체 기술을 선도할 수 있는 최고 수준의 반도체 인재를 양성하는 것을 목표로 한다.",
                "세부 교육 목표": [
                    "이론과 실무능력을 겸비한 차세대 반도체 인재 양성",
                    "창의적이고 혁신적인 문제 해결 능력을 갖춘 인재 양성",
                    "자기 주도적인 세계적 반도체 리더 양성"
                ]
            }
        },
        "소프트웨어융합대학": {
            "컴퓨터공학과": {
                "교육목표": "이론과 창의력 그리고 인성을 바탕으로 한 컴퓨터 분야의 교육을 통하여 국가의 IT 전 분야를 이끌어 갈 지도자를 양성한다. 서강대학교의 컴퓨터공학과는 오랜 전통의 예수회 교육 이념을 토대로 올바른 세계관과 시대의 변화에 대한 능동적 적응력을 갖춘 컴퓨터 전 분야의 인재를 양성하기 위하여 다음과 같은 구체적인 목표를 설정한다.",
                "세부 교육 목표": [
                    {
                        "목표": "기초과학의 이론 습득 및 응용",
                        "설명": "기초과학, 특히 수학에서 습득한 이론과 지식을 전공에 응용할 수 있는 능력을 배양한다. 기초과학의 학습뿐만 아니라 보다 심도 있는 전공 이외의 교과과정을 통하여 컴퓨터분야의 학문적 깊이를 깨닫고 응용능력을 부여한다."
                    },
                    {
                        "목표": "컴퓨터 전문 분야의 이론 및 실무 능력 배양",
                        "설명": [
                            "컴퓨터 관련 문제들을 인식하며, 모델링할 수 있는 능력",
                            "컴퓨터 구성요소와 시스템을 설계하고 구현할 수 있는 능력",
                            "자료를 이해하고 분석할 수 있는 능력",
                            "컴퓨터 관련 최근의 기술과 도구, 언어를 사용할 수 있는 능력",
                            "문제를 정의하고 이해를 거쳐 창의적으로 해결할 수 있는 능력",
                            "팀을 이루어 한 구성원의 역할을 수행할 수 있는 능력"
                        ]
                    },
                    {
                        "목표": "인성교육을 통한 책임 있는 도덕적 인재 육성",
                        "설명": "인성교육을 통하여 컴퓨터분야의 리더로서 반드시 갖추어야할 윤리적, 도덕적 책임감을 부여한다."
                    }
                ]
            },
            "인공지능학과":{
                "교육목표": "이론과 창의력 그리고 인성을 바탕으로 한 인공지능 분야의 교육을 통하여 국가가 필요로 하는 AI 지도자 양성 및 AI분야를 이끌어 갈 전문인력을 양성한다. 서강대학교의 인공지능학과는 오랜 전통의 예수회 교육 이념을 토대로 올바른 세계관과 시대의 변화에 대한 능동적 적응력을 갖춘 인공지능 전 분야의 인재를 양성하기 위하여 다음과 같은 구체적인 목표를 설정한다.",
                "세부 교육 목표": [
                {
                    "목표": "기초이론의 습득 및 응용",
                    "설명": "수학, SW 등 기초이론과 지식을 전공에 응용할 수 있는 능력을 배양한다. 또한 이를 넘어서 심도 있는 다양한 분야의 교과과정을 통하여 인공지능 분야에 접목할 수 있는 응용능력을 부여한다."
                },
                {
                    "목표": "인공지능 분야의 이론 및 실무 능력 배양",
                    "설명": [
                    "인공지능 관련 문제들을 인식하며, 모델링할 수 있는 능력",
                    "인공지능 시스템을 설계하고 구현할 수 있는 능력",
                    "데이터를 이해하고 분석할 수 있는 능력",
                    "인공지능 관련 최근의 기술과 도구, 언어를 사용할 수 있는 능력",
                    "문제를 정의하고 이해를 거쳐 창의적으로 해결할 수 있는 능력",
                    "팀을 이루어 한 구성원의 역할을 수행할 수 있는 능력"
                    ]
                },
                {
                    "목표": "인성교육을 통한 책임 있는 도덕적 인재 육성",
                    "설명": "인성교육을 통하여 인공지능분야의 리더로서 반드시 갖추어야 할 윤리적, 도덕적 책임감을 부여한다."
                }
                ]
            },
            "AI기반 자유전공학부": {
                "교육목표": "이론과 창의력 그리고 인성을 바탕으로 한 인공지능융합 분야의 교육을 통하여 국가가 필요로 하는 AI융합 지도자 양성 및 AI융합 분야를 이끌어 갈 전문 인력을 양성한다. 서강대학교의 AI기반 자유전공학부는 오랜 전통의 예수회 교육 이념을 토대로 올바른 세계관과 시대의 변화에 대한 능동적 적응력을 갖춘 인공지능융합 전 분야의 인재를 양성하기 위하여 다음과 같은 구체적인 목표를 설정한다.",
                "세부 교육 목표": [
                    {
                    "목표": "기초이론의 습득 및 응용",
                    "설명": "수학, SW, 인공지능 등 기초이론과 지식을 전공에 응용할 수 있는 능력을 배양한다. 또한 이를 바탕으로 다양한 분야의 교과과정과의 융합을 통하여 인공지능융합 분야에 접목할 수 있는 응용능력을 부여한다."
                    },
                    {
                    "목표": "인공지능융합 분야의 이론 및 실무 능력 배양",
                    "능력": [
                        "인공지능융합 관련 문제들을 인식하며, 모델링할 수 있는 능력",
                        "인공지능융합 시스템을 설계하고 구현할 수 있는 능력",
                        "데이터를 이해하고 분석할 수 있는 능력",
                        "인공지능융합 관련 최근의 기술과 도구, 언어를 사용할 수 있는 능력",
                        "문제를 정의하고 이해를 거쳐 창의적으로 해결할 수 있는 능력",
                        "팀을 이루어 한 구성원의 역할을 수행할 수 있는 능력"
                    ]
                    },
                    {
                    "목표": "인성교육을 통한 책임 있는 도덕적 인재 육성",
                    "설명": "인성교육을 통하여 인공지능융합 분야의 리더로서 반드시 갖추어야 할 윤리적, 도덕적 책임감을 부여한다."
                    }
                ]
            }
        },
        "경제대학": {
            "경제학과": {
                "교육목표": "현실 경제 환경에 대한 엄밀한 분석력과 국제적 경쟁력을 갖춘 합리적이고 창의적인 경제전문가 양성을 목표로 기본적인 소양을 배양하고 학문적 역량을 증진한다."
            }
        },
        "경영대학": {
            "경영학부(경영학전공)": {
                "교육목표": "글로벌화와 급변하는 환경 속에서 기업의 비전과 목표를 구현할 수 있는 지도자를 양성하고, 경영학 이론을 실제에 적용하면서 팀과 조직에서 다른 사람들과 협력하여 일할 수 있는 능력의 배양을 도모한다. 또한 인간에 대한 존엄성과 인간관계의 정의와 사랑을 강조하여 윤리의식을 갖고 기업 활동을 할 수 있는 전문경영인력을 양성하는 것을 목표로 한다."
            }
        },
        "지식융합미디어대학": {
            "지식융합미디어대학" : {
                "목표": "인문학, 예술/디자인, 사회과학, 테크놀로지 지식의 통섭적 탐구와 미디어의 응용을 기반으로 창의력, 비판적 사고력, 협업능력, 테크놀로지 활용능력, 글로벌 혁신능력을 갖추고 정보, 지식, 상상력 기반의 지식기반 사회를 선도할 최정예 인재를 양성한다."
            },
            "신문방송학과": {
                "교육목표": "변화하는 온-오프라인 정보 환경을 창의적으로 주도하는 저널리스트를 양성하는 동시에, 국민, 소비자, 지역 사회 등 다양한 공중을 상대로 한 소통을 윤리적이며 통합적으로 수행하는 균형감각을 지닌 전략 커뮤니케이션 전문가를 육성한다. 글로벌 정치 경제 환경, 융합하는 미디어 환경, 창의적 내용에 대한 사회적 요청에 응답하는 책임 있는 커뮤니케이터를 길러낸다."
            },
            "미디어&엔터테인먼트학과": {
                "교육목표": "미디어&엔터테인먼트학과는 초지능사회로 진화하는 현대 사회에서 다양한 미디어, 특히 ICT(Information and Communication Technology)와 이를 활용한 콘텐츠의 사회적/심리적 효과를 학문적으로 조명하는 동시에 이를 기획, 제작 및 경영하는 기술과 지식을 갖춘 인재 양성을 목표로 한다. 또한 공연/영상예술 콘텐츠를 기획, 제작하는 예술적 창의력과 지식을 갖추고 미디어 테크놀로지를 중심으로 방송, 영화, 뮤지컬, 연극, 게임, 테마파크 등의 엔터테인먼트 분야들이 융합되는 추세에 맞춘 인재를 양성한다."
            },
            "Art & Technology": {
                "Mission": "Our mission is to cultivate the next generation of creators and creative innovators. By providing trans-disciplinary education integrating humanities, art, and technology, learning-by-doing education, and global education, we prepare students to become global creative leaders who can create cultural and social impacts with huanistic imagination, artistic sensibility, and technological competence."
            }
        },
        "로욜라국제대학": {
            "Global Korean Studies": {
                "Mission": "The Department of Global Korean Studies (GKS) nurtures engaged, creative, global citizens and leaders of twenty-first century knowledge development through an integrated study of Korea from a global perspective. GKS students study various aspects of the global construction of modern and contemporary Korea in order to understand Korea constructed by the world, Korea constructing the world, and Korea understood by the world. In so doing, students gain not only an extensive knowledge of Korea but also learn how knowledge about Korea is produced, both in Korea and around the world. As future leaders in academia, creative industries, information technology, publishing, global journalism, government and non-governmental organizations, and entrepreneurship, GKS graduates bring knowledge of Korea to the world and a knowledge of the world to Korea.",
                "Bachelor of Arts in Global Korean Studies": "The Bachelor of Arts in Global Korean Studies Program provides an elite liberal arts education to the next generation of global leaders. Korea as an object of study presents students with the opportunity to understand the diverse ways that Korea is known on the peninsula and around the world, situating GKS students at a hub of international discourse. Studying at this global intersection, GKS students develop uniquely broad international perspectives, as well as exceptional analytical and communication skills. A deep knowledge of Korea and the practical skills of knowledge development documentation and curation, quantitative and qualitative analysis, argument and creative expression as they are practiced with millennia-old and next-generation technological equipments and positions students in GKS as global leaders of twenty-first century knowledge creation. Courses in the Department of Global Korean Studies are taught in English. However, Korean language skills are required in order to participate successfully. Students, therefore, are expected to have native or near-native fluency in English and a working knowledge of both languages before entering the B.A. Program in Global Korean Studies."
            },
            "한국어교육전공": {
                "교육목표": [
                    "인류애와 이타성을 바탕으로 한국어교육학의 학문적 탁월성과 글로벌 스탠더드를 지향하는 교육에 역점을 두어 학제적 융합 연구와 글로벌 혁신을 주도하는 창의적 리더를 양성하고자 한다.",
                    "이를 실천하기 위한 구체적 목표는 다음과 같다.",
                    "1. 국제적 관점에서 한국어와 한국 문화를 체계적이고 심도 있게 이해한다.",
                    "2. 한국어와 한국 문화를 체계적이고 효과적으로 교육하는 데 요구되는 이론적·실제적 지식을 갖춘다.",
                    "3. 한국어 교수·학습 체계의 혁신을 이끌 수 있는 에듀테크 기술을 이해하고 활용한다.",
                    "4. 한국어와 한국 문화를 세계적으로 확산하고 매개할 수 있는 전문적인 한국어 소통 능력을 함양한다."
                ]
            },
            "International Relations": {
                "Mission": "The Bachelor of Arts in the International Studies Program with the International Relations Track cultivates young experts specialized in international politics. By offering a distinctive world-class education, this program equips students with practical capabilities and theoretical knowledge about international affairs, thereby nurturing them to become international experts who play a leading role in academia, public institutions, international organizations, and multinational corporations.",
                "Career Paths": "The International Relations track can help students become global-minded professionals or academics. Students can seek employment opportunities in international organizations or nongovernmental organizations, such as the United Nations, Greenpeace, and Amnesty International. Our promising students can also seek employment opportunities in research institutions or pursue further education in academia, majoring in political science or international studies, at the post-graduate level to become excellent scholars."
            },
            "International Commerce": {
                "Mission": "The International Commerce Program at the Teodor Geppert School of International Studies provides rigorous training in international economics, business, finance, and economic law. This program is dedicated to cultivating outstanding students who not only build a robust academic foundation but also gain practical experience, empowering them to evolve into independent, motivated, and capable leaders poised to make enduring and indispensable contributions to the global economy.",
                "Career Paths": "Students in the International Commerce program aspire to shape their careers by contributing to the public sector as diplomats, trade lawyers, international economic and business policymakers, and journalists. Additionally, they aim to engage with esteemed international organizations, including the United Nations, World Bank, World Trade Organization, International Monetary Fund, Asian Development Bank, and various nongovernmental or intergovernmental organizations. In the private sector, our graduates are encouraged to explore opportunities in global economics, business, ﬁnance, and legal ﬁelds, taking on roles as international economic consultants, international business entrepreneurs, and ﬁnancial analysts for multinational corporations and international banks. Our promising graduates also pursue further study in economics, business, law, and international studies at the post-graduate level, propelling them toward becoming outstanding scholars."
            },
            "Asian Studies": {
                "Overview": "Our Asian Studies program approaches Asia with an emphasis on gaining a broader understanding of the region by utilizing knowledge and perspectives across a wide range of disciplines. Asia, now, is possibly the most dynamic area of the world economy. Countries in the region are ever more interconnected – not only through investment and trade, but also politically and culturally through global processes of diplomacy, migration, popular culture, and tourism. Our Asian Studies program therefore aims to provide a comprehensive learning experience that: 1) enables students to fully appreciate the interconnectedness within/of the region and beyond; 2) exposes students to diverse disciplinary approaches (including culture, geography, history, international development/cooperation, international relations, and politics). In addition to the subject-based modules, students will also be able to enrich their learning in/on Asia via our basic-level East Asian language courses or various Asia-related emersion and exchange programs. In order to create a stimulating learning environment for students, we will organize various Asia-related activities/events and special lectures/talks by professionals from diverse backgrounds, including academics and practitioners.",
                "Career Paths": "Students who completed the Asian Studies major at Loyola College will have the expertise and skills to work as an Asia expert and enter a variety of fields, including international organizations in Korea and abroad, media, education, culture, business, and academia."
            },
            "글로벌경제전공": {
                "교육목표": "글로벌경제전공은 글로벌 시대의 경제 환경에 대한 엄밀한 분석력과 국제적 경쟁력을 갖춘 합리적이고 창의적인 경제 전문인재를 양성하는 것을 목표로 하고 있습니다. 국제경제의 다양한 현상에 대해 이해하고 해석하는 능력 양성을 위한 기본적인 소양을 배양하고 현실 경제에 응용이 가능한 실용적인 학문적 역량을 키우기 위해 경제학, 국제경제학, 경영학과의 융합교육을 실시합니다."
            },
            "글로벌경영전공": {
                "교육목표": "경영학이란 1900년경부터 발전하기 시작한 전문적이고 실용적인 학문이며, 기업과 자본주의의 본질에 대한 인식을 바탕으로 기업과 기업 관련 활동을 그 연구대상으로 삼고 있습니다. 글로벌경영전공에서는 경영학의 기본적 내용을 구성하는 회계학, 인사조직·전략, 마케팅, 재무관리, 국제경영, 생산운영관리, 경영과학, 경영정보시스템에 대하여 전반적으로 학습하게 됩니다."
            },
            "글로벌미디어전공": {
                "교육목표": "글로벌미디어전공은 미디어 산업적 측면에서 주목할 필요가 있는 다양한 유형의 미디어 콘텐츠에 대한 기획, 제작, 홍보 영역에 있어서의 전문성을 갖춘 글로벌 인재 양성을 목표로 하고 있습니다. 미디어 생태계에 대한 이해와 실질적으로 미디어 콘텐츠를 기획하고 제작할 수 있는 능력을 고양시킬 수 있는 이론 및 실습수업을 통해 전공학생들은 통합적 전문성을 갖춘 미디어 산업 인재로 성장할 수 있는 기회를 갖게 됩니다."
            }
        },
        "연계전공": {
            "여성학 연계전공": {
                "교육목표": "여성학 연계전공은 사회, 역사적으로 구성된 여성, 남성에 대한 성 고정관념을 넘어서 성평등 사회를 구현하기 위해 이 분야의 전문적인 인재를 양성하는 것을 교육목표로 하고 있다. 성(gender, sexuality)에 따른 불평등 문제를 인간과 사회, 문화에 대한 기본적인 전제와 관련하여 탐구하기 위해서 성에 의해 야기되는 다양한 문제를 여러 전공분야를 포괄한 종합적이면서도 간학문적인(interdisciplinary) 연구방법에 의해 접근하는 강의들을 제공한다."
            },
            "스타트업(Entrepreneurship) 연계전공": {
                "교육목표": [
                "글로벌 혁신을 주도하는 리더와 최고수준의 벤처 기업가를 양성하기 위하여 다음과 같은 교육 목표를 둔다.",
                "창의적 사고와 문제 해결 능력을 배양한다.",
                "기술과 인문, 경영, 경제 등 학제 간 융합 연구 기회를 제공한다.",
                "신제품 개발, 사업기획, 투자 유치 등을 주도할 수 있는 기업가형 인재를 육성한다.",
                "창업에 필요한 지식을 제공한다."
                ]
            },
            "정·경·철(정치학·경제학·철학) 연계전공": {
                "교육목표": "현대사회를 움직이는 가장 중요한 요소는 지식, 권력, 경제라고 말할 수 있다. 철학은 사물의 본질 및 현상의 구조를 근원적으로 탐구하고, 정치학은 권력의 획득·유지·행사와 관련된 정치 현상을 연구하며, 경제학은 사회 내 희소한 자원의 배분을 둘러싼 현상과 정책에 관심을 갖는다. 이 전공의 목적은 학생들로 하여금 현대 사회를 움직이는 지식, 권력, 경제를 상호 연계하여 이해하는 것을 돕는 데 있다."
            },
            "융합소프트웨어(Convergence Software) 연계전공": {
                "Track A": {
                    "교육목표": "융합소프트웨어 연계전공과정은 소프트웨어 비전공자를 대상으로 하여 SW분야와 다양한 非 IT 분야를 창의적으로 융합하는 능력을 배양하며 이를 기반으로 융합 소프트웨어 개발능력을 갖춘 인재를 양성하는 것을 목표로 한다."
                },
                "Track B(인문콘텐츠)": {
                    "교육목표": "인문콘텐츠 융합소프트웨어 연계전공과정은 인문학과 컴퓨터공학을 융합함으로써 IT 기반의 새로운 인문 지식을 창출할 수 있는 인재 양성이 목표이다."
                }
            },      
            "스포츠미디어 연계전공": {
                "교육목표": "스포츠미디어 연계전공은 스포츠 현장에서의 미디어 역할에 대한 이해를 높이는 것은 물론, 이를 통해 스포츠 및 스포츠 파생상품의 소비 촉진에 대한 심도 깊은 고찰과 함께, 현대사회에 미치는 스포츠의 문화적 영향력을 연구하는데 있다. 이를 위해 스포츠 및 매스 커뮤니케이션과 관련된 기능적 역할을 탐색하고 스포츠 프로모션을 통한 스폰서십 역할을 분석하며 스포츠 및 디지털 미디어가 현대사회 전반에 미치는 문화적 영향력을 탐구한다. 스포츠 미디어 연계 전공은 스포츠와 미디어의 결합으로 새롭게 진행되고 있는 사회현상을 이해하고 다양한 교육과정을 통해 미디어의 핵심적 지식과 경험을 습득함으로서 스포츠 전문 방송인 및 스포츠 미디어 관련 전문가를 양성하는데 있다."
            },
            "교육문화 연계전공": {
                "교육목표": "교육문화 전공의 목표는 인간의 활동 가운데 하나인 교육의 개념과 원리를 이해하고, 제도화된 교육으로서의 학교를 중심으로 그 형성과정과 사회적 기능, 교수－학습과 평가 등에 관하여 이해하며, 주체적으로 교육활동에 참여하는 데 필요한 능력과 지식을 얻도록 하는 데 있다."
            },
            "융합생명공학 연계전공": {
                "교육목표": "융합생명공학 연계전공과정은 학제적 성격을 가지고 바이오나노(BT/NT), 바이오메디칼(BT/MT), 바이오정보(BT/IT) 등의 다양한 융합생명공학 관련 교육을 통하여 급변하는 과학기술사회에 창조적으로 적응할 수 있는 미래형 인재 양성을 목적으로 한다."
            },
            "한국발전과 국제개발협력 연계전공": {
                "교육목표": "본교의 교육 이념인 ‘인류 문화와 인류 공동체의 발전에 헌신할 수 있는 인재의 양성’과 교육 목적인 ‘세계평화에 기여할 수 있는 참된 세계인 양성’, 그리고 교육목표인 ‘남과 함께 남을 위하여, 남을 통하여 봉사하는 삶’에 적합한 인재를 양성하고, 한국의 경제성장과 더불어 국제개발협력의 중요성이 날로 확대되고 있는 상황에서 학생들로 하여금 국제개발협력분야의 유능한 인재로 교육시키기 위해 이 분야 진출을 위한 경로를 안내하고 교육하는 것을 목표로 한다."
            },
            "공공인재 연계전공": {
                "교육목표": "국가 공무원을 비롯한 공공영역에서 활동할 인재를 양성하기 위한 과정으로서 공공인재로서 요구되는 제반 소양교육을 제공함과 아울러 공공영역을 운영하는데 필요한 각종제도에 대한 이해를 도모하고자 한다."
            },
            "동아시아학(EAS) 연계전공": {
                "교육목표": "전 세계적으로 동아시아의 중요성이 날로 확대되고 있으며 이로 인해 동아시아에 대한 세계인의 관심 또한 날로 증대되고 있다. 이에 동아시아 지역을 깊이 있게 학습하고 다양한 동아시아 해외 프로그램을 통해 동아시아 지역에 특화된 글로벌 인재를 양성하기 위해 본 연계전공을 설치한다. 동아시아 전문가 양성에 걸 맞는 교육을 위해 본 연계전공은 한·중·일 3국의 대학(서강대, 소피아대, 홍콩시립대)간 협정을 바탕으로 글로벌한 학습기회를 제공한다. 이를 통해 본 연계전공은 동아시아에 대한 이론적 학습과 현장 체험을 바탕으로 동아시아를 이해하는, 전인적 인격체를 갖추고 세계화 시대에 걸맞은 이론적·실무적 능력을 갖춘 전문인력을 배출하게 될 것이다."
            },
            "일본문화 연계전공": {
                "교육목표": "일본문화전공은 국제사회에서 큰 영향력을 지니고 있고 우리와 역사적으로나 현재적으로나 밀접한 관계를 맺고 있는 일본과 그 문화에 대한 이해를 높이는 교육 프로그램 제공을 목표로 한다. 국제화의 흐름 속에서 한국과 일본, 양국 간의 관계가 더욱 긴밀해지고 있는 현시점에서 우리 사회가 필요로 하는 다양한 일본 관련 업무를 효과적으로 수행할 수 있는 유능한 인재 육성을 목표로 한다.",
                "교육목표 세부사항": [
                    "다양하고 체계적인 일본어 교육을 통해서 높은 수준의 일본어 의사소통능력을 보유하도록 한다.",
                    "일본 및 일본문화에 대한 학제적 교육을 통해서 일본관련 주요 문제를 다룰 수 있는 종합적인 능력을 지니도록 한다.",
                    "일본의 대학들과의 다양한 교류 또는 현지 경험을 통해서 실제적인 일본 및 일본문화 이해능력을 함양한다.",
                    "폭넓고 균형적인 시각과 국제적 감각을 가지고 아시아와 세계 속에서 일본을 이해하려는 태도를 견지한다."
                ]
            },
            "빅데이터 사이언스(BigData Science) 연계전공":{
                "교육목표": "IT 기반 빅데이터의 처리 및 분석을 통하여 의사 결정 과정에서 효율적 해결책을 제시할 수 있는 빅데이터 기반 융·복합 인재 양성",
                "세부 교육목표": [
                "데이터 엔지니어 트랙: 데이터의 생성/저장/조작 등 데이터를 다루기 위한 SW 및 시스템 개발 능력을 키우기 위한 교육과정",
                "데이터 분석 트랙: 분야별 데이터 분석 및 예측 능력을 키우기 위한 교육과정"
                ]
            },
            "디지털인문학 연계전공":{
                "교육목표": "디지털 전환의 시대에 요구되는 인문학적 소양과 디지털 문해력을 배양하며, 언어, 문학, 역사, 철학, 종교학 등의 인문콘텐츠를 다양한 디지털 매체로 재창조해낼 수 있는 능력을 함양한다. 또한 인문학의 지적 성찰을 바탕으로 인문학의 방대한 자료를 디지털 형태로 재현하고 이를 학문과 산업에 활용할 수 있는 실천적 역량을 기른다."
            },
            "인공지능 연계전공(Artificial Intelligence)": {
                "교육목표": "인공지능 연계전공은 인공지능기술에 집중한 교육을 통하여 급변하는 4차 산업 혁명 시대를 선도할 수 있는 명실상부한 인공지능전문가 양성을 목적으로 한다."
            },
            "차세대반도체 연계전공": {
                "교육목표": "차세대 반도체 산업 발전을 이끌어갈 우수한 ELITE 인재를 양성하는 것을 목표로 한다. 소재, 공정, 장비, 설계 등 반도체 산업의 전 분야를 아우르는 융합 교육을 통해, 산업 현장의 요구에 부합하는 전주기적 인력을 배출하는 것을 목표로 한다. 견고한 기초 이론과 실습을 통합한 교육 프로그램을 제공하여 실무에 즉시 투입 가능한 전문 인재를 양성하는 것을 지향한다. 이를 위해 최신 공정·소자 및 설계·시스템 분야를 융합한 교육과 현장 맞춤형 산학 연계 교육을 운영한다. 이러한 교육을 통해 반도체 소자, 소재, 인공지능 반도체 등 신산업의 수요를 충족하고, 반도체 산업의 미래를 이끌어갈 혁신적이고 실무 중심의 인재를 배출하는 것을 목표로 한다."
            },
            "공동체 혁신(Community Innovation) 연계전공": {
                "교육목표": "4차산업혁명시대 사회통합과 상생의 공동체 건설에 기여하는 융합인재를 양성하는 것을 목표로 한다."
            }
        },
        "마이크로 교육과정":{
            "미국문화(American Culture) 마이크로전공": {
                "교육목표": "미국문화전공은 미국 사회, 역사, 대중문화 등에 대한 다양한 과목을 제공합니다. 필수과목 2과목, 선택과목 2과목을 수강하면 미국문화 마이크로전공을 이수할 수 있습니다."
            },
            "영미어문(English Literature & Linguistics) 마이크로전공": {
                "교육목표": "영미어문 전공은 다양한 분야의 인문학 연구를 목표로 영문학, 영어학 그리고 영어교육을 학제 융합적으로 탐구합니다. 4차혁명 시대에 필요한 창의적이고 전문적인 소통전문가를 양성합니다."
            },
            "합성유기화학(Synthetic Organic Chemistry) 마이크로전공": {
                "교육목표": "화학은 물질의 성질, 구조 및 변화를 이해하고 변화에 수반되는 에너지의 상관관계를 규명하여 물질을 합성하는 학문이다. 물질을 탐구하는 화학은 자연과학과 공학 분야에 다양하게 응용되는 기초학문이다. 본 마이크로전공을 이수함으로써, 특정 성질을 나타내는 분자를 설계하고 이를 합성하고 분석할 수 있는 능력을 기르게 된다. 본 전공은 제약 산업, 전기/전자 산업, 석유화학 산업 분야로 진출하려는 학생들에게 관련된 기본 역량을 제공한다."
            },
            "고분자 재료 화학(Bioanalytical Chemistry)": {
                "교육목표": "화학은 물질의 성질, 구조 및 변화를 이해하고 변화에 수반되는 에너지의 상관관계를 규명하여 물질을 합성하는 학문이다. 물질을 탐구하는 화학은 자연과학과 공학 분야에 다양하게 응용되는 기초학문이다. 고분자 소재는 화학, 전자, 반도체 등 현대 산업에서 가장 널리 쓰이는 필수 소재이다. 본 마이크로전공 과정은 학생들에게 고분자의 구조와 성질 및 합성에 대한 기본적인 지식과 응용할 수 있는 역량을 제공한다."
            },
            "생분석화학(Bioanalytical Chemistry) 마이크로전공": {
                "교육목표": "화학은 물질의 성질, 구조 및 변화를 이해하고 변화에 수반되는 에너지의 상관관계를 규명하여 물질을 합성하는 학문이다. 최근에는 단백질 신약 등 생체 분자의 응용 분야가 주목을 받으면서 생체 분자의 성질과 분석에 대한 지식이 많은 이공분야에서 요구되고 있다. 생분석화학 마이크로전공의 개설을 통해서 바이오 분자의 성질과 분석방법에 대한 기본적인 지식을 제공하여 관련 분야에서의 응용에 기초를 제공한다."
            },
            "무기재료화학(Inorganic Materials Chemistry)": {
                "교육목표": "화학은 물질의 성질, 구조 및 변화를 이해하고 변화에 수반되는 에너지의 상관관계를 규명하여 물질을 합성하는 학문이다. 물질을 탐구하는 화학은 자연과학과 공학 분야에 다양하게 응용되는 기초학문이다. 무기재료화학은 금속-비금속의 배위화합물과 금속, 비금속, 반도체 소재를 포함하는 무기고체재료의 구조와 성질, 합성 및 응용을 다루는 학문이다. 본 마이크로 전공 과정은 배터리, 촉매, 전자, 반도체 등 핵심 미래 산업에서 다루는 주요 무기재료소재에 대한 기본적인 지식과 응용할 수 있는 역량을 제공한다."
            },
            "반도체물리학(Semiconductor Physics) 마이크로전공": {
                "교육목표": "반도체의 에너지 띠, 전하운반자의 동역학과 같은 반도체 물리학의 기본개념을 이해하고 전기/광전자 소자와 같은 다양한 응용을 체계적으로 다룬다. 이를 위하여 반도체물리학, 고체물리학1, 양자물리학1의 3개 과목을 필수과목으로 하고, 전자기학1, 전자물리학1, 나노물리, 고체물리학2의 선택과목 중 1과목 이상을 이수하여 12학점 이상을 취득한 경우 반도체물리학 마이크로전공으로 인정한다."
            },
            "신호처리(Digital Signal Processing) 마이크로전공": {
                "교육목표": "각종 감지 센서에서 측정된 아날로그 전기 신호는 저장, 전송 그리고 변형이 용이한 디지털 신호로 변환할 수 있다. 디지털신호처리는 디지털신호를 변형하고 분석하여 의미있는 정보를 추정하는 기술로서, 영상, 음성, 레이다, 통신 등의 거의 모든 전자공학 분야에서 필요한 핵심 데이터 분석 기술이다. 본 전공에서는 신호의 수학적 표현 방법을 소개하고 주파수 및 확률적 특성을 분석하여 해석하는 다양한 기법을 배운다. 영상처리와 레이다 및 무선통신 분야에서의 응용 사례를 익힘으로서 향후 음성인식, 인공지능, 의료영상, 위치추적, 생체인식, 빅데이터 등 4차 산업혁명의 다양한 분야에 필요한 핵심 데이터 분석 전문가를 양성하는 것이 본 전공의 교육목표이다."
            },
            "융합소프트웨어(Convergence Software) 마이크로전공": {
                "교육목표": "소프트웨어의 기본이 되는 융합소프트웨어 마이크로전공 교육과정을 통해 융합소프트웨어 개발능력과 IT분야의 능력을 배양하며 진로를 정하는데 도움이 되는 것을 목표로 한다."
            },
            "현대생물학 마이크로전공": {
                "교육목표": "생물체를 이루는 고분자 물질의 성질과 대사 기작, 세포분열과 증식, DNA 구조와 기능, RNA 전사기전, 유전 및 변이현상의 원리, 식물의 조직과 기관의 분화, 미생물의 구조 및 특성, 인체의 세포 및 조직기관의 구조와 기능 등 다양한 생명 현상을 다룬다. 개설된 총 8개의 과목 중 4개 과목(12학점)을 이수하면 현대생물학 마이크로전공으로 인정된다."
            },
            "인공지능융합마이크로전공": {
                "교육목표": "학생 소속 전공에서 다루는 다양한 데이터를 인공지능 기술을 이용하여 수집/분석/시각화 할 수 있는 인공지능 기반 데이터 분석 능력을 배양한다."
            },
            "RF/THz(RF/THz Engineering) 마이크로전공": {
                "교육목표": "RF/THZ공학 마이크로전공에서는 고주파에서 동작하는 아날로그 회로를 분석하고 설계하며 측정할 수 있는 능력을 교육한다. 본 마이크로전공은 회로, 전자기 이론, 초고주파에 대한 다양한 단계별 과목을 제공하며, 마이크로전공 이수를 통해 RF/THz와 관련된 무선통신/레이다에 사용되는 회로 혹은 시스템을 설계하는 기본역량을 기를 수 있다."
            },
            "반도체공학 (Semiconductor Engineering) 마이크로전공": {
                "교육목표": "반도체공학 마이크로전공은 다양한 환경에서 동작하는 반도체 소자 및 회로를 이해하고 설계하며, 이들을 소프트웨어를 통하여 유기적이고 효과적으로 결합하여 활용할 수 있는 능력을 교육한다. 본 마이크로전공은 반도체 회로, 반도체 시스템, 반도체 소자에 대한 다양한 단계별 과목을 제공하며, 마이크로전공 이수를 통해 반도체 산업 분야로 진출하기 위한 기본역량을 기를 수 있다."
            },
            "인공지능정보처리 (AI Information Processing) 마이크로전공": {
                "교육목표": "본 전공의 교육 목표는 인공지능 기술을 활용하여 다양한 정보를 처리하고 해석하는 능력을 배양하는 것이다. 기초 프로그래밍 능력을 배양하고 이를 바탕으로 정보처리와 인공지능 기술에 대한 이해를 높인다. 신호의 표현 및 특성 분석 방법에 대해 학습하고 인공지능 기술의 기초가 되는 수학적 기반과 그 응용에 대해서 학습한다. 디자인프로젝트를 통해 본 전공으로부터 습득한 모든 지식과 기술을 활용해 시스템을 설계하고 실제 문제를 해결하는 경험을 쌓는다."
            }
        },
        "교직과정": {
            "교육목표": ""
        }
    }
}