{
    "2025 서강대학교 요람": {
        "경영대학": {
            "경영학부(경영학전공)": {
                "과목 정보": {
                    "MGT2001": {
                        "과목 코드": "MGT2001",
                        "과목명": "현대기업과 기업윤리",
                        "강의 시간": "3시간",
                        "학점": 3,
                        "내용": "경영학의 입문과목으로 자본주의 경제의 기반이 되는 자유기업제도 및 기업을 둘러싼 경제, 정치, 법, 자원, 소비자 등의 환경을 인식시키고, 그러한 환경 하에서 운영되는 현대기업의 기본개념과 목적 및 기업의 사회적 책임을 포함한 기업윤리에 대하여 소개하는 것을 중심과제로 다룬다. (단, 전공학점에서 제외)"
                    },
                    "MGT2002": {
                        "과목 코드": "MGT2002",
                        "과목명": "경영통계학",
                        "강의 시간": "3시간",
                        "학점": 3,
                        "내용": "통계학의 기본개념과 방법론의 소개, 확률과 표본의 기초이론, 통계학 추정방법, 가설의 검증, 상관관계, 회귀방정식과 시계열분석을 내용으로 한다. (경제통계학, 통계학입문으로 대체할 수 있으며 이 중에서 한 과목만을 학점이수로 인정하고, 수학 및 컴퓨터공학을 전공하는 학생은 수강을 불허한다.)"
                    },
                    "MGT2003": {
                        "과목 코드": "MGT2003",
                        "과목명": "회계학원론",
                        "강의 시간": "3시간",
                        "학점": 3,
                        "내용": "기업경영의 언어라고 할 수 있는 회계정보를 작성하는 데에 사용되는 회계개념, 회계원칙과 회계정보 처리과정의 최종 산물인 재무제표를 작성하기 위하여 사용되는 회계기법의 기본원리와 회계장부의 구조를 공부한다."
                    },
                    "MGT3001": {
                        "과목 코드": "MGT3001",
                        "과목명": "조직행동이론",
                        "강의 시간": "3시간",
                        "학점": 3,
                        "내용": "최근에 개발된 행동과학의 의사결정이론에 대한 통찰력을 배양하려는 것으로 전통적인 경영관리론의 개념과 내용의 개관, 발전되고 있는 경영과학 이론의 구체화 및 행동과학의 개념·이론 등을 최고 경영자의 입장에서 다룬다."
                    },
                    "MGT3002": {
                        "과목 코드": "MGT3002",
                        "과목명": "경영정보시스템",
                        "강의 시간": "3시간",
                        "학점": 3,
                        "내용": "기업 경영정보시스템의 분석 및 설계에서 이용되는 개념에 대한 이해 및 방법을 소개한다. 그 주요 내용으로는 경영정보시스템 계획, 시스템 개발 전략, 시스템 분석 및 설계방법, 파일설계 그리고 비용추정 및 통제이다. 기업의 환경 및 업무활동을 분석하고 상황에 맞는 경영정보시스템을 설계하는 방법을 배운다."
                    },
                    "MGT3003": {
                        "과목 코드": "MGT3003",
                        "과목명": "운영관리",
                        "강의 시간": "3시간",
                        "학점": 3,
                        "내용": "기업 경영의 생산 기능을 기업목적 및 경영정책에 대응하여 어떻게 합리적으로 수행하고 생산 활동의 합리화를 기할 것인가를 경영관리자의 입장에서 공부한다. 그 내용에는 공정관리, 품질관리, 작업관리, 설비관리, 운반관리, 재고관리 등이 포함된다."
                    },
                    "MGT3004": {
                        "과목 코드": "MGT3004",
                        "과목명": "재무관리",
                        "강의 시간": "3시간",
                        "학점": 3,
                        "내용": "기업의 재무활동에 관한 기본적인 이론과 기법을 습득하게 함을 목적으로 하며, 그 주요 내용은 투자결정, 자금조달 결정 및 배당정책을 다룬다."
                    },
                    "MGT3005": {
                        "과목 코드": "MGT3005",
                        "과목명": "관리회계",
                        "강의 시간": "3시간",
                        "학점": 3,
                        "내용": "경영자가 계획과 통제기능을 효과적으로 수행하기 위하여 필요한 회계정보를 작성하는 데에 사용하는 기초개념 및 기법을 공부하고, 회계정보의 활용방법과 활용시 고려되어야 할 제반 요인들을 개괄적으로 검토한다.",
                        "선수과목": "MGT2003"
                    },
                    "MGT3006": {
                        "과목 코드": "MGT3006",
                        "과목명": "마케팅원론",
                        "강의 시간": "3시간",
                        "학점": 3,
                        "내용": "기업경영의 마케팅 기능을 연구하는 원론과목으로서 시장경제, 시장 환경과 조건 등 마케팅활동에 영향을 주는 제 요소를 이해시키고 이에 적합한 마케팅 도구인 시장조사, 제품, 가격, 판매경로, 물적 유통, 판매촉진과 광고, 판매원관리 및 판매조직 등의 적용을 연구한다."
                    },
                    "MGT3007": {
                        "과목 코드": "MGT3007",
                        "과목명": "국제경영론",
                        "강의 시간": "3시간",
                        "학점": 3,
                        "내용": "상품, 용역, 기술, 자본, 인력의 국제적 이전에 관련된 기업의 국제 경영활동을 다룬다. 특히 국제경영환경, 기업의 국제화 전략 및 국제경영의 부분별 제 전략을 중점적으로 연구한다."
                    },
                    "MGT3008": {
                        "과목 코드": "MGT3008",
                        "과목명": "전공진로설계I",
                        "강의 시간": null,
                        "학점": 0,
                        "내용": "학생들은 본 교과를 통해 지도교수로부터 전공 진로 관련 상담을 받을 수 있으며, 해당 전공 출신 선배의 진학/취업/진로 등 사례 등을 통해 자기 주도적 계획을 설계할 수 있다."
                    },
                    "MGT4101": {
                        "과목 코드": "MGT4101",
                        "과목명": "경영전략시뮬레이션",
                        "강의 시간": "3시간",
                        "학점": 3,
                        "내용": "본 과목에서는 학생들이 경영전략 모의게임에 참여함으로써 학부에서 학습한 필수교과목들의 내용을 통합하여 기업의 전략도출 및 실행에 연계시키는 방법에 대해서 학습하고자 한다. 모의게임 학습 및 사례분석을 통하여 학생들은 전략적 의사결정과 기업 성과 간의 관계에 대해서 이해할 수 있게 된다.",
                        "선수과목": "MGT4102"
                    },
                    "MGT4102": {
                        "과목 코드": "MGT4102",
                        "과목명": "경영전략",
                        "강의 시간": "3시간",
                        "학점": 3,
                        "내용": "변화가 심한 경영환경에서 특정 기업이 어떻게 다른 기업보다 우월한 성과를 거두는지에 대한 학문적 분석의 틀을 제공한다. 환경변화와 전략 경영의 의의, 산업구조분석, 가치사슬분석, 기업 자원, 능력 및 기업핵심역량의 분석, 전략적 대안의 개발, 경쟁우위의 분석, 전략적 제휴, 인수합병전략, 기업의 혁신전략 등을 다룬다."
                    },
                    "MGT4103": {
                        "과목 코드": "MGT4103",
                        "과목명": "조직구조와 전략 (구 조직 이론)",
                        "강의 시간": "3시간",
                        "학점": 3,
                        "내용": "관리과정에 대한 행동 과학적 접근법이다. 그 내용으로서는 목표의 설정, 정책수립, 계획과 통제, 직무의 배분, 권한의 이양, 환경의 변화와 이와 관련된 관리적 문제, 조직의 효율성으로 구성되어 있다."
                    },
                    "MGT4104": {
                        "과목 코드": "MGT4104",
                        "과목명": "리더쉽 이론",
                        "강의 시간": "3시간",
                        "학점": 3,
                        "내용": "조직구성원의 직무수행을 조직목표로 유도해나가기 위한 촉진통합기능으로서 리더십을 이해하려 한다. 그 주된 내용은 동기화과정, 의사결정 과정, 협력과정 속에서 갈등과 이를 해소하기 위한 리더십의 역할에 관하여 연구한다.",
                        "선수과목": "MGT3001"
                    },
                    "MGT4105": {
                        "과목 코드": "MGT4105",
                        "과목명": "기업윤리",
                        "강의 시간": "3시간",
                        "학점": 3,
                        "내용": "급변하는 고도의 기술 및 산업화 과정과 함께 기업윤리의식과 사회적 책임이 절실히 요구되고 있다. 경영학도로서 기업의 인간화를 위한 준비로 기업윤리의 철학적 배경 및 이론과 사례연구를 통하여 기업윤리의 가치관 정립을 목적으로 한다."
                    },
                    "MGT4106": {
                        "과목 코드": "MGT4106",
                        "과목명": "인적자원관리",
                        "강의 시간": "3시간",
                        "학점": 3,
                        "내용": "인력의 효율적 개발이나 활용뿐 아니라 모든 조직에 있어 구성원 스스로 각기 조직목표 추구를 위해 기꺼이 기여할 수 있도록 촉구하기 위한 각종 이론, 정책 및 관행 등을 검토 분석하며 특히 고용관계를 중심과제로 다룬다."
                    },
                    "MGT4107": {
                        "과목 코드": "MGT4107",
                        "과목명": "노사관계론",
                        "강의 시간": "3시간",
                        "학점": 3,
                        "내용": "산업사회에서의 노동문제를 살펴보고 노동3권인 근로자 단결권, 교섭권, 행동권과 관련된 근로자, 사용자, 정부간의 상호작용 및 제도를 검토한다. 이와 관련하여 노사관계학, 노동문제와 노동운동, 노동관계법, 노동조합조직, 단체교섭, 파업, 국제비교노사관계 등의 주제를 다룬다."
                    },
                    "MGTG109": {
                        "과목 코드": "MGTG109",
                        "과목명": "기업지배구조와 기업전략",
                        "강의 시간": "3시간",
                        "학점": 3,
                        "선수과목": "MGT4102",
                        "내용": "기업지배구조의 다양한 주제의 학습과 글로벌 기업들의 실제 사례연구를 통해 학생들이 기업의 전략 및 성과에 직접적인 영향을 미치는 기업지배구조의 중요성과 역량을 이해할 수 있도록 하는 것을 목표로 한다. 또한, 이를 통해 기업과 시장에 대한 학생들의 통찰력을 높여 학생들이 효과적인 경영자가 되기 위한 능력을 함양시키는 것을 목표로 한다."
                    },
                    "MGT4110": {
                        "과목 코드": "MGT4110",
                        "과목명": "기업윤리와 실천적 경영인재",
                        "강의 시간": "3시간",
                        "학점": 3,
                        "내용": "본 교과목은 학생들이 기업과 경영자의 도덕적 책임은 무엇인지를 인식하도록 도울 것이며, 미래에 책임 있는 실천적 경영인재로 성장하도록 가치관에 변화를 주고자한다."
                    },
                    "MGT4201": {
                        "과목 코드": "MGT4201",
                        "과목명": "의사결정론",
                        "강의 시간": "3시간",
                        "학점": 3,
                        "선수과목": "MGT2002",
                        "내용": "올바른 의사결정은 기술(art)과 과학(science)의 조화를 통하여 이루어진다. 본 과목에서는 의사결정의 기본 개념과 절차를 이해함과 동시에 개인 및 조직의 의사결정을 합리화하기 위한 접근방식을 선별하여 학습한다. 또한 불확실한 상황에서 판단의 질을 개선할 수 있는 방법과 의사결정의 윤리적 측면에 대해서도 논의한다."
                    },
                    "MGT4202": {
                        "과목 코드": "MGT4202",
                        "과목명": "통계자료분석",
                        "강의 시간": "3시간",
                        "학점": 3,
                        "선수과목": "MGT2002",
                        "내용": "통계 자료의 분석을 위한 다양한 방법론의 습득을 목표로 한다. 통계 자료의 기본적인 표현 방법을 비롯하여 적합도 검정, 회귀 분석, 분산분석 및 시계열 자료 분석 등의 내용을 학습한다. 다양한 과제 및 사례를 통하여 이러한 방법론의 적용을 연구한다."
                    },
                    "MGT4203": {
                        "과목 코드": "MGT4203",
                        "과목명": "경영과학",
                        "강의 시간": "3시간",
                        "학점": 3,
                        "선수과목": "MGT2002",
                        "내용": "경영 관리자가 다양한 의사결정 문제를 합리적으로 해결하기 위해 갖추어야 할 과학적 기법들을 습득하고 이를 활용하도록 함으로써 경영문제 해결 능력과 과학적인 사고력을 배양하도록 한다. 본 과목에서 토의하는 과학적 의사결정기법들이 경영학의 여러 분야에서 발생하는 문제들에 어떻게 적용될 수 있으며, 이를 통해 합리적인 의사결정이 어떻게 도출될 수 있는지에 중점을 둔다."
                    },
                    "MGT4204": {
                        "과목 코드": "MGT4204",
                        "과목명": "시뮬레이션",
                        "강의 시간": "3시간",
                        "학점": 3,
                        "선수과목": "MGT2002",
                        "내용": "컴퓨터 시뮬레이션은 복잡한 경영문제의 해결과 불확실한 상황분석을 위해 필요한 시스템 분석 접근방법이다. 시뮬레이션의 제반 개념을 습득하고 이를 다양한 경영문제에 직접 활용하도록 함으로써 시스템 분석능력과 문제해결 능력을 제고하도록 한다. 시뮬레이션 실험도구로는 스프레드시트 프로그램(spreadsheet program)을 이용한다."
                    },
                    "MGT4205": {
                        "과목 코드": "MGT4205",
                        "과목명": "계량경영분석모형 최신주제 및 사례연구",
                        "강의 시간": "3시간",
                        "학점": 3,
                        "선수과목": "MGT2002",
                        "내용": "계량경영분석모형 관련 최신 사례 및 학문적 이슈들을 심화학습 함으로써 새로운 계량모형 패러다임을 이해하고 경영과학문제 해결 능력을 증진시키는 것을 목적으로 한다."
                    },
                    "MGT4206": {
                        "과목 코드": "MGT4206",
                        "과목명": "경영환경에서의 시계열자료 분석과 예측",
                        "강의 시간": "3시간",
                        "학점": 3,
                        "선수과목": "MGT2002",
                        "내용": "시계열 자료 분석을 위한 기초 통계 이론을 습득하고 다양한 시계열분석 방법론을 학습하여 정확한 예측 및 분석능력을 획득하는 것을 주요 목표로 한다. 학습하고자 하는 방법론은 decomposition 모델, ARIMA 모델과 이의 변형 방법론, GARCH 모델, Spectral 분석, longitudinal 분석, 다양한 시계열 자료에서의 리스크 측정 방법을 학습한다."
                    },
                    "MGT4207": {
                        "과목 코드": "MGT4207",
                        "과목명": "BA 인공지능",
                        "강의 시간": "3시간",
                        "학점": 3,
                        "내용": "서포트벡터기계(SVM), 심층신경망(DNN), 재귀신경망(RNN), 자기암호화(Auto-Encoder), 적대적생성망(GAN), 심층신경망(DQN), 버트(BERT) 등, 최신 인공지능 및 기계학습과 관련된 방법들에 대하여 살펴본다. 먼저 이 방법들의 기저에 자리 잡은 공통적인 원리를 살펴봄으로써, 각 방법들을 통합적으로 이해할 수 있는 틀을 제공하고, 각 방법들의 응용 사례를 검토하여, 경영환경에 적용할 수 있는 능력을 배양한다."
                    },
                    "MGT4208": {
                        "과목 코드": "MGT4208",
                        "과목명": "웹데이터수집과텍스트분석(캡스톤디자인)",
                        "강의 시간": "3시간",
                        "학점": 3,
                        "내용": "웹에서 텍스트 형식을 비롯한 다양한 데이터를 수집하는 방법을 학습하고, 수집한 텍스트 형식의 데이터를 분석하는 방법을 학습한다. 토근, 코퍼스, 단어-문서 행렬, tf-idf 등에 대한 개념을 학습하고, 감성어 사전 및 문서레이블에 기반한 감성분석, 군집분석, 토픽 모델 등을 학습한다. Word2Vec, BERT, GPT 등 언어 모델의 활용 방법을 학습한다."
                    },
                    "MGT4221": {
                        "과목 코드": "MGT4221",
                        "과목명": "경영과 정보기술",
                        "강의 시간": "3시간",
                        "학점": 3,
                        "내용": "이 과목은 기존의 정보기술을 소개하고 실습하는 과목이다. 주로 OA와 관련된 프레젠테이션 그래픽스, 스프레드시트, 워드프로세스, 데이터베이스를 실습하게 되며, 또한 e-비즈니스를 위한 웹사이트를 구축하고자 한다. 홈페이지를 위해 HTML을 기반으로 최신 웹사이트 기술을 소개하고 팀별로 산업을 선정한 후 적당한 콘텐츠와 서비스를 구상해 사이트를 구축하도록 한다."
                    },
                    "MGT4222": {
                        "과목 코드": "MGT4222",
                        "과목명": "모바일 통신경영",
                        "강의 시간": "3시간",
                        "학점": 3,
                        "내용": "오늘날 모바일 통신은 우리 생활에 밀접한 관련성을 가지고 있다. 업무를 수행하면서도 일상생활을 하면서도 한시라도 통신기기 없이는 생활할 수 없는 환경이 되어 버린지 오래다. 이에 휴대폰으로 대표되고 있는 통신시장의 생태계를 학습하고 이를 효과적으로 활용하기 위한 학습이 요구된다. 그러므로 본 과목에서는 모바일 통신시장의 mega trend를 파악하고 향후 어떻게 전개될 것인가를 예측하고 이를 통해 새로운 비즈니스 모델을 개발할 수 있도록 지혜를 학생들에게 제공하고자 한다. 특히 모바일 통신기기의 원리를 이해함으로써 보다 효과적인 제품과 서비스의 개발/판매 전략을 수립함에 일조하고자 한다."
                    },
                    "MGT4223": {
                        "과목 코드": "MGT4223",
                        "과목명": "정보기술과 글로벌소셜비즈니스모델(캡스톤디자인)",
                        "강의 시간": "강의 3시간",
                        "학점": "3학점",
                        "내용": "비전과 비즈니스 리엔지니어링, 전사적 품질 경영, 정보 공학 방법론을 컴퓨터 및 통신 기술의 신속성과 유연성을 이용하여 업무 흐름과 조직 구조를 획기적으로 변형시키고, 급변하는 환경 속에서 국내 기업들이 이에 능동적으로 대처할 수 있도록 하는 내용을 배운다."
                    },
                    "MGT4224": {
                        "과목 코드": "MGT4224",
                        "과목명": "디지털 플랫폼 비즈니스",
                        "강의 시간": "강의 3시간",
                        "학점": "3학점",
                        "내용": "성공적인 디지털 플랫폼 비즈니스를 기획, 설계, 실행하기 위해 필요한 이론적 배경과 경영전략에 대해 학습한다. 다루게 될 주요 내용은 플랫폼 경제의 이론적 배경, 성공적인 디지털 플랫폼 비즈니스를 구현하기 위한 기술적 요소, 산업에서 진화하는 새로운 디지털 플랫폼 비즈니스 모델 평가 및 관련된 사례연구를 포함한다. 이를 통하여 빠르게 변화하는 플랫폼 생태계의 동향과 디지털 플랫폼 비즈니스의 중요한 기술적 트렌드를 이해하고 기업환경에 적용하는 능력을 배양하는 것을 목적으로 한다."
                    },
                    "MGT4225": {
                        "과목 코드": "MGT4225",
                        "과목명": "전사적 자원관리 소프트웨어 활용",
                        "강의 시간": "강의 3시간",
                        "학점": "3학점",
                        "내용": "전사적 자원관리의 대표적인 소프트웨어인 SAP 핵심모듈을 강의한다. 전반부에서는 SAP 소프트웨어의 구성 및 구축시 고려사항을, 후반부에서는 SAP 프로그램을 활용하여 실적적으로 실습을 진행한다. 수강생들이 본 과정을 학습하게 된다면 기업체에서 바로 활용할 수 있는 지식을 함양하는데 도움이 되리라 판단된다. 따라서 학생들에게 기업실무에 친화적인 내용을 통해 사회진출을 용이하도록 돕고자 한다."
                    },
                    "MGT4226": {
                        "과목 코드": "MGT4226",
                        "과목명": "빅데이터와 비즈니스 모델",
                        "강의 시간": "강의 3시간",
                        "학점": "3학점",
                        "내용": "본 과목은 BI를 이용하여 기업 운영을 통해 발생하는 데이터를 수집 및 가공하여 이를 의미 있는 비즈니스 지식으로 전환하여 빠르고 정확한 의사결정을 지원하는 도구 및 전략을 다룬다. 즉 기업이 갖고 있는 대량의 정형 또는 비정형의 데이터로부터 패턴, 지식, 가치를 추출하고 그 결과를 분석, 응용하는 내용을 다룬다. 다양한 종류의 빅데이터 분석을 통해 고객의 성향과 행동을 정확하게 예측할 수 있는 기법을 배운다. 주요 빅데이터 분석 기법과 각 기법이 응용된 사례와 함께 웹 마이닝, 오피니언마이닝, 소셜 네트워크 분석 등의 실습, 응용이 다루어진다."
                    },
                    "MGT4227": {
                        "과목 코드": "MGT4227",
                        "과목명": "디지털변혁과 비즈니스모델 혁신",
                        "강의 시간": "강의 및 실습 3시간",
                        "학점": "3학점",
                        "내용": "이 과목에서는 조직 내 지식 자원의 창출 및 공유 활동을 확산시키고 통합·관리함으로써 조직의 성과를 향상 시키고 지속적인 경쟁우위를 추구하는 경영 패러다임으로서의 지식 경영과, 이를 통해 만들어지는 서비스 혁신의 유형과 성과에 대해 학습한다."
                    },
                    "MGT4229": {
                        "과목 코드": "MGT4229",
                        "과목명": "미래창업을 위한 창의성과 창의경영",
                        "강의 시간": "강의 3시간",
                        "학점": "3학점",
                        "내용": "본 과목은 미래의 사회, 경제, 정치, 기술 등에 대한 내용과 함께 미래 창업과 창의경영에 관하여 배운다. 또한 델파이, 시나리오 기법과 같은 전통적인 미래 예측 기법과 함께 최신 예측 기법인 빅데이터 기법을 이용한 미래 예측 방법론을 배운다. 마지막으로 미래에 있어서 가장 중요한 키워드인 ‘미래와 창의성’ 그리고 ‘미래와 생존’에 관한 주요 이슈에 관하여 배운다."
                    },
                    "MGT4230": {
                        "과목 코드": "MGT4230",
                        "과목명": "비즈니스 앱 개발",
                        "강의 시간": "강의 3시간",
                        "학점": "3학점",
                        "내용": "본 과목에서는 오늘날 디지털 시대에서 창업의 가장 핵심이 되고 있는 스마트폰 앱을 개발하는 내용을 배운다. 과목의 주요 내용은 안드로이드 기반 앱 개발 기법에 관한 이론과 앱 프로그램 실습으로 이루어지며, 앱 개발에 필요한 기초 필수 프로그램 지식인 자바 프로그램을 함께 다룬다."
                    },
                    "MGT4231": {
                        "과목 코드": "MGT4231",
                        "과목명": "인공지능과경영모델",
                        "강의 시간": "강의 3시간",
                        "학점": "3학점",
                        "내용": "본 과목은 인공지능에 관련된 이론, 사례, 실습으로 구성이 된다. 인공지능과 관련된 주요 이론과 함께 인공지능이 어떻게 경영학의 각 분야에 응용이 되는 지의 사례를 공부한다. 또한 인공신경망과, 딥러닝 실습 프로그램으로 인공지능 모델을 만드는 실습이 병행이 된다."
                    },
                    "MGT4241": {
                        "과목 코드": "MGT4241",
                        "과목명": "기술경영과 기술사업화",
                        "강의 시간": "강의 3시간",
                        "학점": "3학점",
                        "내용": "기업의 전략적 기술경영 및 사업화를 위한 제품 및 서비스의 개발, 생산, 판매의 전 과정을 경영학적 관점에서 이론적 개념과 사례를 중심으로 학습한다. 본 교과목을 통해 기술에 가치를 부여하고 시장성을 분석하여 수익창출을 하는 일련의 사업화 과정을 체계적으로 분석하고 관리하는 능력을 함양시키는 기회를 갖는다."
                    },
                    "MGT4243": {
                        "과목 코드": "MGT4243",
                        "과목명": "경영품질의 이해",
                        "강의 시간": "강의 3시간",
                        "학점": "3학점",
                        "내용": "경영품질이란 경영진의 리더십과 정보기술을 기반으로 경영시스템 핵심 요소의 질적 수준을 개선/혁신하여 경영성과를 극대화 시키는 것이다. 경영품질은 경영시스템 핵심요소의 질적 수준을 지속적으로 개선/혁신하는데 초점을 맞추고 있다. 경영시스템 핵심요소에는 리더십, 사회적 책임, 전략, 고객만족, 정보 분석, 인적자원, 프로세스 등이 포함된다. 본 과목에서는 이러한 경영시스템의 핵심요소를 월드 클래스 수준으로 높이는 접근방법과 전개를 다룬다. 특히 세계적인 경영품질모형으로 활용되고 있는 미국 국가품질상의 말콤볼드리지 경영품질모형을 학습한다."
                    },
                    "MGTG244": {
                        "과목 코드": "MGTG244",
                        "과목명": "로지스틱스와 생산전략",
                        "강의 시간": "강의 3시간",
                        "학점": "3학점",
                        "내용": "생산체제의 설계와 운영에 관련된 문제를 최고 경영층의 관점에서 파악하고 분석함으로써 주요 생산결정이 조직전체의 관점에서 효과적인 것이 될 수 있도록 연구한다. 이론적 배경과 그에 따른 사례연구를 적절히 배합함으로써 실제적인 감각을 개발하는 것을 목적으로 한다.",
                        "비고": "선수과목：MGT3003"
                    },
                    "MGT4245": {
                        "과목 코드": "MGT4245",
                        "과목명": "정보화시대의 기업경영과 혁신",
                        "강의 시간": "강의 3시간",
                        "학점": "3학점",
                        "내용": "정보화시대를 맞이하여 변화되고 있는 기업 경영의 새로운 조류에 관한 토의와 더불어 이러한 새로운 경영 관행이 어떻게 실제 경영에 실천될 수 있는지를 연구한다. 사례연구와 강의가 병행된다."
                    },
                    "MGT4246": {
                        "과목 코드": "MGT4246",
                        "과목명": "서비스기업 운영관리론",
                        "강의 시간": "3시간",
                        "학점": "3학점",
                        "내용": "제품의 제조와는 달리 서비스를 제공하는 기업들은 독특한 특성을 갖는다. 서비스기업은 인간 지향적이며, 일반적으로 고객들은 서비스과정에 참여하고, 흔히 종업원과 시설에 직접적인 상호작용을 갖는다. 따라서 서비스기업의 운영관리를 운영뿐만 아니라 전략, 기술, 마케팅, 그리고 조직의 통합적 관점에서 연구한다."
                    },
                    "MGT4247": {
                        "과목 코드": "MGT4247",
                        "과목명": "공급체인관리와 e-Business",
                        "강의 시간": "3시간",
                        "학점": "3학점",
                        "내용": "인터넷의 급격한 확산으로 e-Business시대가 전개되고 있다. e-Business는 신속성과 융통성을 가지고 개별 고객의 주문에 따라 신속하게 공급하는 mass customization으로 발전해 나갈 것이다. 공급업자관리, JIT생산, 조달시간 관리, 신속대응시스템 조직구조, 고객서비스 등의 개념과 함께 구매, 주문, 설계, 제조, 유통 등이 cyberspace상에서 어떻게 이루어지는지를 사례를 중심으로 연구한다."
                    },
                    "MGT4248": {
                        "과목 코드": "MGT4248",
                        "과목명": "비즈니스 프로세스 관리",
                        "강의 시간": "3시간",
                        "학점": "3학점",
                        "내용": "기업운영관리의 기초가 되는 비즈니스 프로세스의 구성요인들을 이해하고, 프로세스관리상의 문제점을 파악하고 해결할 수 있는 방법을 다룬다. 다루게 될 주제는 프로세스의 구성요인 이해, 수요예측, 다품종의 재고관리, 물류와 유통, 구매자와 공급자관리 등으로서, 기업사례분석을 통해 문제점의 발견과 토의, 분석, 해법의 제시 등의 과정을 거치면서 문제해결능력을 고양하고 최근의 이슈들을 파악하는 기회를 갖는다."
                    },
                    "MGT4249": {
                        "과목 코드": "MGT4249",
                        "과목명": "종합물류론",
                        "강의 시간": "3시간",
                        "학점": "3학점",
                        "내용": "새로운 차원의 경쟁력의 원천으로 떠오르고 있는 물류의 전반적인 것들을 이해시키고 상품과 서비스의 흐름에 대한 시스템, 효과적인 물류관리를 통한 원가절감 그리고 마케팅 능력 향상방안에 관한 연구를 복합운송에 초점을 맞추어 학습한다."
                    },
                    "MGT4250": {
                        "과목 코드": "MGT4250",
                        "과목명": "해상운송론",
                        "강의 시간": "3시간",
                        "학점": "3학점",
                        "내용": "상품수송에 따른 해상운송, 보관 및 저장에 대한 이론적 배경과 실제 운영에 있어서 문제가 되는 각종 국제규정 및 국내해상운송규정 등을 상세히 다룬다."
                    },
                    "MGT4251": {
                        "과목 코드": "MGT4251",
                        "과목명": "프로세스 수익경영",
                        "강의 시간": "3시간",
                        "학점": "3학점",
                        "내용": "수익과 성과를 극대화하기 위해 프로세스의 용량, 자원, 재고 및 제품 가용성, 그리고 수요관리와 가격책정과 관련된 최적 전략과 기법들에 대해 체계적으로 학습한다. 이론적 접근과 더불어 다양한 기업 사례 연구와 의사결정 방법론의 실습이 병행된다."
                    },
                    "MGT4301": {
                        "과목 코드": "MGT4301",
                        "과목명": "투자론",
                        "강의 시간": "3시간",
                        "학점": "3학점",
                        "선수과목": "MGT3004",
                        "내용": "증권투자에 필요한 기초이론 및 기법의 습득을 그 목적으로 한다. 그 주요내용으로는 증권시장, 증권가치 평가, 포트폴리오 관리 및 성과측정 등을 다룬다."
                    },
                    "MGT4302": {
                        "과목 코드": "MGT4302",
                        "과목명": "기업재무론",
                        "강의 시간": "3시간",
                        "학점": "3학점",
                        "선수과목": "MGT3004",
                        "내용": "기업의 재무활동에 있어서 주요 의사결정인 투자의사결정, 자금조달의사결정, 배당 의사결정 등에 관하여 학습하며 또한 M&A 등과 같은 이슈들에 관해서 학습한다."
                    },
                    "MGT4303": {
                        "과목 코드": "MGT4303",
                        "과목명": "파생상품론",
                        "강의 시간": "3시간",
                        "학점": "3학점",
                        "선수과목": "MGT3004",
                        "내용": "선물, 옵션, 스왑 등 파생상품에 대한 가격결정, 상품의 특징, 거래소 등을 학습한다. 옵션가격결정 이론과, 옵션을 활용한 고급 투자전략 및 응용에 대해서도 논의한다."
                    },
                    "MGT4304": {
                        "과목 코드": "MGT4304",
                        "과목명": "포트폴리오관리",
                        "강의 시간": "3시간",
                        "학점": "3학점",
                        "선수과목": "MGT3004",
                        "내용": "본 과목에서는 포트폴리오 관리와 관련된 기법의 실제적 적용을 중심으로 다룬다. 구체적으로 위험/수익률의 관계, 효율적 증권선, 투자자의 투자목적에 따른 포트폴리오의 구성과 최적화기법, 포트폴리오 성과의 측정과 평가 등에 대해서 배운다."
                    },
                    "MGT4306": {
                        "과목 코드": "MGT4306",
                        "과목명": "금융리스크관리",
                        "강의 시간": "3시간",
                        "학점": "3학점",
                        "선수과목": "MGT3004, MGT2002",
                        "내용": "급속한 세계화의 진전과 함께 경영환경은 다양한 불확실성에 노출되고 있으며, 이러한 불확실성에 의한 리스크의 증대는 기업의 생존과 직결된다. 특히 금융회사들의 경우 보다 복잡하고 어려운 리스크에 노출되고 있다. 따라서 금융회사들이 직면할 수 있는 신용리스크, 시장리스크, 운영리스크, 유동성리스크, 그리고 법적리스크 등의 개념, 측정방법, 과학적 관리방법, 그리고 기업 가치와의 연계 등에 대해 체계적으로 분석하고 연구하는 것을 목적으로 한다."
                    },
                    "MGT4307": {
                        "과목 코드": "MGT4307",
                        "과목명": "금융기관론",
                        "강의 시간": "3시간",
                        "학점": "3학점",
                        "선수과목": "MGT3004",
                        "내용": "기업과 저축인을 연결해주는 금융기관, 비금융기관 및 금융시장의 조직, 구조 및 기능과 자금의 흐름을 제도적 측면과 기능적 측면에서 연구한다."
                    },
                    "MGT4308": {
                        "과목 코드": "MGT4308",
                        "과목명": "벤처 캐피탈과 투자분석(캡스톤디자인)",
                        "강의 시간": "3시간",
                        "학점": "3학점",
                        "선수과목": "MGT3004",
                        "내용": "신생기업의 벤처금융을 통한 자금조달프로세스에 있어서의 다양한 주제를 학습한다. 먼저, 다양한 유형의 벤처 금융의 장점과 단점에 대해 논의하고 벤처 캐피탈 금융 계약에 대해 연구한다. 그리고 벤처 금융에 있어서의 가치 평가 방법을 소개하고 피 투자 기업으로부터의 자금 회수 과정을 논의한다. 마지막으로, 기업자금조달을 위한 투자은행업무 및 기업공개프로세스를 분석한다."
                    },
                    "MGT4309": {
                        "과목 코드": "MGT4309",
                        "과목명": "고급재무이론",
                        "강의 시간": "3시간",
                        "학점": "3학점",
                        "선수과목": "MGT3004",
                        "내용": "현대 재무경제학(financial economics)을 구성하는 주요 개념 및 이론들을 수학적으로 접근한다. 재무 관련 과목들에서 간단하게 소개되었을 기대효용이론, CAPM, APT, 상태선호이론, (이자율 파생 상품도 포함하는) 파생상품 평가이론 등을 학습한다. 필요한 수학적 기법은 본 강좌에서 충분히 설명된다."
                    },
                    "MGT4721": {
                        "과목 코드": "MGT4721",
                        "과목명": "가치평가 이론과 실무",
                        "학점": 3,
                        "강의 시간": "3시간",
                        "선수과목": [
                            "ECO2001",
                            "MGT2003",
                            "MGT2002",
                            "MGT3004",
                            "MGT4301",
                            "MGT4303"
                        ],
                        "내용": "재무론, 회계학, 경제학, 그리고 통계학에서 배운 지식을 종합적으로 응용하여 가치평가와 주식투자 과정에서의 제반 이슈를 논하고 투자 결정을 하는 계량적이고 구조적인 접근법을 학습한다. 할인현금흐름법과 상대가치평가법 등의 가치평가 방법을 적용하여 투자분석 프로젝트를 수행하여 실제 투자분석에서 직면하는 제반 문제를 토의한다."
                    },
                    "MGT4311": {
                        "과목 코드": "MGT4311",
                        "과목명": "금융실무",
                        "학점": 2,
                        "강의 시간": "2시간",
                        "선수과목": [
                            "MGT3004"
                        ],
                        "내용": "지난 30여 년 동안 금융의 현장에서 몸소 체험한 내용을 이번 강의를 통해 학생들에게 전수함으로써 미래의 잠재 금융인으로서 갖추어야 할 소양을 심어준다. 학생들이 우리 금융의 현 수준이 어느 정도이고 선진국이 되기 위해서 무엇이 필요한지를 생동감 있게 체득하게 하는 데 이 과목의 목표가 있다."
                    },
                    "MGT4312": {
                        "과목 코드": "MGT4312",
                        "과목명": "금융투자산업의 이해(캡스톤디자인)",
                        "학점": 3,
                        "강의 시간": "3시간",
                        "내용": "금융 투자시장 및 이를 둘러싼 환경이 급변하고 있는 상황에서 금융전문가를 초빙하여 현장에서 요구되고 있는 금융지식 및 실무지식 교육을 중점으로 강의한다."
                    },
                    "MGT4313": {
                        "과목 코드": "MGT4313",
                        "과목명": "벤처와 금융시장(캡스톤디자인)",
                        "학점": 3,
                        "강의 시간": "3시간",
                        "내용": "벤처와 그 자금을 조달하는 시장으로써의 자본시장과 금융시장에 대해 업계 현황과 전망, 향후 유망분야를 중심으로 강의를 통해 학생들로 하여금 창업 또는 기업 내에서의 프로젝트 및 사내창업능력을 고양시키고자 하는 데 이 과목의 목표가 있다."
                    },
                    "MGT4315": {
                        "과목 코드": "MGT4315",
                        "과목명": "재무와 지속가능사회",
                        "학점": 3,
                        "강의 시간": "3시간",
                        "내용": "재무, 금융 그리고 경제와 관련된 고전이나 최근의 베스트셀러를 원서로 읽고 토론한다. 아울러 이러한 주제의 배경이 되는 사회적, 생물학적, 윤리적 관점을 제시하는 책도 읽도록 한다. 분석적이고 기술적인 측면을 넘어서서, 재무를 인간의 삶과 사회와의 관계에서 더 깊이 생각해 보고자한다."
                    },
                    "MGT4316": {
                        "과목 코드": "MGT4316",
                        "과목명": "금융위기와 금융산업 혁신",
                        "학점": 3,
                        "강의 시간": "3시간",
                        "내용": "After each financial crisis, the financial industry has undergone fundamental structural reforms, so it is very important to understand how they occurred and through what mechanisms they affected the financial system including financial institutions. This course provides students with an overview of the major financial crises of the past. We will also study several important causes of those crises and discuss how the government responded to those crises by reforming the financial systems."
                    },
                    "MGT4331": {
                        "과목 코드": "MGT4331",
                        "과목명": "보험학원론",
                        "학점": 3,
                        "강의 시간": "3시간",
                        "내용": "개인, 기업, 사회가 직면하는 리스크에 대한 종합적 이해와 리스크관리 및 보험제도의 기초적 이론과 실무를 공부한다. 리스크의 개념과 리스크관리의 기능 및 기법, 보험의 본질과 원리, 보험계약의 기본, 각종 보험제도의 내용 및 약관, 보험기업의 경영, 보험정책과 감독 등을 다룬다."
                    },
                    "MGT4332": {
                        "과목 코드": "MGT4332",
                        "과목명": "기업리스크 관리",
                        "학점": 3,
                        "강의 시간": "3시간",
                        "내용": "기업이 경영활동 과정에서 직면하는 각종 리스크에 대한 분석 및 관리방법을 이론과 실무를 병행하여 리스크관리의 기능과 역할, 리스크의 분석평가, 리스크의 측정, 리스크 관리기법, 기업의 리스크관리 프로그램 개방 등을 중점으로 강의한다."
                    },
                    "MGT4333": {
                        "과목 코드": "MGT4333",
                        "과목명": "생명보험",
                        "학점": 3,
                        "강의 시간": "3시간",
                        "내용": "생명보험제도의 기능과 역할 및 운영에 관한 전반적 내용을 이론과 실무를 병행하여 생명·건강·연금보험의 본질과 경제적 사회적 기능, 계약의 수리적 법률적 측면, 상품개발 및 요율산정, 마케팅기능, 계약심사기능, 투자기능, 재무관리기능, 감독이론과 정책 등을 중점으로 강의한다."
                    },
                    "MGT4401": {
                        "과목 코드": "MGT4401",
                        "과목명": "중급회계 Ⅰ",
                        "학점": 3,
                        "강의 시간": "3시간",
                        "선수과목": [
                            "MGT2003"
                        ],
                        "내용": "재무회계의 목적을 달성하기 위한 회계원칙을 개괄적으로 검토한 다음, 이들 원칙이 재무제표 구성요소의 평가에 실제로 어떻게 적용되는지를 공부한다. 회계원칙의 이해를 증진시키기 위하여 발생주의와 현금주의를 비교하고, 수익인식의 원칙을 세부적으로 검토하고 회계원칙의 실제 적용을 공부하기 위하여 유가증권, 수취채권, 투자자산, 재고자산, 고정자산, 사채 등 재무제표의 구성요소의 평가방법을 검토한다."
                    },
                    "MGT4402": {
                        "과목 코드": "MGT4402",
                        "과목명": "중급회계 Ⅱ",
                        "학점": 3,
                        "강의 시간": "3시간",
                        "선수과목": [
                            "MGT4401"
                        ],
                        "내용": "재무회계의 목적, 회계공준, 회계정보의 질적 속성, 회계원칙, 회계제약, 재무제표의 구성요소 등 재무회계개념의 골조를 구체적으로 검토하고 자산평가법, 대차대조표와 손익계산서 작성법을 공부한다. 또한 중급회계 Ⅰ에서 검토하지 못한 소유주 지분의 회계처리, 리스회계, 회계변경과 오류의 수정, 재무 상태변동표의 작성, 물가변동회계 등을 검토한다."
                    },
                    "MGT4403": {
                        "과목 코드": "MGT4403",
                        "과목명": "고급회계",
                        "학점": 3,
                        "강의 시간": "3시간",
                        "선수과목": [
                            "MGT4402"
                        ],
                        "내용": "연결회계의 중요성, 그 개념과 절차에 대한 이해와 구체적인 사례분석을 통해 재무회계 과목 중 최고급 과목으로서 연결회계와 관련된 제반 문제를 논리적으로 해결할 수 있는 능력을 갖추도록 한다."
                    },
                    "MGT4404": {
                        "과목 코드": "MGT4404",
                        "과목명": "원가회계",
                        "학점": 3,
                        "강의 시간": "3시간",
                        "선수과목": [
                            "MGT3005"
                        ],
                        "내용": "원가정보의 다각적인 목적을 검토하고 이들 목적을 달성하기 위하여 필요한 원가정보를 작성하고 응용하는 데에 사용되는 이론과 개념 및 기법을 연구한다."
                    },
                    "MGT4406": {
                        "과목 코드": "MGT4406",
                        "과목명": "세무회계",
                        "학점": 3,
                        "강의 시간": "3시간",
                        "선수과목": [
                            "MGT4402"
                        ],
                        "내용": "세무회계의 개념, 원칙을 검토하여 기업재무회계와 비교하여 이들의 차이점을 공부하고, 세무이행에 관련된 제반 제도, 소득세회계, 법인세회계, 부가가치세회계 등을 연구한다."
                    },
                    "MGT4407": {
                        "과목 코드": "MGT4407",
                        "과목명": "회계감사",
                        "학점": 3,
                        "강의 시간": "3시간",
                        "선수과목": [
                            "MGT4402",
                            "MGT4404"
                        ],
                        "내용": "회계감사의 목적, 가정, 개념과 감사인의 책임과 윤리를 검토하고 일반기준, 실시기준, 보고기준으로 분류되어 있는 감사기준과 이 기준에 의한 제반 감사 절차를 공부한다."
                    },
                    "MGT4615": {
                        "과목 코드": "MGT4615",
                        "과목명": "창업의이해(캡스톤디자인)",
                        "강의 시간": "3시간",
                        "학점": "3학점",
                        "내용": "창업의 이해는 창업프로세스와 스타트업의 국내 및 해외 성공 요인 및 이에 핵심적인 영향을 미치는 비즈니스 환경을 이해하고자 하는 학생들을 위한 수업이다. 성공적인 스타트업을 위해서는 창업기업의 우수성뿐만 아니라 대학, 공공기관, 기업 및 투자자 등을 포함한 창업생태계가 필수적이므로, 구체적인 창업 과정과 함께 전반적인 경영환경을 상호적으로 심도있게 논의하고자 한다."
                    },
                    "MGT4616": {
                        "과목 코드": "MGT4616",
                        "과목명": "글로벌 혁신 전략",
                        "강의 시간": "3시간",
                        "학점": "3학점",
                        "내용": "신기술 개발, 신상품 개발, 지식 창출 등 혁신은 기업의 생존과 성과에 직접적인 영향을 준다. 기술의 경쟁이 심화됨에 따라 기업은 혁신의 범주를 자국내로 한정하지 않고 해외 지식과 기술에 접근하고, 해외 인력을 활용함으로써 혁신 경쟁력을 높이고자 한다. 이에 본 수업은 혁신을 위한 방법으로써 해외 전략적 제휴, 해외 M&A, 해외 R&D 센터, 클러스터 등을 살펴본다. 기술벤처기업의 해외진출이 활발해지는 현실을 감안해 대기업의 혁신전략뿐만 아니라 벤처기업의 혁신을 위한 해외진출도 다룬다. 학습 방식으로는 다양한 혁신전략을 이론과 실제 경영 사례를 통해 이해한다."
                    },
                    "MGT4718": {
                        "과목 코드": "MGT4718",
                        "과목명": "이해관계자자본주의와ESG",
                        "강의 시간": "3시간",
                        "학점": "3학점",
                        "내용": "본 교과목은 기업을 둘러싼 다양한 이해관계자들에 대한 이해를 바탕으로 기업의 이해관계자들과 기업의 상호작용을 자세하게 살펴본다. 이를 통해서 최근 글로벌하게 부각되고 있는 ESG경영에 대한 이론과 사례들을 소개하고, ESG를 통하여 이해관계자 자본주의로 전환하게 되는 동인들에 대하여서도 학습한다."
                    },
                    "MGT4720": {
                        "과목 코드": "MGT4720",
                        "과목명": "IT시대의 사회인준비특강",
                        "강의 시간": "1시간",
                        "학점": "1학점",
                        "내용": "IT 분야의 실제 사례를 바탕으로 기업 및 산업에 대한 이해를 도모하고, 커뮤니케이션 스킬 및 테크트리 등 다양한 개념을 이론과 실무 측면에서 논의하여 기업 경영에 대해 전반적으로 학습하고자 한다."
                    },
                    "MGTG011": {
                        "과목 코드": "MGTG011",
                        "과목명": "기업재무",
                        "강의 시간": "3시간",
                        "학점": "3학점",
                        "내용": "현대재무이론의 기초 개념과 원리를 다룬다. 자산의 현재가치, 위험과 수익, 자본비용, 자산의 가치평가이론 등을 통해서 재무와 금융의 기초 원리를 습득한다."
                    },
                    "MGTG014": {
                        "과목 코드": "MGTG014",
                        "과목명": "인사조직",
                        "강의 시간": "3시간",
                        "학점": "3학점",
                        "내용": "본 과목은 기업의 경쟁우위의 원천으로서 사람의 중요성을 인식하고, 종업원을 효과적으로 관리하기 위한 관리자 및 조직 차원에서의 이슈를 다룬다. 관리자 차원의 이슈로는 조직내 사람의 행동에 대한 이해를 높이기 위해 개인, 집단 및 조직 차원의 행동에 대한 다양한 이론을 학습한다. 개인차, 동기부여, 의사결정, 의사소통, 리더십, 갈등관리 등이 주요 내용이다. 또한 조직차원에서 사람을 관리하기 위한 제도적 측면인 인사관리의 각 기능을 학습하게 된다. 인력계획, 선발, 평가, 보상, 교육훈련이 주요 학습내용이다."
                    },
                    "MGTG205": {
                        "과목 코드": "MGTG205",
                        "과목명": "재무제표분석(캡스톤디자인)",
                        "강의 시간": "3시간",
                        "학점": "3학점",
                        "내용": "본 강좌는 기업의 경영전략에 기초한 재무제표분석을 실시하여 기업 가치를 평가하는 방법을 소개한다. 본 강좌에서는 우선 재무제표를 개괄적으로 검토한 다음 회계정보를 이용한 기업가치 평가모형을 검토한다. 검토되는 모형은 주가이익비율, 주가순자산비율, 주가 현금 흐름비율과 같은 주가배수를 이용한 모형과 초과이익할인모형과 현금흐름할인모형이다. 그 다음 사례를 통하여 구체적으로 기업 경영전략 및 재무제표를 분석하여 기업 가치를 평가하는 절차를 세부적으로 검토한다."
                    },
                    "MGTG313": {
                        "과목 코드": "MGTG313",
                        "과목명": "소비자의사결정론",
                        "강의 시간": "3시간",
                        "학점": "3학점",
                        "내용": "마케팅에 대한 이해는 소비자의 구매의사결정 과정에 대한 정확한 이해에서 시작한다. 본 강의에서는 소비자 행동 중에서도 가장 핵심적인 부분이라고 할 수 있는 소비자들의 판단과 선택에 관한 연구들을 살펴본다. 이 코스에서는 소비자 의사결정에 관한 심리학적 접근을 토대로 하는 고전적 연구와 최신 연구들을 함께 살펴본다. 그 과정에서 수강생들은 기존 연구에 있어서의 갭을 발견해 냄으로써 이 분야에 새로이 기여할 수 있는 연구 아이디어를 얻어내고 이를 검증하기 위한 방법을 모색해보는 것을 이 강의의 목표로 한다."
                    },
                    "MGTG315": {
                        "과목 코드": "MGTG315",
                        "과목명": "메타버스가상시장과마케팅(캡스톤디자인)",
                        "강의 시간": "3시간",
                        "학점": "3학점",
                        "내용": "2000년대 이후 시장은 3대 본원기술, 즉 디지털화, 네트워크화, 그리고 AI의 영향으로 혁신을 거듭하고 있고, 지금껏 상상하지 못한 때로는 이해하기 어려운 혁신 시장의 성장을 지켜보고 있다. 본 과목은 2000년대 이후 새롭게 나타난 혁신 신시장이 궁극적으로는 가상 경제로 모두 집중하고 있음을 살펴보고자 한다. 이중 기업들이 가장 관심을 가지고 있는 핵심 기술(빅데이터, 플랫폼 비즈니스 모델, 블록체인, AR/VR)을 기반으로 만들어지고 있는 가상기술 기반 시장 (공유경제, 가상화폐 및 금융, 메타버스와 NFT) 를 이해하고, 이 시장에서 마케팅이 필요한 부분이 무엇인지를 살펴보고자 한다. 더 나아가, 이 혁신 시장에서 필요로 하는 마케팅 사이언티스트가 되기 위해 필요한 지식과 방법론을 공부하는 데 그 목적이 있다."
                    },
                    "MGTG509": {
                        "과목 코드": "MGTG509",
                        "과목명": "LSOM 최근주제연구1",
                        "강의 시간": "3시간",
                        "학점": "3학점",
                        "내용": "생산관리분야에서 최근에 발표된 논문이나 서적을 검토하여 이 분야의 최신이론이나 기법을 습득한다."
                    },
                    "MGTG603": {
                        "과목 코드": "MGTG603",
                        "과목명": "디지털트랜스포메이션과 비즈니스모델혁신세미나",
                        "강의 시간": "3시간",
                        "학점": "3학점",
                        "내용": "본 과목은 디지털기술로 인해 변화하는 기업경쟁패러다임과 기업 경쟁력을 결정하는 주요자원인 지식의 창출, 전파, 공유, 활용에 대한 이론적/실문적인 접근에 대해 학습한다. 또한 디지털트랜스포메이션과 지식프로세스에 기반을 두고 서비스 모델의 변화에 영향을 미치는 요소들에 대해 탐구하며, 궁극적으로는 비즈니스 모델 혁신의 의미와 이에 영향을 미치는 요소들에 대해 집중적으로 학습한다."
                    },
                    "MGTG610": {
                        "과목 코드": "MGTG610",
                        "과목명": "경영 데이터사이언스",
                        "강의 시간": "3시간",
                        "학점": "3학점",
                        "내용": "데이터사이언스 학문 분야가 발전하고, 자료를 수집 가공하고 정리하여 그 결과를 표출하는 과정이 고도화됨에 따라, 경영학의 각 분야에서 자료의 수집 가공 처리와 결과 표출을 위한 전문적인 기술을 습득할 필요성이 대두되었다. 이 과목에서는 R 과 Python 을 이용하여 대규모 자료를 습득 가공 표출하는 과정에 필요한 기술적 방법을 학습한다. R에서의 ggplot2, dplyr, dbplyr과 Python의 numpy, pandas, plotnine, dplython 등의 활용법을 학습하고, 대용량 데이터의 분산처리 기술을 학습하기 위하여, sparklyr 과 pyspark 사용법, 또 인터넷 자료를 습득하고 인터넷을 통하여 결과를 배포하기 위하여 필요한, selenium, shiny, beautifulsoup, Django 등의 사용법을 학습한다. Kaggle 데이터를 예제로 활용하는 방법으로 강의를 진행한다."
                    },
                    "MGTG613": {
                        "과목 코드": "MGTG613",
                        "과목명": "인공지능 자료분석",
                        "학점": 3,
                        "강의 시간": "3시간",
                        "내용": "심층신경망(DNN)과 강화학습(RL)을 포함한 인공지능 주요 방법들과 이의 경영활용을, 자료분석 입장에서 살펴본다. 다양한 인공지능 방법들의 의미와 활용방안을 살펴보게 된다. 인공지능 알고리즘의 이해를 돕기 위하여, 예제 자료를 중심으로 작업 목표를 설정하고, 이의 해결을 위하여, Python, R에서 작동하는 다양한 패키지들을 활용하는 방법으로 강의를 진행한다."
                    },
                    "MGTG704": {
                        "과목 코드": "MGTG704",
                        "과목명": "몬테칼로 시뮬레이션",
                        "학점": 3,
                        "강의 시간": "3시간",
                        "내용": "불확실한 상황 하에서의 의사결정을 위한 기법으로 기업에서 활용도가 높은 몬테칼로 시뮬레이션(Monte Carlo Simulation)의 개념과 방법, 그리고 적용과정에 대하여 논의한다. 실험도구로는 스프레드시트 프로그램과 시뮬레이션 전문 소프트웨어를 이용한다. 본 과목을 통하여 시뮬레이션의 중요성과 실행 방법, 그리고 시뮬레이션 결과의 실천 과정 등을 학습하게 된다."
                    },
                    "MGTG705": {
                        "과목 코드": "MGTG705",
                        "과목명": "시계열 자료분석과 예측",
                        "학점": 3,
                        "강의 시간": "3시간",
                        "내용": "경영 경제 관련 시계열 자료에 대한 다양한 통계 분석 방법론을 익히고, 실제 자료를 이용한 예측에 어떻게 적용할 것인지와 적용한 예측방법을 어떻게 평가하는지를 학습한다. 학습되어질 방법론은 시계열 분해모형, ARIMA, GARCH 모델, 극단치 자료분석, 스펙트럴 분석법 등이다."
                    },
                    "MGTG706": {
                        "과목 코드": "MGTG706",
                        "과목명": "회계/재무 정보 분석의 이해와 응용",
                        "학점": 3,
                        "강의 시간": "3시간",
                        "내용": "본 과목은 재무재표에 보고된 회계 정보를 이용하여 기업 성과 분석을 목적으로 한다. 회계원장 및 회계 정보의 데이터 구조를 이해하며 부정 적발, 분식 식별 등의 분석을 수행하며, 실무에서 사용되는 분석 방법을 이용하여 데이터 및 자동화 분석 방법 등을 실습한다."
                    },
                    "MGTG707": {
                        "과목 코드": "MGTG707",
                        "과목명": "ESG 세미나",
                        "학점": 3,
                        "강의 시간": "3시간",
                        "내용": "ESG(Environmental, Social and Governance)와 관련된 전반적인 주제들을 다룬다."
                    },
                    "MGTG807": {
                        "과목 코드": "MGTG807",
                        "과목명": "국제경영세미나",
                        "학점": 3,
                        "강의 시간": "3시간",
                        "내용": "이 과목은 국제경영학 입문과목으로서 기업의 국제경영활동에 대한 전반적인 이해를 돕기 위한 과목이다. 구체적으로 국제경영과 글로벌 기업의 개념, 시장의 글로벌화, 국제경영활동에 영향을 미치는 국제기업환경(경제적 환경, 문화적 환경, 법률적/정치적 환경), 무역, 해외직접투자, 국제경영 전략 및 국제경영 각론(국제마케팅, 국제재무, 국제생산, 국제인사)에 대한 소개가 이 과목의 목적이다."
                    },
                    "MGT4409": {
                        "과목 코드": "MGT4409",
                        "과목명": "회계학 연습",
                        "학점": 3,
                        "강의 시간": "3시간",
                        "선수과목": [
                            "MGT4402",
                            "MGT4404"
                        ],
                        "내용": "시험문제 형식의 사례를 중심으로 하여 전회계분야의 중요 문제를 종합적으로 공부하여 각 회계분야 교과목에서 공부한 제반이론, 개념, 원칙을 효과적으로 실무에 적용할 수 있는 기법을 연구 개발한다."
                    },
                    "MGT4501": {
                        "과목 코드": "MGT4501",
                        "과목명": "마케팅 전략",
                        "학점": 3,
                        "강의 시간": "3시간",
                        "내용": "실무 사례와 시뮬레이션을 통하여 제품, 가격, 촉진, 유통 등의 다양한 세부 마케팅 기능들을 전략적으로 통합하여 실제 현실에 적용할 수 있는 능력을 배양한다."
                    },
                    "MGT4502": {
                        "과목 코드": "MGT4502",
                        "과목명": "소비자행동론",
                        "학점": 3,
                        "강의 시간": "3시간",
                        "선수과목": [
                            "MGT3006"
                        ],
                        "내용": "소비자의 구매 및 소비와 관련된 의사결정에 영향을 미치는 심리, 사회 및 경제적 제 요인을 연구하고 이들을 마케팅 전략에 활용하는 방안을 검토한다."
                    },
                    "MGT4503": {
                        "과목 코드": "MGT4503",
                        "과목명": "시장조사론",
                        "학점": 3,
                        "강의 시간": "3시간",
                        "선수과목": [
                            "MGT3006"
                        ],
                        "내용": "마케팅 의사결정에 필요한 자료를 과학적으로 수집하기 위한 조사방법을 연구한다. 구체적으로 조사문제의 설정, 조사 설계유형의 결정, 자료수집 방법의 선정, 표본설정, 자료수집, 자료의 분석, 조사보고서 작성 등과 관련된 이론과 실무에 관해 학습한다."
                    },
                    "MGTG505": {
                        "과목 코드": "MGTG505",
                        "과목명": "브랜드전략론",
                        "학점": 3,
                        "강의 시간": "3시간",
                        "내용": "브랜드 및 브랜드자산에 대한 전반적인 이해와 중요성 인식 그리고 브랜드전략 수립을 위한 framework, 여러 전략도구 및 프로세스 등에 대한 지식습득을 목표로 한다. 즉, 브랜드자산의 전략적 관리 단계를 브랜드자산의 구축단계, 활용단계, 유지 및 강화단계로 구분하여 각 단계별 주요 이슈들에 대해 살펴보고, 브랜드 자산 가치 측정 방법들에 대한 이해를 주요 내용으로 공부한다."
                    },
                    "MGT4506": {
                        "과목 코드": "MGT4506",
                        "과목명": "촉진전략론",
                        "학점": 3,
                        "강의 시간": "3시간",
                        "선수과목": [
                            "MGT3006"
                        ],
                        "내용": "목표 소비자들을 대상으로 기업의 제품, 서비스 브랜드에 대한 인지, 선호, 구매를 유도하기 위한 다양한 커뮤니케이션 전략과 기법을 학습하며, 구체적으로 광고, 판매촉진, 홍보, 인적판매, 소셜 미디어를 통한 커뮤니케이션 등의 수단들에 대해 특징과 활용방안을 검토한다."
                    },
                    "MGT4507": {
                        "과목 코드": "MGT4507",
                        "과목명": "유통전략론",
                        "학점": 3,
                        "강의 시간": "3시간",
                        "선수과목": [
                            "MGT3006"
                        ],
                        "내용": "생산된 제품이 소비자에게 이전되는 과정에 관여하는 다양한 마케팅 경로의 유형과 기능을 고찰하고, 마케팅 경로의 설계 및 관리와 관련된 이론과 실무를 학습한다. 특히 변화하는 마케팅 환경에 적합한 마케팅 경로 전략을 개발하기 위해서 기업이 해결해야 할 현실적인 문제를 중점적으로 분석 연구한다."
                    },
                    "MGT4508": {
                        "과목 코드": "MGT4508",
                        "과목명": "서비스 마케팅",
                        "강의 시간": "3시간",
                        "학점": "3학점",
                        "선수과목": "MGT3006",
                        "내용": "현대 경제에서 차지하고 있는 비중이 점차 높아지고 있는 서비스 산업의 마케팅 활동과 관련된 이론적 체계와 실무적 시사점에 대하여 연구 한다. 구체적으로 서비스 마케팅의 개념, 서비스 마케팅 믹스관리, 서비스 마케팅의 전략과제 등에 관하여 학습한다."
                    },
                    "MGT4510": {
                        "과목 코드": "MGT4510",
                        "과목명": "국제 마케팅론",
                        "강의 시간": "3시간",
                        "학점": "3학점",
                        "선수과목": "MGT3006",
                        "내용": "국제 마케팅의 개념과 과업을 인식시키고, 국제 마케팅 환경을 분석한 다음, 이에 적합한 국제 마케팅 도구인 시장조사, 제품, 가격, 판매경로, 물적유통, 광고, 판매조직에 대해 연구한다."
                    },
                    "MGT4511": {
                        "과목 코드": "MGT4511",
                        "과목명": "마케팅관리",
                        "강의 시간": "3시간",
                        "학점": "3학점",
                        "내용": "본 과목은 기업들이 많은 관심을 보이고 실시하고 있는 최신 마케팅 이론과 방법론을 실무 중심으로 교육하는 마케팅 고급 과목이다. 기존 마케팅 과목들이 특정 마케팅 분야를 집중 다루고 있는 반면, 본 과목은 이렇게 개별적으로 교육받은 여러 분야 이론과 방법론을 체계적으로 종합 이해시키는 것이 주요 목표이다. 주요 이론들이 어떻게 유기적으로 연결되는지를 이해시키기 위해, 본 수업은 팀별 프로젝트를 통해 실질적 체험 중심의 교육을 제공한다."
                    },
                    "MGT4513": {
                        "과목 코드": "MGT4513",
                        "과목명": "마케팅 최신주제 및 사례연구",
                        "강의 시간": "3시간",
                        "학점": "3학점",
                        "내용": "마케팅 관련 최신 사례 및 학문적 이슈들을 심화학습 함으로써 새로운 마케팅 패러다임을 이해하고 마케팅 문제 해결 능력을 증진시키는 것을 목적으로 한다."
                    },
                    "MGT4515": {
                        "과목 코드": "MGT4515",
                        "과목명": "빅데이터 기반 마케팅과 스타트업",
                        "강의 시간": "3시간",
                        "학점": "3학점",
                        "내용": "시장이 디지털화됨에 따라 그동안 기업이 얻을 수 없었던 전혀 다른 종류의 데이터가 감당할 수 없을 정도로 쏟아져 나오고 있다. 전통적인 시장 자료와 대비되는 비정형 데이터들 속에는 우리 기업이 그 동안 그토록 얻고 싶어 했던 다양한 종류의 정보들이 담겨있는데, 이것들을 우리 기업들은 어떻게 관리해야 할 것인가? 이에 대한 답을 찾고, 마케팅 전문 인력으로서 필요한 빅데이터가 무엇인지를 이해하고, 이 데이터들을 이용해 마케팅에서 어떻게 활용할 수 있는지 방법을 익히고, 더 나아가 빅데이터를 기반으로 한 스타트업/창업을 지원하는데 그 목표를 두고 있다."
                    },
                    "MGT4516": {
                        "과목 코드": "MGT4516",
                        "과목명": "인공지능과 마케팅",
                        "강의 시간": "3시간",
                        "학점": "3학점",
                        "내용": "최근 개발되는 AI(인공지능) 방법은 기업경영을 크게 변화시키고 있다. 마케팅의 경우 빅데이터의 분석 및 디지털마케팅을 위한 의사결정과 자동화에서 AI의 응용이 늘어나고 있다. 본 과목에서는 AI방법의 기초와 이를 응용할 수 있는 방법들에 대하여 학습한다."
                    },
                    "MGT4601": {
                        "과목 코드": "MGT4601",
                        "과목명": "기업과 국제환경",
                        "강의 시간": "3시간",
                        "학점": "3학점",
                        "내용": "국제무역의 기본적 이론과 실무의 초보적 매커니즘을 주지시키고 이에 따른 국제간의 무역에 대한 개념을 높여 국제경제관계의 포괄적인 이해를 돕는다."
                    },
                    "MGT4602": {
                        "과목 코드": "MGT4602",
                        "과목명": "다국적기업론",
                        "강의 시간": "3시간",
                        "학점": "3학점",
                        "내용": "다국적기업의 본질, 조직 및 경영전략, 기업 다국적화 동기, 세계경제 및 국가경제에 주는 영향, 다국적기업에 대한 규제 및 국가정책, 우리나라 기업의 다국적기업화의 가능성과 전략을 연구한다."
                    },
                    "MGT4604": {
                        "과목 코드": "MGT4604",
                        "과목명": "국제경영전략",
                        "강의 시간": "3시간",
                        "학점": "3학점",
                        "내용": "국제경영을 기업전체, 사업부 및 직능별 전략이라는 차원에서 접근한다. 국제경영 portfolio 분석, 사업별 경쟁전략, 국제직능전략분석이 주가 되며 국제시장 선정, 국제 Sourcing 및 국제진출 등을 연구한다."
                    },
                    "MGT4605": {
                        "과목 코드": "MGT4605",
                        "과목명": "무역경영관리",
                        "강의 시간": "3시간",
                        "학점": "3학점",
                        "내용": "무역에 대한 기본 이론을 습득하고, 국제경영 시각에서 무역 실무에 관한 제반 이슈를 다룬다. 이와 더불어 국제통상법규의 변화방향과 이에 대한 대응방안을 다룬다."
                    },
                    "MGT4607": {
                        "과목 코드": "MGT4607",
                        "과목명": "국제금융시장론",
                        "강의 시간": "3시간",
                        "학점": "3학점",
                        "내용": "국제금융시장에서 이용되는 기법, 즉 환재정과 hedging의 여러 가지 형태를 연구하고 선물환과 외국환 옵션의 이용방법을 다룬다. 유로 커런시 시장에서의 이자율 결정이론을 분석하고 개발도상국의 외채문제를 국제금융시장의 구조적인 측면에서 다룬다."
                    },
                    "MGT4609": {
                        "과목 코드": "MGT4609",
                        "과목명": "외환론",
                        "강의 시간": "3시간",
                        "학점": "3학점",
                        "내용": "외국환의 개념과 기능 및 외국환 시세의 결정이론, 외국환은행의 기능과 국제금융시장의 역할 및 국제수지의 이론과 정책, 외국환 관리제도 등에 대한 분석을 한다."
                    },
                    "MGT4613": {
                        "과목 코드": "MGT4613",
                        "과목명": "중국시장 및 경영환경의 이해",
                        "강의 시간": "3시간",
                        "학점": "3학점",
                        "내용": "본 과목은 우리나라 경제 및 기업에 있어 그 중요성이 나날이 확대되어 가고 있는 중국의 시장 및 경영환경에 대한 이해 제고를 목적으로 한다. 특히 시장경제체제로의 전환과정 및 그 특성, 경제성장의 패턴 및 특징, 기업 소유지배구조의 변천 및 특징, 대외무역 구조 및 외국투자기업의 역할, 금융체제 등 기본 현황에 대한 학습 후 중국의 소비자, 진입방식, 경쟁전략 등과 같은 경영환경 및 기업전략과 관련된 이슈를 다룬다."
                    },
                    "MGT4614": {
                        "과목 코드": "MGT4614",
                        "과목명": "글로벌 통합 모듈",
                        "강의 시간": "3시간",
                        "학점": "3학점",
                        "내용": "본 과목은 미국의 New York University, 스페인의 ESADE, 이탈리아의 Bocconi 및 서강대학의 학생이 공동으로 팀을 구성하여 기업의 사회적 책임 관련 주제에 대한 연구 Project를 수행하는 과목이다. 각 팀은 각 참여 대학의 학생 1-2명을 포함하는 방식으로 구성되며, 인터넷을 통한 교류를 통해 공동 프로젝트를 수행한다. 금번 학기의 프로젝트 주제는 “기업이 경제적 불평 등 감소를 위해 어떻게 공헌할 수 있는가?”이다. 본교 이외의 참여 대학의 봄 학기 개강이 본교에 비해 빠른 관계로 본 과정은 2월 넷째주부터 시작하여 5월 중순에 종료한다."
                    },
                    "MGT4701": {
                        "과목 코드": "MGT4701",
                        "과목명": "경영영어 라이팅",
                        "강의 시간": "3시간",
                        "학점": "3학점",
                        "내용": "본 과목은 다양한 미디어의 발달과 함께 기업에서 요구되는 영어 커뮤니케이션 능력 역시 Verbal Skill에서 Writing Skill을 중시하는 변화에 맞춰 보다 전문적인 경영용어 사용을 통한 보고서 작성 및 논리적인 사고 능력을 배양할 수 있는 커뮤니케이션 능력을 기르고자 한다."
                    },
                    "MGT4704": {
                        "과목 코드": "MGT4704",
                        "과목명": "CEO 경영특강",
                        "강의 시간": "2시간",
                        "학점": "2학점",
                        "내용": "국내 유명 CEO를 초청하여 경영의 전 분야에 걸친 최신이론과 첨단기법 등에 관한 특강을 실시하여 최신 경영 이슈에 대한 지식 습득과 기업경영 과 관련된 경영현장의 체험, 경영혁신 사례 등을 학습한다. (단, 전공학점에서 제외)"
                    },
                    "MGT4705": {
                        "과목 코드": "MGT4705",
                        "과목명": "경영인턴십",
                        "학점": "3학점",
                        "내용": "최근 기업 발전 현황과 경영 실무를 이해하기 위하여 산업체 실습 등을 통해 기존의 강의 과목에서 다루지 못하는 내용을 익힌다."
                    },
                    "MGT4706": {
                        "과목 코드": "MGT4706",
                        "과목명": "경영현장실습",
                        "학점": "3학점",
                        "내용": "본 과목은 우선적으로 컨설팅 이론 및 방법론에 대해 학습하고 이를 토대로 실제 기업 및 조직을 선정하여 실무자 및 고객 등을 대상으로 심층인터뷰, 서베이 등을 직접 실시하여 핵심이슈를 도출하고 교수 및 Facilitator의 도움을 받아 실제적인 결과물(Output)을 도출하여 이론과 실무의 접목을 꾀한 진정한 학습의 장을 형성한다."
                    },
                    "MGT4707": {
                        "과목 코드": "MGT4707",
                        "과목명": "글로벌 인턴십(현장실습중심)",
                        "학점": "3학점",
                        "내용": "본 과정은 경영학 전공자가 글로벌 기업에서 현장 실무 체험을 통하여 글로벌 경영현장의 문제 해결 과정을 익히면서 학교에서 배운 이론과 실무의 융합을 도모하는 동시에, 기업에게 실질적인 도움을 주고자하는 프로그램이다."
                    },
                    "MGT4708": {
                        "과목 코드": "MGT4708",
                        "과목명": "사회적 기업 인턴십",
                        "학점": "3학점",
                        "내용": "본 과정은 사회적 기업들이 당면한 과제를 체험하고 효과적으로 문제를 해결하는 방안을 도출하는 과정에 참여하는 기회를 제공하며, 이러한 활동을 통해 사회문제 해결에 대한 안목을 키우는데 도움을 주고자하는 프로그램이다."
                    },
                    "MGT4710": {
                        "과목 코드": "MGT4710",
                        "과목명": "글로벌 리더십 실습",
                        "학점": "3학점",
                        "내용": "본 교과목은 인도네시아 등 동남아시아 국가의 예수회 경영대학과 협력하여 진행되는 현장실습 과정으로, 글로벌 인재에게 요구되는 언어 능력 및 이문화 적응력을 배양하고 현지 지역사회개발 프로젝트 참여를 통해 글로벌 리더십을 실천할 수 있는 기회를 제공한다."
                    },
                    "MGT4711": {
                        "과목 코드": "MGT4711",
                        "과목명": "산업분석연구",
                        "강의 시간": "3시간",
                        "학점": "3학점",
                        "내용": "본 교과목은 산업에 대한 구체적인 이해를 위해 특정 산업을 선정하여 산업의 특성과 경쟁 환경, 주요 이해관계자 등을 분석하며, 산업에 속한 기업체의 방문 등을 통해 수강생으로 하여금 산업에 대한 심도 있는 이해를 촉진시키는 것을 목적으로 한다. 또한 다양한 산업에 종사하는 실무자와의 교류를 통해 직무역량 강화 및 구체적인 진로 정보 습득의 기회를 제공하고자 한다."
                    },
                    "MGT4712": {
                        "과목 코드": "MGT4712",
                        "과목명": "지식, 인성 그리고 경영",
                        "강의 시간": "4시간",
                        "학점": "3학점",
                        "내용": "경영학부 특성화 교육 목표인 인간과 사회를 위하는 실천적 인재상에게 요구되는 스스로 탐구하고 해결하고 성찰할 수 있는 핵심역량의 배양을 목적으로 한 교과목으로 경영교육의 지경을 확장하여 ‘지식과 인성의 균형 잡힌 교육’을 지향한다. 본 교과에서는 책 읽기, 강연 및 토론을 통해 ‘사회적 책임과 윤리의 식’, ‘창조적 도전정신’, 그리고 ‘실험적 탐구와 성찰’의 주제를 다룬다."
                    },
                    "MGT4713": {
                        "과목 코드": "MGT4713",
                        "과목명": "사회적 가치창출 프랙티컴",
                        "상세": "(강의 3시간)",
                        "학점": "3학점",
                        "설명": "본 캡스톤 교과목은 경영이론과 실무를 접목함으로써 단지 머릿속으로만 떠오르는 ‘암묵지’를 ‘형식지’로 전환할 수 있는 계기를 제공하고자 한다. 이를 위해, 실질적인 결과물(output)이 창출될 수 있도록 ‘창의성’ 및 ‘실천적 사고력’을 신장할 수 있는 콘텐츠와 학습방식을 접목하고자 한다. 나아가, 도출된 솔루션이 기업 실무자들에게 설득력 있고 호소력 있게 다가갈 수 있는 커뮤니케이션 역량을 축적하여, 졸업 후 실무 현장에서 이론과 실제를 접목할 수 있는 실천적 인재를 양성하는데 목적이 있다. 궁극적으로 인간과 사회에 대한 통찰을 바탕으로 기업의 사회적 책임 및 참여 관련 제반 이슈에 대한 문제 해결 제안을 위한 실천적 교육(practicum)의 장을 마련해 준다."
                    },
                    "MGT4714": {
                        "과목 코드": "MGT4714",
                        "과목명": "사회적기업 창업과 운영",
                        "상세": "(강의 3시간)",
                        "학점": "3학점",
                        "설명": "사회적 기업 창업과 운영은 기업의 활동을 통해 기존의 공공이나 민간 부문에서 해결하지 못한 다양한 사회적 문제를 해결하고자 하는 노력을 말한다. 이익 창출을 목적으로 하는 영리기업과는 구분되는, 기업활동을 하면서 사회적 미션 달성을 목적으로 하는 사회적 기업을 연구대상으로 한다."
                    },
                    "MGT4715": {
                        "과목 코드": "MGT4715",
                        "과목명": "금융 비즈니스 인턴십",
                        "상세": "(강의 6시간)",
                        "학점": "6학점",
                        "설명": "하나금융투자와 진행되는 산학 협동 프로그램으로 인턴으로 참여하는 학생들은 한 학기 동안 하루 8시간씩 주 5회 현장근무를 통해 금융 산업 현장 경험을 쌓고 산업분석 및 프라이빗 뱅킹에 대해 실제 일하면서 배울 기회를 갖는다."
                    },
                    "MGT4716": {
                        "과목 코드": "MGT4716",
                        "과목명": "글로벌인턴십(프로젝트중심)",
                        "상세": "",
                        "학점": "3학점",
                        "설명": "본 과정은 경영학 전공자가 글로벌 기업에서 특정 프로젝트를 수행하면서 글로벌 경영 현장의 문제 해결 과정을 익히면서 학교에서 배운 이론과 실무의 융합을 도모하는 동시에 기업에게 실질적인 도움을 주고자 하는 프로그램이다."
                    },
                    "MGT4717": {
                        "과목 코드": "MGT4717",
                        "과목명": "지식, 인성 그리고 경영(심화)",
                        "상세": "(강의 2시간, 격주 운영)",
                        "학점": "1학점",
                        "설명": "지식, 인성, 그리고 경영(MGT4712) 교과목 수강생을 대상으로 하여 책 읽기와 멘토링을 통해 지식에 머물지 않고 실천하는 지행일치의 인재 양성을 추구한다.",
                        "비고": "2020년 2학기부터 3학점"
                    },
                    "MGT4719": {
                        "과목 코드": "MGT4719",
                        "과목명": "서비스 공급망관리와 ESG",
                        "상세": "(강의 3시간)",
                        "학점": "3학점",
                        "설명": "서비스 산업의 공급망관리의 구조, 운영, 시스템을 이해하고 고객만족과 효율성을 달성할 수 있는 다양한 경영기법과 도구에 대해서 학습한다. 또한 서비스 산업의 공급망관리 운영에 있어서 ESG 즉 환경, 사회, 지배구조 등을 기업에서 어떤식으로 활용하는지 사례 위주로 학습한다."
                    },
                    "MGT4722": {
                        "과목 코드": "MGT4722",
                        "과목명": "머신 러닝과 경영",
                        "상세": "(강의 3시간)",
                        "학점": "3학점",
                        "설명": "오늘날 기업은 대용량의 데이터를 다루고 자동/반자동적 방법을 이용하여 의미 있는 패턴과 규칙을 찾고 문제해결을 하기 위하여 머신 러닝 모델(machine learning model)을 활용하고 있다. 본 과목에서는 분류, 추정, 예측, 프로파일링 작업을 위하여 의사결정나무(decision tree), 의사결정나무 앙상블(decision tree ensemble), 연관성 규칙(association rule), 사례기반추론(memory-based reasoning), 인공신경망(artificial neural network) 등의 모델에 대한 이론을 심도 있게 학습하고, R 등의 소프트웨어 코딩을 실습하여 솔루션을 구하고 해석하는 기술을 습득한다."
                    },
                    "MGT4723": {
                        "과목 코드": "MGT4723",
                        "과목명": "인공지능 객체인식 활용 비즈니스 모델링",
                        "상세": "(탐구공동체)",
                        "학점": "1.5학점",
                        "설명": "깃허브 오픈소스 사전훈련모델을 이용하여 이미지나 동영상 속의 객체인식(얼굴인식 포함) 기법을 학습하고, 나아가 사전모델에서 인식할 수 없는 다양한 객체를 인식하는 전이학습의 개념과 방법(이미지나 동영상 레이블링)을 학습한다. 구축한 인공지능 객체인식 모델의 완성도를 증진시킬 뿐만 아니라 비즈니스 모델링 측면에서 수익 창출과 지속가능성을 확보할 수 있는 역량을 키우는 것을 학습 목표로 한다."
                    },
                    "MGT4724": {
                        "과목 코드": "MGT4724",
                        "과목명": "해외진출 한국기업의 현지화전략",
                        "상세": "(탐구공동체)",
                        "학점": "1.5학점",
                        "설명": "본 과목의 수강생은 a) 한국기업의 해외진출이 가속화되는 현 상황에서 해외진출한국기업의 현지화전략 사례를 수집하고 토론하며, b) 현지화전략 사례를 국제경영 제 이론(해외직접투자, 해외진출방식, 현지화전략, 보호무역, ESG 등)과 연결시켜 이론에 기반한 사례(theory-driven case)를 작성한다."
                    },
                    "MGT4730": {
                        "과목 코드": "MGT4730",
                        "과목명": "Global Business",
                        "상세": "(강의 3시간)",
                        "학점": "3학점",
                        "설명": "Through a combination of lectures, case reading, and class discussions, this course helps students to understand international business strategies with theories and concepts and to come up with strategic solutions to international business challenges. Serving as an introduction to the area of international business, this course introduces the most important concepts, theories, and frameworks of international business. We examine how firms operate in the global business setting to gain and sustain competitive advantages by investigating IB environments and firms’ strategies. Specifically, the course explores national differences, ethics, CSR, international trade theories, regional economic integration, global monetary system, international business strategy, and entery strategy."
                    },
                    "MGT4731": {
                        "과목 코드": "MGT4731",
                        "과목명": "Entrepreneurship and Design Thinking",
                        "상세": "(강의 3시간)",
                        "학점": "3학점",
                        "설명": "This course is an introductory course intended to provide students with a solid foundation in entrepreneurship and design thinking. Over the past decade, there has been a tremendous surge in entrepreneurship as an increasingly common career path, and it has even been adopted as a legitimate major/minor for collegiate study. During this semester, we will explore, create, assess, and critique all manner of phenomenon related to new venture development."
                    }
                }
            }
        }
    }
}