{
    "2025 서강대학교 요람": {
        "지식융합미디어대학": {
            "지식융합미디어대학 학부" : {
                "과목 정보": {
                    "학부 필수 과목": [
                        {
                            "과목 코드": "MAS1001",
                            "과목명": "지식융합미디어입문 (팀티칭)",
                            "학점": "1학점",
                            "내용": "신입생이 입학한 첫 학기에 개설되며 학장의 주관 하에 본 지식융합미디어학부의 모든 전임교수님들이 2인 1조로 짝이 되어 매주 수업시간에 학생들과 만난다. 해당 교수님들이 각자 학생들에게 도움을 줄 수 있는 전문 영역에 관해 간단한 토크를 진행하고, 질의응답을 통해 각 학생들이 추후 어느 교수님과 더 깊은 진로상담을 원하는지 정하여 2학년 이후 학생들이 나아가게 될 융합전공의 방향을 결정하는 데 도움을 준다."
                        },
                        {
                            "과목 코드": "MAS1002",
                            "과목명": "Creativity & Visual Expression",
                            "학점": "3학점",
                            "내용": "‘세상에 없던 사항을 생각하는 원리’ ‘전혀 새로운 사항을 제시하는 화법’ ‘새로운 조합(Combination)에 의해 New를 제작하는 테크닉’ 등에 대하여 논의할 예정이다. 물론 독창적인 사고의 수행을 통하여 다양한 분야에서 탁월한 성과를 이루어낸 국내외 사례들 또한 장르를 불문하고 중요한 교재로 활용된다. 크리에이티브적 사고가 특히 필수적으로 요구되는 미디어 산업, 그 중에서도 광고를 비롯한 Strategic Communication의 영역에서의 실제 예들을 통해 심층 토론을 수차례 진행할 것이며, 매년 프랑스 칸느에서 개최되어 전 세계인의 Creative Thinking의 수준을 가늠하는 본 분야 세계적 경쟁 무대인 ‘칸느 크리에이티브 페스티발’의 부문별 수상작들을 검토하는 시간도 가질 것이다. 이와 더불어 사람들의 시선을 사로잡기 위해 필요한 조형의 원리를 여러 예술 작품과 디자인 작품을 보며 그 시각적 원리를 학습하고 디지털 카메라 등을 사용해 자신의 화면의 구성과 시각적 표현 방식도 다양하게 탐색한다."
                        },
                        {
                            "과목 코드": "MAS1003",
                            "과목명": "The Art of Storytelling",
                            "학점": "3학점",
                            "내용": "본 과목은 콘텐츠 창작의 기본이 되는 스토리 아트와 스토리텔링 크래프트를 집중적으로 다룬다. 스토리 개발, 다양한 목적 및 매체에 따른 스토리텔링 전략과 방법 탐색, 창의적인 적용과 응용의 과정을 실습한다."
                        },
                        {
                            "과목 코드": "MAS1004",
                            "과목명": "Data & AI",
                            "학점": "3학점",
                            "선수과목": "COR1010 기초인공지능프로그래밍",
                            "내용": "인공지능은 반복되는 일을 자동화하고, 어려운 인간의 일을 돕는 등 인간 사회를 풍요롭게 하기 위함에서 비롯되었다. 과거에 인공 지능은 인간의 지식과 생각하는 방식에 대한 규칙을 컴퓨터 언어로 기술하는 방식이었다. 보다 최근, 컴퓨팅 파워의 성장과 인간 삶에 관한 데이터 축적이 급속도로 이루어짐에 따라 인공 지능을 이루는 기술은 데이터로부터 지식과 규칙을 학습하는 방식으로 진행되고 있고 이를 위한 기계 학습의 방식이 다양해졌다. 그 활용도에 있어서도 단순히 인간의 일을 돕는 수준에서 나아가 스토리텔링, 엔터테인먼트 등의 문화 분야와 음악, 미술 등의 예술 분야로까지 넓혀지고 있다. 이러한 시대적 요구에 맞추어 데이터로부터 지식과 규칙을 학습하여 활용하기 위한 기초를 가르친다. 특히 최근, 기계학습 방법의 하나인 신경망 기법에 혁명적인 개선을 이루어졌고 딥러닝이라는 이름으로 불리며 실생활에까지 응용 가능한 방식으로 자리 잡고 있다. 이에 본 수업에서는 데이터로부터 그 특징을 학습하는 신경망 기초 이론을 배우고 딥러닝 소프트웨어를 이용하여 실제 문제를 해결하는 방법을 배운다."
                        },
                        {
                            "과목 코드": "GKS1001",
                            "과목명": "Critical Thinking for Social Inquiry",
                            "학점": "3학점",
                            "내용": "Students will learn diverse perspectives and methods to understand human societies and seek solutions for social problems arising from societies. This course will offer students an opportunity to apprehend social phenomena not as an immediate manifestation of the natural characteristics of individual things and institutions but as historical constructs and social relations. In each week, students will be encouraged to cast ontological, epistemological and methodological questions to social affairs they encounter in daily life and scrutinise them through quantitative and qualitative research methods. In so doing, students will have a chance to imagine best possible socio-historical solutions to such social problems."
                        }
                    ],
                    "학부 선택 과목": [
                        {
                            "과목 코드": "MAS2001",
                            "과목명": "융합 미디어 통론",
                            "학점": "3학점",
                            "내용": "다양해져 가는 미디어의 모습에서 찾을 수 있는 공통성과 각 미디어가 갖는 특수성을 찾는 동시에 미디어간 연결성을 탐구한다. 시간과 공간에 따라 특수성이나 연결성의 경향이 달라짐에 주목하며 사회와 미디어 간 관계에 대한 논의도 편다. 미디어성, 미디어 간 연결성 그리고 미디어 사회성에 대한 탐구를 행하는 과목이다."
                        },
                        {
                            "과목 코드": "MAS2002",
                            "과목명": "전략 커뮤니케이션",
                            "학점": "3학점",
                            "내용": "전략 커뮤니케이션은 다양한 커뮤니케이션학을 토대로 발전한 최신 학문이다. 2010년 이전에는 PR(공중관계), 마케팅 커뮤니케이션, 헬스커뮤니케이션 등을 아우르면서 명명되었다. 그러다 최근에는 대내외 커뮤니케이션이 통합적으로 운용되면서, 비즈니스 분야들(인사, 마케팅, 재무, 연구, 생산, 신뢰 등)도 전략 커뮤니케이션을 채택하기 시작하였다. 이제 전략 커뮤니케이션은 저널리즘, 인간 커뮤니케이션, 매스 커뮤니케이션, 조직 커뮤니케이션, 국제 커뮤니케이션 등 전통적 커뮤니케이션학을 융합하며 글로벌 조직의 필수불가결한 경영 핵심이 된 것이다. 따라서 본 수업에서는 먼저 전략 커뮤니케이션이 지능(Intelligence), 지혜, AI 등과 어떠한 개념적 차이가 있는지 살펴본 후에, 4차 산업혁명기술(AI 등) 발전에 어떠한 영향을 미치는 지 토론하고자 한다. 다음으로 정부, 기업, 병원, 미디어 등 조직에서 펼치는 새로운 전략 커뮤니케이션 트렌드를 연구한다. 정치, 과학, 헬스, 공공외교(Public Diplomacy), 공공 이슈 및 안전 관리, 국방, 스포츠, 엔터테인먼트 등에서 이뤄지고 있는 사례들을 분석하고, 전략 커뮤니케이션 분야 월드클래스 전문가가 되기 위한 통찰적 능력을 제시하고자 한다."
                        },
                        {
                            "과목 코드": "MAS2003",
                            "과목명": "한류",
                            "학점": "3학점",
                            "내용": "신자유주의 시대 이후 대중문화의 교류가 더 활발해지고 있다. 이를 두고 문화침범이거나 문화 헤게모니라고 부르는 이도 있고 문화교류라고 중립적으로 말하기도 한다. 한국의 대중문화가 아시아 권역에서 혹은 그를 넘어 세계적인 인기를 누리는 현상은 과연 어떤 이름으로 부를수 있을까. 한류의 시작과 팬덤 그리고 초국가적 현상을 논의한다."
                        },
                        {
                            "과목 코드": "MAS2004(구 COM2002)",
                            "과목명": "인간 소통과 미디어",
                            "학점": "3학점",
                            "내용": "사람과 사람 사이의 의미 공유 과정에서 작용하는 사회심리학적 원리들과 그 응용 방식을 미디어 발전의 맥락 안에서 다룬다. 미디어를 경유한 커뮤니케이션과 면대면 커뮤니케이션을 모두 포함한다. 개개인 바로 옆에 붙어 작동하며 온 세상을 연결하고 있는 미디어가 사람과 사람 사이의 의미 공유를 넘어 사람과 사물 사이의 연결까지 가능하게 해 주고 있는 현 상황에서, 미디어를 통해 소통 공간이 확장되는 측면을 중점적으로 살펴본다. 이 과목을 통해 학생들은 인간을 향한 따뜻한 시선에서 출발하여 다양한 융합 학문의 토대를 다질 수 있을 것이다."
                        },
                        {
                            "과목 코드": "MAS2005",
                            "과목명": "영상제작입문",
                            "학점": "3학점",
                            "내용": "상급 제작 수업을 수강하기 전에 필요한 제작 워크숍으로서, 신입생을 위한 과목이다. 매체의 종류에 관계없이 의미 있는 아이디어를 영상과 음향의 복합콘텐츠로 제작 가능하게 하는 프로덕션 테크닉의 기본적인 요소들을 중점적으로 배운다."
                        },
                        {
                            "과목 코드": "MAS2006",
                            "과목명": "공연예술의이해",
                            "학점": "3학점",
                            "내용": "연극, 무용, 음악극 등 다양한 공연형식의 특성들을 고찰한다. 미학적, 사회적, 철학적 맥락에서 공연예술의 의미를 파악하는 한편 공연제작실습을 통해 공연예술에 대한 실천적 이해를 함께 추구한다."
                        },
                        {
                            "과목 코드": "MAS2007",
                            "과목명": "Media Technologies and Arts",
                            "학점": "3학점",
                            "내용": "This course aims to provide historical context for media arts by examining the interaction between the arts, media technologies, and sciences in different periods. It offers lectures about art and visual culture including photography, film, sound and radio work, experimental music, new media art, and mixed media work. Students explore how artists have used the potentials of various media forms and examine emerging scientific and technological researches, and their relevant experimentations in arts."
                        },
                        {
                            "과목 코드": "MAS2008",
                            "과목명": "Fundamentals of Programming and Problem Solving",
                            "학점": "3학점",
                            "내용": "This course introduces the development of programming and problem-solving skills, focusing on the C++ programming language and object-oriented programming. Topics include C++ syntax and semantics, basic data structures, principles of design, and basic software engineering skills. The course emphasizes object-oriented programming in the development of algorithm solutions to common problems and media design problems.",
                            "비고": "Prerequisites: ANT2010"
                        },
                        {
                            "과목 코드": "MAS2010",
                            "과목명": "Fundamentals of Computer Science for Korean Studies",
                            "학점": "3학점",
                            "내용": "A great deal of what we know about Korea has been calculated using a wide variety of computational systems and devices. In this course, students will be taught the fundamentals of computer science so that they are equipped to understand how Korea is represented and assessed by computational systems. Students will learn the fundamentals of computer science as they pertain to the study of Korea. The course will also survey the history of computation and computational systems in Korea, how computational systems are currently used to study Korea, and how they might be used to study Korea in the future."
                        },
                        {
                            "과목 코드": "MAS2011",
                            "과목명": "Introduction to Visual Media Programming",
                            "학점": "3학점",
                            "내용": "The course introduces the components of computer programming for developing visual graphics applications for Korean studies research. Beginning with basic principles, the course moves on to explain advanced techniques in visual media program with the goal of enabling student to generate creative visual displays that can represent key ideas and vexing problems in the study of Korea. The course relies on open-source environments only and provides step-by-step guidance for creating visual media without using commercial software tools."
                        },
                        {
                            "과목 코드": "MAS2012",
                            "과목명": "Computing Korean Culture",
                            "학점": "3학점",
                            "내용": "This course enables students to investigate Korea's long cultural history using the latest tools in humanities computing. The course begins with an investigation of the book, that central technology of culture and knowledge production. The course then contemplates editorial practice, modeling, and design as they relate to data curation, visualization, and newer forms of knowledge. Students are introduced to GIS (Geographic Information Systems) and social network analysis (SNA), as well as learn how to use GIS and SNA tools. Key terms (information, code, data, digital object, materiality, post-humanism) will be examined in the context of Korean studies along with newer theoretical approaches(distant reading, algorithmic criticism) and areas of study (critical code studies, software studies). While researching a subject of her or his own choosing—anything from Korean Buddhism to punk rock in contemporary Seoul—students will develop websites and cultural atlases, as well as learn the basics of coding for the web. By the end of the course, students will be able to compose an academic argument using new media. Along with a working knowledge of html, css, javascript and various data analysis and visualization tools, students will take away a deep understanding of Korea's cultural legacy and the ways that digital technologies can illuminate it."
                        },
                        {
                            "과목 코드": "MAS2013",
                            "과목명": "Data Structures",
                            "학점": "3학점",
                            "내용": "Understanding and designing data structures is one of the foundations of computer science with programming languages. In this course, students will learn the fundamental principles and techniques of organizing data for writing effective code."
                        }
                    ]
                }
            },
            "신문방송학과": {
                "과목 정보": {
                    "전공필수": [
                        {
                            "과목 코드": "MAS3001",
                            "과거코드": "COM2004",
                            "과목명": "미디어 커뮤니케이션 조사론",
                            "강의시간": "3시간",
                            "학점": "3학점",
                            "내용": "인간과 사회를 연구하는 모든 분야에서 어떻게 연구를 설계하고 수행하는지를 다루는 과목. 특히 주제 및 연구문제/가설 설정, 문헌 연구, 연구 설계, 데이터 모으기 및 분석 방법 등과 같은 체계적이고 과학적인 연구를 수행하기 위한 전반적인 기초과정을 다룰 예정. 이 과목은 인간과 사회를 다루는 모든 주제를 포괄하여 연구 문제를 설정하고 이를 어떻게 연구 과제로 수행하며 결과를 도출하는 지를 알려줌으로써, 학생들에게 다양한 관심 주제를 탐구 및 연구하는 과정의 기초를 알려주고자 한다."
                        },
                        {
                            "과목 코드": "JAS3001",
                            "과거코드": "COM3101",
                            "과목명": "저널리즘개론",
                            "강의시간": "3시간",
                            "학점": "3학점",
                            "내용": "본 과목은 저널리즘과 관련된 기본 개념과 핵심 이론에 대한 학습을 토대로 언론의 핵심 성격을 오늘날의 정치, 경제, 사회, 문화적 맥락 속에서 이해하는데 주된 목적이 있다. 이와 함께 특히 바람직한 언론이 어떤 것인가에 대한 논의를 통하여 예비언론인으로서 갖추어야 할 언론에 대한 올바른 인식과 자세를 배우는데 주안점을 둔다."
                        },
                        {
                            "과목 코드": "JAS3007",
                            "과거코드": "COM3201",
                            "과목명": "광고 4.0",
                            "강의시간": "3시간",
                            "학점": "3학점",
                            "내용": "마켓4.0에서는 ‘연결성’으로 인하여 마케팅 커뮤니케이션 환경을 구성하고 있는 소비자, 미디어, 광고회사가 급격하게 변하고 있다. 이에 따라 시장세분화, 타게팅, 포지셔닝 등 절대 변하지 않을 것처럼 신봉되어 왔던 광고의 이론들에 대한 대안이 요구되고 있다. 기존의 4대 매체 광고의 효과가 점점 약화되고 있으며, 다양한 뉴미디어 매체가 각광을 받고 있다. 광고주들도 과거에는 광고의 creative performance를 중요시했다면 지금은 creative problem solution을 더 요구하고 있다. 본 과목은 연결된 고객들의 힘이 이전보다 훨씬 강력해진 ‘절대 가치’의 상황에서 광고의 역할과 기능에 대해 새로운 시각을 제공한다."
                        }
                    ],
                    "전공기초": [
                        {
                            "과목 코드": "JAS3002",
                            "과거코드": "COM3137",
                            "과목명": "저널리즘과 사회이슈",
                            "강의시간": "3시간",
                            "학점": "3학점",
                            "내용": "이 수업은 언론과 사회의 상호작용과 그 역동적 관계에 대한 체계적이고 심층적인 이해를 도모하는데 목적이 있다. 이를 위해 언론의 역할과 관련되는 핵심적 쟁점들을 도출하고, 다양한 사회 이슈들이 언론을 통해서 제시되는 방식을 이해함으로써 언론의 사회적 역할을 비판적 관점에서 살펴본다."
                        },
                        {
                            "과목 코드": "JAS3003",
                            "과목명": "네트워크 사회와 미디어",
                            "강의시간": "3시간",
                            "학점": "3학점",
                            "내용": "지구촌 네트워크 시대의 커뮤니케이션 권력에 대해 논의한다. 글로벌 미디어 산업의 재편에 대해 알아본다."
                        },
                        {
                            "과목 코드": "JAS3004",
                            "과거코드": "COM3121",
                            "과목명": "영상문화와 사회",
                            "강의시간": "3시간",
                            "학점": "3학점",
                            "내용": "본 과목은 회화, 사진, 건축, 영화, TV, 광고, 디지털미디어, 공연예술, 전시, 박물관, 도시공간 등과 관련된 다양한 영상이미지들을 포함하는 영상문화의 사회적인 의미에 대한 비판적인 이해를 도모하는데 목적이 있다. 특히, 영상 이미지 기술의 발전이 사회와 문화의 변화와 관련하여 어떻게 이해될 수 있는지 공부함으로써 향후 관련 융합적 연구의 기반을 다지는데 기여한다."
                        },
                        {
                            "과목 코드": "JAS3005",
                            "과거코드": "COM3111",
                            "과목명": "대중문화론",
                            "강의시간": "3시간",
                            "학점": "3학점",
                            "내용": "본 과목은 그 동안 개발되어온 다양한 ‘대중문화 이론’들을 개괄적으로 공부하는데 목적이 있다. 따라서, 현대사회의 대중문화를 바라보는 관점이 역사적으로 그리고 학문적으로 어떻게 변화되어왔는지, 그리고 구체적으로 대중문화 현상들이 다양한 이론적 관점들을 통해 어떠한 방식으로 이해될 수 있고 그 의미는 무엇인지 공부한다. 이 과목 또한 전문적인 융합교육으로 의 진입을 위한 기초 과목이다."
                        },
                        {
                            "과목 코드": "JAS3006",
                            "과거코드": "COM3123",
                            "과목명": "융합적 미디어 글쓰기",
                            "강의시간": "3시간",
                            "학점": "3학점",
                            "내용": "텍스트라는 일차원적 접근이 아니라 독자의 정보 욕구를 충족시키는 융합적 관점에서 신문, 잡지, 온라인 매체 등 다양한 매체의 기사를 작성하는 법을 배운다. 융합적 관점은 독자와 소통하는 다차원의 방식을 기사에 담는 방법으로 나타난다."
                        },
                        {
                            "과목 코드": "JAS3008",
                            "과거코드": "COM3202",
                            "과목명": "PR의 이해",
                            "강의시간": "3시간",
                            "학점": "3학점",
                            "내용": "Public Relations의 Public 즉 공중에는 소비자, 사원, 주주, 시민단체, 지역주민, 여론주도층, 언론, 정부 등이 있으며, 이들 공중의 지지를 받아 조직을 유지 발전시키는 전략커뮤니케이션이 바로 공중관계(public relations)이다. 공중관계 능력에 따라 조직(기업, 정부, 학교, 협회, 병원 등)의 성패가 좌우될 정도로 공중관계의 영향은 날로 커지고 있다. 이 과목은 다양한 경영 분야로 진출 전략적 커뮤니케이션을 수행함으로써 자신의 직업 능력을 확대하는데 도움을 주며, 동시에 공중관계 전문가로 발돋움 하는 길을 안내한다."
                        },
                        {
                            "과목 코드": "JAS3009",
                            "과거코드": "COM3210",
                            "과목명": "광고 카피라이팅과 전략적 글쓰기",
                            "강의시간": "3시간",
                            "학점": "3학점",
                            "내용": "전략적 커뮤니케이션은 광고와 홍보, 헬스커뮤니케이션 등 대체로 특정한 Client와 소통 대상이 명확하며 매우 목적 지향적인 소통 활동을 의미한다. 위와 같은 과정에서 소용되는 다양한 글쓰기에 대한 방법 및 사례들을 다룬다."
                        },
                        {
                            "과목 코드": "JAS3010",
                            "과거코드": "COM3220",
                            "과목명": "헬스커뮤니케이션과 디지털 미디어",
                            "강의시간": "3시간",
                            "학점": "3학점",
                            "내용": "국민들의 건강증진 (Health Promotion)을 위해 소통, 즉 커뮤니케이션 분야가 공헌할 수 있는 사항을 발굴하여 논의하고 실행하는 영역이 바로 헬스커뮤니케이션(Health Communication)이다. 디지털미디어의 다양한 수단들이 특정한 헬스컴 노력에 어떤 형태로서 적용될 것인가를 논의한다."
                        },
                        {
                            "과목 코드": "JAS3011",
                            "과거코드": "COM3214",
                            "과목명": "PR글쓰기와 실무",
                            "강의시간": "3시간",
                            "학점": "3학점",
                            "내용": "PR실무에서 중요한 보도자료, 팩트 쉿(fact sheet) 작성 등을 통해 전통적인 PR글쓰기 능력을 배운다. 한편, 뉴스를 보는 시대에서 SNS를 하는 시대가 되었다. 이에 PR실무에서의 소셜미디어 글쓰기 등 온라인 매체를 활용한 PR글쓰기 능력도 제고할 수 있도록 한다. 스토리텔링, 영상, SNS 콘텐츠, 어드버토리얼, CEO 스피치 등 각종 테크닉 제작을 실습한다."
                        },
                        {
                            "과목 코드": "JAS3012",
                            "과거코드": "COM3102",
                            "과목명": "텔레비전론",
                            "강의시간": "3시간",
                            "학점": 3,
                            "내용": "텔레비전의 정체를 알기 위해선 기술, 산업, 법제, 내용, 제작, 조직 그리고 수용자에 이르기까지 다양한 요소에 대한 이해가 필요하다. 다양한 요소에 대한 이해뿐만 아니라 그들간 관계를 익히는 일도 수반되어야 한다. 새롭게 등장하는 기술이 각 요소와 관계에 미치는 영향까지 고려하여 텔레비전을 더욱 확장적으로 이해할 필요가 있다."
                        },
                        {
                            "과목 코드": "JAS3013",
                            "과거코드": "COM3205",
                            "과목명": "PR 이론과 실제",
                            "강의시간": "3시간",
                            "학점": 3,
                            "내용": "PR의 근본이 되는 이론을 접하며 다양한 사례들을 통해 PR전략 수립에 활용할 수 있는 능력을 배양하고자 한다. 효과적인 PR전략 수립을 위해 조사, 목표설정, 실행, 평가의 과정 등을 이해한다."
                        },
                        {
                            "과목 코드": "JAS3014",
                            "과거코드": "COM3103",
                            "과목명": "창의적말하기와글쓰기",
                            "강의시간": "3시간",
                            "학점": 3,
                            "내용": "수사학의 기초를 이해하고 각 이슈에 대한 자신의 입장과 생각을 논리적으로 설득적으로 표현하는 방법을 익힌다."
                        },
                        {
                            "과목 코드": "JAS3015",
                            "과목명": "광고와 디자인기획",
                            "강의시간": "3시간",
                            "학점": 3,
                            "내용": "본 수업은 지식융합미디어학부 필수과목인 Creativity & Visual Expressions의 심화 과목이며, 창의력과 비쥬얼, 메시지 등의 요소를 활용하여 실제 우리 사회에서 진행되는 다양한 경쟁 공모전을 선택하여 출전하는 실습형 수업임. 광고/PR/헬스커뮤니케이션 영역에 해당하는 국내외 유수의 공모전에 교수와 함께 창작물을 기획하여 출품하는 행동형 수업이다(예: 대한민국 공익광고제, OOO PR 컴피티션 등).",
                            "비고": "2024-2페지"
                        },
                        {
                            "과목 코드": "JAS3016",
                            "과목명": "광고문화비평",
                            "강의시간": "3시간",
                            "학점": 3,
                            "내용": "각국의 경제적, 문화적 산물 중 하나인 ‘광고’에 대한 비평을 통해 현대 사회를 이해하는 데 중점을 둔다. 세계 각국의 광고에 활용된 디자인 등 예술적 측면의 시사점은 물론, 메시지 차원에서의 함의와 나아가 정보 소비자들에게 전달되는 궁극적인 심상 또한 고찰 및 토론한다."
                        },
                        {
                            "과목 코드": "JAS3017",
                            "과목명": "AI활용 광고와 디자인 기획",
                            "강의시간": "3시간",
                            "학점": 3,
                            "내용": "주요 패러다임으로 등장한 인공지능 원리 등을 혼합하여 융합적 효과를 의도하는 디자인적 요소가 강조된 전공과목이다. MZ로 표현되는 디지털 네이티브 학생들의 니즈에 적극적으로 부응하면서도 실무 현장과 학계에서 빈번하게 논의되는 주제들을 교과목에 접목시키고자 한다."
                        },
                        {
                            "과목 코드": "JAS3018",
                            "과목명": "전공진로설계",
                            "강의시간": "0시간",
                            "학점": 0,
                            "내용": "학생들은 본 교과를 통해 지도교수로부터 전공 진로 관련 상담을 받을 수 있으며, 해당 전공 출신 선배의 진학/취업/진로 등 사례 등을 통해 자기주도적 계획을 설계할 수 있다."
                        },
                        {
                            "과목 코드": "JAS3019",
                            "과목명": "게임과 문화",
                            "강의시간": "3시간",
                            "학점": 3,
                            "내용": "본 과목의 목표는 사회문화적 관점에서 게임과 게임문화에 대한 심층적 이해를 도모하는 데 있다. 게임의 역사와 발전 과정을 살펴보고, 게임이 현대 사회에 미치는 사회적, 문화적, 경제적 영향을 다각적으로 논의한다. 게임과 게임문화에 접근하는 다양한 학술적 관점을 이해하고, 게임과 게이머의 유형 및 게임의 재미를 구성하는 주요 요소 등을 탐구한다."
                        },
                        {
                            "과목 코드": "JAS3020",
                            "과목명": "크리에이티비티와 미디어컨텐츠",
                            "강의시간": "3시간",
                            "학점": 3,
                            "내용": "본 과목은 지식융합미디어학부 학생 필수과목인 Creativity & Visual Expressions와 연계되는 과목으로서, 지식융합미디어학부의 근본적 지향점인 창의적/융합적 지식과 사고를 함양하기 위해 다양한 미디어 관련 콘텐츠를 대상으로 비판적 논의를 진행하게 된다. 뉴스에서 예능, 다큐, 영화 등 콘텐츠에 어떻게 Creativity를 최적의 형태로 활용하여 대중에게 효과적으로 소구할 것인가에 대한 토론 등을 학기 중에 진행하게 된다."
                        },
                        {
                            "과목 코드": "JAS4001",
                            "과목명": "미래 저널리즘",
                            "강의시간": "3시간",
                            "학점": 3,
                            "내용": "로봇기자가 등장한 4차 산업 시대에 저널리즘의 의미, 방향, 언론인의 역할, 뉴스 제작 관행 등에 관해 실질적이면서 이론적인 고민을 다룬다. 열려 있는 사고를 토대로 언론의 모습을 자유롭게 설계해 보고 그 타당성을 점검한다."
                        },
                        {
                            "과목 코드": "JAS4003",
                            "과거코드": "COM3117",
                            "과목명": "미디어 문화사",
                            "강의시간": "3시간",
                            "학점": 3,
                            "내용": "본 과목은 기술과 커뮤니케이션 매체의 역사를 사회문화사적 관점에서 이해하는 데 주안점을 둔다. 특히 기술과 매체의 변화 과정이 인간의식과 경험의 성격 변화 그리고 사회적 삶의 성격 변화와 어떤 관계를 맺고 있는지를 살펴본다."
                        },
                        {
                            "과목 코드": "JAS4004",
                            "과목명": "커뮤니케이션 테크놀로지와 비판이론",
                            "강의시간": "3시간",
                            "학점": 3,
                            "내용": "본 과목은 커뮤니케이션 테크놀로지가 갖는 정치, 경제, 사회, 문화적 함의를 이해하는데 목적이 있다. 특히 디지털 미디어의 독특한 커뮤니케이션 양식을 파악하고 이것이 우리 삶을 어떻게 새롭게 구축하는지 비판이론의 관점에서 분석하고 논의한다."
                        },
                        {
                            "과목 코드": "JAS4006",
                            "과거코드": "COM3204",
                            "과목명": "광고 커뮤니케이션과 소비자심리분석",
                            "강의시간": "3시간",
                            "학점": 3,
                            "내용": "광고와 홍보를 포함, 다양한 전략적 커뮤니케이션을 기획하고 실행함에 있어 더욱 실질적이고 지속적인 효과가 확보되기 위해서는 그 대상 (Target)에 대한 분석이 필수적이다. 소비자 심리 관련 최신 사례와 이론 등을 폭넓게 다룬다."
                        },
                        {
                            "과목 코드": "JAS4007",
                            "과거코드": "COM3216",
                            "과목명": "미디어와 위기커뮤니케이션",
                            "강의시간": "3시간",
                            "학점": 3,
                            "내용": "성공적인 조직의 위기커뮤니케이션 관리를 위해 필요한 지식과 이론, 실무능력을 획득하며 이를 위한 다양한 미디어 활용과 의미를 배울 수 있는 기회를 제공한다. 다양한 국내외 위기 사례들을 통해 위기커뮤니케이션의 중요성과 의미를 배우고 성공적인 위기커뮤니케이션을 제시할 수 있도록 한다."
                        },
                        {
                            "과목 코드": "JAS4009",
                            "과목명": "공공외교와 글로벌 전략 커뮤니케이션",
                            "강의시간": "3시간",
                            "학점": 3,
                            "내용": "지금은 전통적인 외교(Foreign Diplomacy) 보다 공공외교(Public Diplomacy)가 더 중시되고 있다. 공공외교 목적 달성하는데 절대적으로 필요한 전략적 커뮤니케이션에 대해 연구하는 데 있다. 구체적으로는 전략적 커뮤니케이션에 대한 이해, 기획, 전략 구상, 구체적인 실행 방법 등을 실제 PD 프로그램을 적용하여 연구한다. 글로벌 다문화 사회에 필요한 문화 이론과 이를 적용한 기업 및 다양한 조직들의 글로벌 전략 커뮤니케이션 지식을 습득하고 이를 적용한 커뮤니케이션 캠페인을 제시하는 기회를 가진다."
                        },
                        {
                            "과목 코드": "JAS4010",
                            "과목명": "창의적 뉴스, 다큐멘터리 랩",
                            "강의시간": "3시간",
                            "학점": "3학점",
                            "내용": "긴 시간 동안 공론장 역할을 해온 뉴스와 다큐멘터리가 점차 그 모습을 바꾸어 가고 있다. 그 안의 내용이 달라짐은 물론이고 제작 형식도 급격히 변화하고 있다. 새로운 제작 기기의 등장, 미디어 조직과 플랫폼의 변화가 바꾸어낸 뉴스와 다큐멘터리 현장을 이론과 실무로 체험하는 과목이다."
                        },
                        {
                            "과목 코드": "JAS4011",
                            "과목명": "마케팅커뮤니케이션과 시장 읽기",
                            "강의시간": "3시간",
                            "학점": "3학점",
                            "내용": "광고/홍보는 마케팅 (Marketing)의 주요한 일부이며, 특히 마케팅 4P중 하나인 Promotion에 속하는 대표적인 상세 분야다. 커뮤니케이션의 다양한 노력에 의해 기업, 정부, 개인 등을 위한 마케팅 활동이 어떻게 개선 및 지속될 수 있을지에 대한 현실적 전략과 실행을 논의하고 실습함을 주요 목적으로 한다."
                        },
                        {
                            "과목 코드": "JAS4012",
                            "과목명": "스타트업 전략 커뮤니케이션",
                            "강의시간": "3시간",
                            "학점": "3학점",
                            "내용": "지식융합미디어학부는 아트&테크놀로지를 결합한 신제품을 기반으로 벤처 기업창업을 장려한다. 일반적으로 벤처 기업들이 아이디어는 풍부한 반면 자금과 마케팅 경험은 부족하다. 최근 광고회사들은 이런 벤처 기업들과 공동으로 신제품 개발 단계부터 참여하고 마케팅 커뮤니케이션을 도와주어 상생을 도모하는 사례들을 보여주고 있다. 본 과목의 목표는 지식문화미디어 학부 내 다양한 전공분야의 학생들에게 신제품 개발 아이디어 단계에서부터 소비자들에게 마케팅 하는 단계까지 벤처기업과 광고회사가 협력하는 업계의 새로운 트렌드를 미리 경험하게 하는 것이다."
                        },
                        {
                            "과목 코드": "JAS4013",
                            "과목명": "미디어 콘텐츠 포맷론: Youtube 이론 및 실습",
                            "강의시간": "3시간",
                            "학점": "3학점",
                            "내용": "다양한 미디어 콘텐츠의 포맷 개발 및 유통 등에 대한 논의를 한다. 시사, 예능, 드라마 등이 포함된다."
                        },
                        {
                            "과목 코드": "JAS4014",
                            "과목명": "데이터 마이닝",
                            "강의시간": "3시간",
                            "학점": "3학점",
                            "내용": "데이터 저널리즘의 개념과 언론사들이 데이터 저널리즘을 적용하는 방식을 R 프로그래밍 언어에 기반을 둔 데이터 마이닝 차원에서 학습한다. 이를 통해 최종적으로 텍스트와 분석 결과의 시각화 등을 포함한 데이터 뉴스를 직접 제작한다."
                        },
                        {
                            "과목 코드": "JAS4015",
                            "과목명": "미디어 스토리텔링 연구",
                            "강의시간": "3시간",
                            "학점": "3학점",
                            "내용": "본 과목은 텔레비전, 사진, 영화, 광고, 다큐멘터리, 그 외 디지털 콘텐츠까지 포함하는 미디어 텍스트들이 스토리텔링을 통해서 어떻게 의미와 즐거움을 생성하는지 그리고 그 사회적이고 문화적인 함의는 무엇인지에 대한 학술적인 이해 증진을 목표로 한다. 이와 관련하여 이 과목에서는 특히 이러한 미디어 스토리텔링 연구의 방법론적인 기반이라고 할 수 있는 내러티브 이론 및 개념들에 대하여 공부하고 미디어텍스트의 내러티브 구조와 규칙에 대한 구체적인 분석방법을 탐구하여 실제 미디어텍스트 연구와 제작에 활용한다."
                        },
                        {
                            "과목 코드": "JAS4016",
                            "과목명": "IMC 캠페인실습",
                            "강의시간": "3시간",
                            "학점": "3학점",
                            "내용": "본 과목에는 실제 기업체가 클라이언트로 참여하고, 수강생들은 4-5명으로 구성되는 “마케팅커뮤니케이션” 그룹에 소속되어이 클라이언트의 과제를 수행하게 된다. 중간고사 전 까지는 최근 마케팅커뮤니케이션이 어떻게 변화하고 있는지에 관한 다양한 강의를 접하면서 클라이언트 과제를 어떻게 접근해야 할지 연구하는 시간을 가지게 된다. 이 과정에서 데이터와 테크놀로지가 마케팅 문제 해결책의 핵심임을 이해하게 될 것이다. 중간고사 이후에 수강생들은 본격적으로 다양한 과제들을 팀 별로 수행해 나가면서 클라이언트의 프로젝트를 완성해 나가게 된다. 최종 결과물 발표와 함께 클라이언트 평가로 수업이 마무리 된다."
                        },
                        {
                            "과목 코드": "JAS4017",
                            "과목명": "전략 커뮤니케이션 기획 실습",
                            "강의시간": "3시간",
                            "학점": "3학점",
                            "내용": "기업, 정부, 병원, 협회 등 제반 조직의 커뮤니케이션 전문가로 진출할 수 있도록 가이드 하고자 합니다. 먼저 전략적 커뮤니케이션 수행과정 및 기획에 대한 기본을 공부한 후에, 해외 성공 사례들을 분석하고 위기 커뮤니케이션, 마케팅커뮤니케이션, 사내 커뮤니케이션 그리고 명성제고 등 제반 프로그램에 적용할 전략과 전술에 대해 연구한다. 마지막으로 수강생 각자는 실제기업, 협회, 정부부처, NGO 등의 커뮤니케이션 과제를 대상으로 전략적 커뮤니케이션 프로그램을 기획하는 실습을 진행한다. 참고로 본 강좌와 같은 프로젝트 중심의 교육은 그동안 학생들의 실무 진출과 활동에 큰 기여를 하여왔다."
                        },
                        {
                            "과목 코드": "JAS4018",
                            "과목명": "기계학습 기반의 텍스트마이닝",
                            "강의시간": "3시간",
                            "학점": "3학점",
                            "내용": "빅데이터 규모의 메시지를 분석하는 텍스트 마이닝의 개념을 파악하고, 뉴스 기사, 소셜 미디어 댓글 등을 대규모로 수집해 메시지에 내재한 의미를 프로그래밍 언어를 활용한 기계학습으로 의제, 프레임 등을 추출하는 방법을 배운다."
                        },
                        {
                            "과목 코드": "JAS4019",
                            "과목명": "한국언론사",
                            "강의시간": "3시간",
                            "학점": "3학점",
                            "내용": "신문사, 방송사의 계보를 중심으로 시대를 관통하는 정신사적 측면이 주요 의제로 다루어지며, 한국 언론사를 사회문화적으로 논의하는 것을 목표로 한다."
                        },
                        {
                            "과목 코드": "JAS4020",
                            "과목명": "커뮤니케이션사상사",
                            "강의시간": "3시간",
                            "학점": "3학점",
                            "내용": "커뮤니케이션 사상사는 언론자유의 기본이념의 형성과 발전을 규명한다. 본 강좌에서는 그 원류를 찾아 긴 여행을 떠난다. 개인의 자유와 독립을 규명하는 일은 현대인들을 더욱 값진 행복한 존재로 만들어 줄 것이다."
                        },
                        {
                            "과목 코드": "JAS4021",
                            "과목명": "정치커뮤니케이션",
                            "강의시간": "3시간",
                            "학점": "3학점",
                            "내용": "정치 집단과 이슈를 중심으로 벌어지는 커뮤니케이션 현상에 대한 분석을 통해 민주적 가치 실현의 중요한 사회적 제도로서 언론이 수행해야 하는 역할이 무엇인지 살펴보고, 언론의 당위적 역할에 대한 이해를 도모한다."
                        },
                        {
                            "과목 코드": "JAS4022",
                            "과목명": "매스컴효과론",
                            "강의시간": "3시간",
                            "학점": "3학점",
                            "내용": "효과론 연구의 역사적 배경과 이론적 전통을 살펴보고 효과론의 실증적 사례들을 분석한다."
                        },
                        {
                            "과목 코드": "JAS4024",
                            "과목명": "매스컴연구",
                            "강의시간": "3시간",
                            "학점": "3학점",
                            "내용": "기획탐사보도 실습 강의에서는 기획보도와 탐사보도를 다룬다. 전통적인 기획탐사보도 방식에서부터 정보공개 청구를 통한 취재 방법, 뉴미디어와 인터넷을 활용한 CAR, GIS, SNA 등도 다룬다. 학생들이 직접 기획안을 제출하고, 취재하고, 기사를 작성한다."
                        },
                        {
                            "과목 코드": "JAS4025",
                            "과목명": "현장취재실습",
                            "강의시간": "3시간",
                            "학점": "3학점",
                            "내용": "취재 과정에 직접 참여하여 제작 환경을 이해하고 실제적인 지식을 쌓는 기회를 제공한다."
                        },
                        {
                            "과목 코드": "JAS4029",
                            "과목명": "언론정보 현장실습",
                            "강의시간": "3시간",
                            "학점": "3학점",
                            "내용": "인턴 활동을 하면서 그 동안 배워왔던 이론과 실습을 직접 실천할 수 있는 기회를 제공한다."
                        },
                        {
                            "과목 코드": "JAS4030",
                            "과목명": "마케팅PR",
                            "강의시간": "3시간",
                            "학점": "3학점",
                            "내용": "마케팅, IMC 및 퍼블리시티에 대한 이해를 바탕으로 21세기 새로운 마케팅 힘으로 등장할 마케팅 홍보(PR의 마케팅 지원전략)에 대해 고찰한다. 마케팅홍보 전략 별 각종 사례들과 성공 포인트 등의 분석을 통해서 광고와 홍보 실무자의 마케팅 능력을 배양한다."
                        },
                        {
                            "과목 코드": "JAS4031",
                            "과목명": "사내커뮤니케이션",
                            "강의시간": "3시간",
                            "학점": "3학점",
                            "내용": "사내 마케팅, 사내 브랜딩, 기업 이미지 제고, 경쟁력 강화, 조직 활성화 등에 기여하는 사내커뮤니케이션은 21세기 조직에서 가장 필요로 하는 분야가 되었다. 전반부에는 사내 커뮤니케이션 관련 개념, 인적자원관리, 조직 행동론 등을 강의하고, 후반부에는 사내커뮤니케이션 제반 사례를 분석하고 프로그램 기획을 실습한다."
                        },
                        {
                            "과목 코드": "JAS4032",
                            "과목명": "소셜미디어와 글로벌소비자행동",
                            "강의시간": "3시간",
                            "학점": "3학점",
                            "내용": "페이스북, 유튜브 등 소셜미디어로 인하여 전세계의 소비자행동이 점차 글로벌화 되어가고 있다. 본 과목은 미국, 중국, 한국 등 주요 국가들에서 소셜미디어, 특히 모바일 이커머스가 소비자행동에 미치는 영향을 살펴본다. 수강생들은 국내외 선진 사례들을 토대로 모든 것이 ultra-convenient, ultra-flexible and ultra-social하게 변하고 있는 쇼핑의 미래를 탐구하게 된다.",
                            "비고": "2024-2 페지"
                        },
                        {
                            "과목 코드": "JAS4033",
                            "과목명": "심층기획취재와 뉴스제작",
                            "강의시간": "3시간",
                            "학점": "3학점",
                            "내용": "심층취재, 기획취재의 기획과 제작을 익히는 과목이다. 기획안 작성부터 기획안에 기반하여 현장을 취재하고, 촬영, 편집, 리포팅하는 방법, 그리고 그를 유통시키는 방법을 연습한다."
                        },
                        {
                            "과목 코드": "JAS4034",
                            "과목명": "영상저널리즘",
                            "강의시간": "3시간",
                            "학점": "3학점",
                            "내용": "인터넷, 텔레비전 등을 통해 유통될 영상 기반 보도(다큐멘터리) 프로그램을 취재, 보도, 유통하는 전 과정을 실습하는 과목이다. 이를 통해 영상 취재, 기사 작성, 현장 리포팅의 기본원리를 익힌다. SNS 등을 통한 1인 저널리즘의 원리도 배우게 된다."
                        },
                        {
                            "과목 코드": "JAS4035",
                            "과목명": "국제뉴스실습 (캡스톤디자인)",
                            "강의시간": "3시간",
                            "학점": "3학점",
                            "내용": "이 수업에서는 국제 뉴스의 개념과 역사적 배경과 국제 정치 등에 대한 이해를 바탕으로 국제 보도에 필요한 다양한 방법을 익히고 기사 작성을 경험하도록 한다. 특히 본 강좌는 동북아 뉴스 허브로 부상한 서울의 지정학적 이점을 살려 ‘우리의 시각으로 본’ 안보, 노동, 사회, 경제, 문화 등 다양한 장르의 뉴스 취재 기회를 제공한다."
                        },
                        {
                            "과목 코드": "JAS4036",
                            "과목명": "나노디그리심화워크숍(데이터기반비즈니스 창업)",
                            "강의시간": "총 6시간",
                            "학점": "0학점",
                            "내용": "본 과목은 [데이터 기반 비즈니스 창업] 나노디그리 취득을 위한 필수 과목이며, 본 심화 워크숍에서는 스타트업 업계 및 일반 기업에서 데이터에 기반한 기업 운영 및 전략적 커뮤니케이션을 담당하는 실무자 및 전문가를 초빙하여 현장 전문 지식을 습득할 수 있는 기회를 학생들에게 제공하고자 한다."
                        },
                        {
                            "과목 코드": "JAS4037",
                            "과목명": "북한과 미디어",
                            "강의시간": "3시간",
                            "학점": "3학점",
                            "내용": "This course will look into media and communication in, about and around North Korea. Topics to be covered include propaganda, peace journalism and popular culture in North Korea. The goal is to not only promote understanding of North Korea, but the social, historical context in Northeast Asia. Course will be taught in English, but reading proficiency in Korean is required."
                        },
                        {
                            "과목 코드": "JAS4038",
                            "과목명": "저널리즘 윤리(캡스톤 디자인)",
                            "강의시간": "3시간",
                            "학점": "3학점",
                            "내용": "언론 현장에서의 윤리적 문제를 이해하고 분석한다. 현직 언론인과의 토론과 케이스 스터디 등 현장감 있는 수업을 통해 학생들은 1) 언론의 사회적 역할과 책임을 이해하고 2) 비판적인 사고능력과 다양한 이해관계를 종합적으로 고려할 수 있는 능력을 키우며 3) 습득한 윤리적 판단 잣대를 다양한 맥락에서 적용할 수 있는 훈련을 받는다."
                        },
                        {
                            "과목 코드": "JAS4039",
                            "과목명": "공익광고 기획 및 제작",
                            "강의시간": "3시간",
                            "학점": "3학점",
                            "내용": "본 과목은 커뮤니케이션 콘텐츠 중 가장 전략적인(Strategic) 유형이라 할 수 있는 광고(Advertising)가 우리 사회의 공익적 목적에 어떻게 기여할 수 있는지에 대해 학술적 토론에서 실제 제작 영역까지 경험함을 목적으로 한다. 환경 보존, 평화 추구, 공존의 가치 확산, 감염병 위기 극복 등 공익적인 사안들을 광고를 통해 대중에게 가장 효과적으로 전달하고 이상적인 방향으로 설득할 것인가에 대한 논의를 진행할 예정입니다."
                        },
                        {
                            "과목 코드": "JAS4040",
                            "과목명": "애드테크와 광고 크리에이티브",
                            "강의시간": "3시간",
                            "학점": "3학점",
                            "내용": "최근 챗GPT 등 생성형 인공지능이 이슈화되면서 이를 기반으로 한 애드테크가 광고산업과 광고 크리에이티브 프로세스 전반에 더욱 큰 영향을 미치게 되었다. 그동안 애드테크는 성과측정과 지표관리에 집중되었다. 그런데 최근 인공지능 기반의 애드테크는 성과측정뿐만 아니라 실행, 제작, 미디어, 콘텐츠, 소비자 경험 등에 광범위한 영향을 미치기 시작했다. 따라서 본 과목은 애드테크와 생성형 인공지능이 광고 크리에이티브 전반에 미치는 영향과 실제 사례를 살펴봄으로써 애드테크를 둘러싼 환경을 잘 이해하려는 목적을 갖고 있다. 애드테크를 잘 이해해서 인공지능을 어떻게 광고 크리에이티브에 영리하게 활용할 것인지 대비하고자 한다. 동시에 인공지능의 한계는 무엇이고 인간만이 할 수 있는 점에 대해서도 논하면서 관점의 균형을 잡고자 한다. 이를 바탕으로 학생들은 최신 광고 크리에이티브 경향에 대해 배우고, 균형 잡힌 시각에 따라 변화에 적응할 수 있는 원동력을 얻을 것이다.",
                            "비고": "2025-1 폐지"
                        },
                        {
                            "과목 코드": "JAS4041",
                            "과목명": "한국 현대사회와 언론 보도",
                            "강의 시간": "3시간",
                            "학점": "3학점",
                            "내용": "본 수업은 언론 보도가 사회적 이슈와 의제를 어떻게 만들었고, 한국사회 흐름과 발전에 어떤 영향을 끼쳤는지를 구체적 사례를 통해 실증적이고 비판적으로 이해한다."
                        },
                        {
                            "과목 코드": "JAS4042",
                            "과목명": "젠더와 미디어",
                            "강의 시간": "3시간",
                            "학점": "3학점",
                            "내용": "젠더와 미디어는 여성주의 관점에서 미디어를 살펴보는 강좌다. 이는 동시대 사회를 이해하는 주요 통로로서 미디어를 상정하고 제반 미디어 현상을 분석하는 핵심 범주로서 젠더를 가져오는 것의 의미를 탐구한다. 성차에 대한 지식인 젠더가 가장 중요하고 영향력 있는 사회구성 요건이라고 할 때 이것이 미디어에 작용하는 방식을 비판적으로 분석하고 대안적인 재현과 수용을 상상하는 수업이다."
                        },
                        {
                            "과목 코드": "JAS4043",
                            "과목명": "데이터 활용 광고 PR 커뮤니케이션",
                            "강의 시간": "3시간",
                            "학점": "3학점",
                            "내용": "데이터에 기반하여 광고 PR커뮤니케이션 전략을 수립하는 과정에 대한 과목이다. 실제 광고 PR업계에서 어떻게 사회적 트렌드를 파악하고 이에 기반하여 커뮤니케이션 전략을 어떻게 수립하는가를 배워, 학생들은 이를 통해 실무 감각을 익힐 수 있다."
                        },
                        {
                            "과목 코드": "JAS4590",
                            "과목명": "언론정보현장실습(계절)",
                            "강의 시간": "3시간",
                            "학점": "3학점",
                            "내용": "인턴 활동을 하면서 그 동안 배워왔던 이론과 실습을 직접 실천할 수 있는 기회를 제공한다."
                        },
                        {
                            "과목 코드": "JAS4690",
                            "과목명": "광고홍보현장실습(계절)",
                            "강의 시간": "3시간",
                            "학점": "3학점",
                            "내용": "본 교과목은 광고, 홍보, 헬스 커뮤니케이션 등 전략적 커뮤니케이션을 학습한 학생들에게 실제 업계에서 전략적 커뮤니케이션의 기획 및 실행 과정을 경험할 수 있도록 한다. 현재 기업에서는 어떤 과정을 통해 전략적 커뮤니케이션을 기획하고 실행하는지 실제 현장을 경험하도록 한다. 교실에서 그 동안 배운 전략적 커뮤니케이션에 관련 다양한 지식과 실무적 역량을 현장에 접목시켜 직접 자신의 위치를 파악하도록 한다. 또한 본 인턴 과목을 통해 실제 기업 활동을 체험해 봄으로써 향후 본인의 진로 설정에 도움을 줄 수 있을 것으로 예상한다."
                        },
                        {
                            "과목 코드": "JAS9000",
                            "과목명": "K-pop and Cultural Studies",
                            "강의 시간": "3시간",
                            "학점": "3학점",
                            "내용": "This course is designed to help students understand South Korea (Korea herafter) through its K-pop and Korean popular music, and enjoy Korean culture better by knowing more about Korean history. The modern forms of Korean popular music, which fascinate people around the globe, did not spring into existence out of nowhere. Instead, they emerged and have constantly co-evolved within the political, the economic, and the technological spheres in historical contexts. This course explores how Korean pop music has come to take on its current forms, corresponding with the national and international contexts. In doing so, this course focuses on Korean modern history, popular culture, and cultural studies theories for deep understandings of Korean pop music."
                        },
                        {
                            "과목 코드": "JASG101",
                            "과목명": "미디어사회학",
                            "강의 시간": "3시간",
                            "학점": "3학점",
                            "내용": "매스미디어의 구조와 기능에 대한 사회학적 분석, 매체와 사회의 관계에 관해 연구하며 매스미디어가 사회에 끼치는 정치적, 문화적, 경제적 영향을 비판적 관점에서 토론하고 평가한다."
                        },
                        {
                            "과목 코드": "JASG102",
                            "과목명": "미디어효과론",
                            "강의 시간": "3시간",
                            "학점": "3학점",
                            "내용": "미디어의 효과를 사회적, 문화적, 정치적, 심리적 측면에서 고찰한다. 또한 매스미디어가 사회와 개인에 미치는 영향을 분석하며 효과를 측정하는 방법에 관해서도 연구한다."
                        },
                        {
                            "과목 코드": "JASG202",
                            "과목명": "Public Relations 이론",
                            "강의 시간": "3시간",
                            "학점": "3학점",
                            "내용": "PR을 공부하는데 필수적으로 이해해야 할 제반 사회과학, 행동과학, 커뮤니케이션 이론을 고찰한 후에 PR분야에서 발전한 제반 이론을 연구한다. 이론을 연구하는데 그치지 않고 이론을 실제 상황에 적용하며 더 나아가서는 새로운 이론을 개발할 수 있도록 수업이 진행된다."
                        },
                        {
                            "과목 코드": "JASG203",
                            "과목명": "미디어와 데이터 사이언스",
                            "강의 시간": "3시간",
                            "학점": "3학점",
                            "내용": "딥 러닝, 기계학습 등 데이터 사이언스 기법을 활용해 디지털 미디어 공간에 쌓이는 데이터를 분석해 현실적 시사점을 찾는 기법을 고찰하고 이에 투입되는 R, Python 등 프로그래밍 언어의 활용법을 다룬다."
                        },
                        {
                            "과목 코드": "JASG204",
                            "과목명": "소셜미디어와 글로벌소비자행동",
                            "강의 시간": "3시간",
                            "학점": "3학점",
                            "내용": "역사, 언어, 지정학적 위치 등 특정 국가가 가지고 있는 문화적 차이로 인한 신념, 태도 소비자행동의 차이는 분명히 존재하지만, 페이스북, 유튜브, 스냅챗, 인스타그램, 틱톡 등 다양한 소셜 미디어 플랫폼들로 인하여 전세계적으로 MZ 세대의 소비자행동이 점점 유사해져 가고 있으며 이는 기업의 마케팅 커뮤니케이션 활동에 중요한 시사점을 제공한다. 본 과목은 미국, 중국, 일본, 한국 등 주요 국가들에서 소셜 미디어, 특히 모바일 이커머스가 소비자 행동에 미치는 영향을 살펴본다. 수강생들은 국내외 선진 사례들을 토대로 모든 것이 ultra-convenient, ultra-flexible and ultra-social하게 변하고 있는 쇼핑의 현재와 미래를 탐구하게 된다."
                        }
                    ]
                }                
            },
            "미디어&엔터테인먼트학과": {
                "과목 정보": {
                    "전공필수": [
                        {
                            "과목 코드": "MAE2001",
                            "구과목코드": "COM3401",
                            "과목명": "미디어&엔터테인먼트 개론",
                            "강의시간": "3시간",
                            "학점": 3,
                            "내용": "프로페셔널한 콘텐츠 생산, 유통자가 되기 위해선 급변하는 미디어와 엔터테인먼트 환경에 대한 이해가 필수적이다. 본 과목은 미디어 & 엔터테인먼트 전공 기초 필수과목으로서 미디어 & 엔터테인먼트 전공에서 다루어지는 다양한 미디어와 엔터테인먼트를 생태계적 관점에서 다룸으로써 콘텐츠의 생산, 유통, 소비가 어떻게 이루어지는지를 다양한 융합미디어를 통해서 분석될 것이다."
                        },
                        {
                            "과목 코드": "MAS3001",
                            "구과목코드": "COM2004",
                            "과목명": "미디어 커뮤니케이션 조사론",
                            "강의시간": "3시간",
                            "학점": 3,
                            "내용": "인간과 사회를 연구하는 모든 분야에서 어떻게 연구를 설계하고 수행하는지를 다루는 과목이다. 특히 주제 및 연구문제/가설 설정, 문헌 연구, 연구 설계, 데이터 모으기 및 분석 방법 등과 같은 체계적이고 과학적인 연구를 수행하기 위한 전반적인 기초과정을 다룰 예정이다. 이 과목은 인간과 사회를 다루는 모든 주제를 포괄하여 연구 문제를 설정하고 이를 어떻게 연구 과제로 수행하며 결과를 도출하는 지를 알려줌으로써, 학생들에게 다양한 관심 주제를 탐구 및 연구하는 과정의 기초를 알려주고자 한다."
                        }
                    ],
                    "전공기초": [
                        {
                            "과목 코드": "MAE2002",
                            "구과목코드": "COM3301",
                            "과목명": "연극과 테크놀로지",
                            "강의시간": "3시간",
                            "학점": 3,
                            "내용": "연극 창작에 있어서 기술적인 요소들의 기능을 다각적으로 탐색한다. 현대 연극의 다양한 테크놀로지와의 융합 양상을 살펴보고 실습함으로써 공연예술에 대한 심층적이고 실질적인 이해를 도모한다."
                        },
                        {
                            "과목 코드": "MAE2003",
                            "구과목코드": "COM3421",
                            "과목명": "영상 제작 [캡스톤디자인]",
                            "강의시간": "3시간",
                            "학점": 3,
                            "내용": "콘텐츠의 가장 기본인 영상제작의 이론에서 실제 제작까지 다루는 과목이다. 영상 콘텐츠 기획, 연출, 촬영, 편집에 이르는 전 과정을 실질적으로 마스터하고 이를 온라인(유튜브 등)에 노출시키는 경험은 이제는 대학생들에는 기본적 소양이 되고 있다. 이를 기반으로 창·취업에 필요한 영상 포트폴리오를 준비할 수 있으며, 실제로 이런 훈련을 통해 마련된 졸업생들의 포트폴리오는 성공적 창·취업에 매우 유효한 툴로 지속적으로 입증되고 있다."
                        },
                        {
                            "과목 코드": "MAE3001",
                            "구과목코드": "COM2003",
                            "과목명": "매스커뮤니케이션",
                            "강의시간": "3시간",
                            "학점": 3,
                            "내용": "융합미디어의 영향력이 커지고 있음에도 불구하고 여전히 매스미디어의 사회적 영향력은 막강하다. 특히 융합미디어는 매스미디어와 연결될 때 그 파급력이 커진다는 점을 감안한다면 융합미디어에 대한 이해는 매스커뮤니케이션에 대한 이해에 기반 한다고 할 수 있다. 본 과목을 통해서 매스커뮤니케이션이 어떻게 진화하고 있는지를 콘텐츠의 생산, 유통, 이용자의 관점에서 살펴볼 것이다."
                        },
                        {
                            "과목 코드": "MAE3002",
                            "구과목코드": "COM3402",
                            "과목명": "미디어, 인간, 사회",
                            "강의시간": "3시간",
                            "학점": 3,
                            "내용": "다양한 미디어, 특히 뉴미디어(인터넷, 모바일 미디어 등)가 어떻게 인간과 사회의 다양한 방면에 영향을 미치는지를 다루는 개론 과목이다. 그 영향의 범위는 개인의 육체 및 심리, 대인관계, 조직, 사회, 문화 등을 모두 다룰 것이며, 영향력의 종류는 주로 사회적 및 심리적, 긍정적 및 부정적 영향 등을 포괄적으로 살펴본다."
                        },
                        {
                            "과목 코드": "MAE3003",
                            "구과목코드": "COM3409",
                            "과목명": "미디어심리학",
                            "강의시간": "3시간",
                            "학점": 3,
                            "내용": "미디어 영역과 심리학 분야의 지식을 융합한 핵심 과목으로서, 미디어를 이용하는 사람들이 어떠한 생각을 하며 어떠한 감정을 느끼게 되는지, 미디어를 통해 전달하는 다양한 장르의 콘텐츠가 개인 및 우리사회에 어떠한 영향을 주게 되는지를 체계적으로 다룬다. 소통을 위한 미디어, 즐김을 위한 미디어, 및 미디어 아트의 영역을 포괄한다. 이 과목을 통해 학생들은 내실 있는 융합 학문의 세계를 접하며 발전해가는 미디어 기술에 발맞춰 점점 더 넓은 영역에 적용 가능한 지혜와 통찰을 키울 수 있을 것이다."
                        },
                        {
                            "과목 코드": "MAE3004",
                            "구과목코드": "COM3302",
                            "과목명": "영화입문",
                            "강의시간": "3시간",
                            "학점": 3,
                            "내용": "영화의 다양한 측면에 관한 기초지식을 고찰한다."
                        },
                        {
                            "과목 코드": "MAE3005",
                            "구과목코드": "COM3324",
                            "과목명": "스토리와 캐릭터",
                            "강의시간": "3시간",
                            "학점": 3,
                            "내용": "극적 잠재성이 큰 콘텐츠를 개발한다. 신화, 민담, 역사 등의 원천소스를 망라하며, 공연, 영화, 게임 등으로 발전시킬 수 있는 스토리와 캐릭터를 발굴, 1차 가공한다."
                        },
                        {
                            "과목 코드": "MAE3006",
                            "구과목코드": "COM3323",
                            "과목명": "뮤지컬 프로덕션",
                            "강의시간": "3시간",
                            "학점": 3,
                            "내용": "뮤지컬 대본과 노래를 창작하여, 다양한 뮤지컬 양식을 실험하고, 무대화한다."
                        },
                        {
                            "과목 코드": "MAE3007",
                            "구과목코드": "COM3305",
                            "과목명": "드라마의 창조적 해석 [캡스톤 디자인]",
                            "강의시간": "3시간",
                            "학점": 3,
                            "내용": "이 강의는 대본을 문학 텍스트가 아니라 공연의 기초재료로서 읽고 다루는 방법을 다룬다. 무대화를 위한 대본 분석 및 해석의 기초를 다지고 구체적인 작품을 선정해 실습한다."
                        },
                        {
                            "과목 코드": "MAE3008",
                            "과목명": "미디어엔터테인먼트 기획론",
                            "강의시간": "3시간",
                            "학점": 3,
                            "내용": "영상, 공연, 웹& 앱, 게임, VR 등에 이르는 다양한 콘텐츠 제작의 기획자가 갖춰야 할 기본 소양에서 실제적 기획 실무까지 전 과정을 섭렵하는 과목. 콘텐츠의 기본인 영상 및 공연 기획뿐만 아니라 기술적 이해가 반드시 수반되어야 하는 웹(Web)이나 앱(Apps) 그리고 게임 및 VR 콘텐츠 기획에 대한 실무적 내용까지 다루고 있다. 따라서 미디어, 콘텐츠 및 서비스 산업에 기획자로서 종사하고자 하는 모든 융합학부 학생들에게 필수 과목의 성격이 강하다."
                        },
                        {
                            "과목 코드": "MAE3009",
                            "과목명": "미디어엔터테인먼트 조직과 산업의 이해",
                            "강의시간": "3시간",
                            "학점": 3,
                            "내용": "미디어 엔터테인먼트 조직과 산업에 있어서의 현황 및 성공·실패 요인을 분석한다. 디지털 기술 혁명이 현대 미디어 엔터테인먼트 조직에 가져 온 영향에 주목하면서, 조직경영론을 바탕으로 meso-level 요인들에 대해 고찰하며, 매체산업론을 기반으로 macro-level 요인들을 분석한다."
                        },
                        {
                            "과목 코드": "MAE3010",
                            "과목명": "디지털 미디어 교육론",
                            "강의시간": "3시간",
                            "학점": 3,
                            "내용": "미디어 리터러시의 기본 개념과 이론을 탐색하고, 디지털 미디어 리터러시 교육에 대해 심화 학습한다. 이러한 과정을 통해 디지털 미디어에 대한 비판적 해석력을 고양함으로써, 미디어 엔터테인먼트 산업에 대한 시각을 확장한다."
                        },
                        {
                            "과목 코드": "MAE3012",
                            "과목명": "세계영화사",
                            "강의시간": "3시간",
                            "학점": 3,
                            "내용": "세계 영화 역사 가운데 영화언어의 획기적 전환을 마련한 영화 텍스트들을 비평적 안목을 통해 조명하는 영화사 입문 과정으로서, 영화의 역사 안에서 현재를 점검하고 미래 영화 언어를 조망해 보는 영화 입문과정의 필수 교과목이다."
                        },
                        {
                            "과목 코드": "MAE3013",
                            "과목명": "Editing Aesthetics",
                            "강의시간": "3시간",
                            "학점": 3,
                            "내용": "This is an intensive course in English that explores the aesthetics and techniques of picture editing and sound design in narrative filmmaking forms. The focus of the course is on the craft of editing rather a software editing system."
                        },
                        {
                            "과목 코드": "MAE3014",
                            "과목명": "커뮤니케이션학입문",
                            "강의시간": "3시간",
                            "학점": 3,
                            "내용": "커뮤니케이션 학문분야와 접근방법을 전반적으로 개관하는 기초과목으로서 커뮤니케이션학에서 다루게 될 영역의 제반 형태와 이에 관련된 이론과 현상에 대한 개괄적인 이해를 돕는다."
                        },
                        {
                            "과목 코드": "MAE3016",
                            "과목명": "인간-미디어 상호작용의 이해",
                            "강의시간": "3시간",
                            "학점": 3,
                            "내용": "정보통신기술의 발전은 미디어를 수용의 대상에서 상호작용의 대상으로 변화시켰다. 본 과목은 미디어&엔터테인먼트 전공 학생들을 대상으로 미디어와 다양한 방식으로 상호작용하는 사용자들의 심리적, 조직적, 사회적 차원의 반응을 다룬다. 미디어를 정보 전달의 매개체로 보는 전통적 관점에서 사회적 감정과 인지의 대상으로 보거나 직접적인 조작감을 제공하는 신체확장물로 보는 최근의 관점을 폭넓게 탐구하고 이를 이해할 수 있는 관련 이론과 응용 사례들을 소개한다."
                        },
                        {
                            "과목 코드": "MAE3017",
                            "과목명": "데이터 사이언스 입문",
                            "강의시간": "3시간",
                            "학점": 3,
                            "내용": "디지털 미디어의 확산은 방대한 양의 사용자 데이터 축적을 가능하게 하였고, 미디어 전문가들은 데이터를 활용하여 사용자에 대한 이해를 높이고 개선된 서비스를 제공할 수 있게 되었다. 본 과목에서는 미디어&엔터테인먼트 전공 학생들이 데이터를 분석하고 함의를 도출하는데 필요한 역량을 개발하는 것을 목표로 한다. 이를 위해 통계학 기본 개념을 학습하고, 데이터 수집, 처리, 분석 등의 프로그램 활용기술을 배운다."
                        },
                        {
                            "과목 코드": "MAE3018",
                            "과목명": "전공진로설계Ⅰ",
                            "강의시간": "",
                            "학점": 0,
                            "내용": "학생들은 본 교과를 통해 지도교수로부터 전공 진로 관련 상담을 받을 수 있으며, 해당 전공 출신 선배의 진학/취업/진로 등 사례 등을 통해 자기 주도적 계획을 설계할 수 있다."
                        },
                        {
                            "과목 코드": "MAE3019",
                            "과목명": "스크린 연기",
                            "강의시간": "3시간",
                            "학점": 3,
                            "내용": "스크린 연기는 대본을 기반으로 캐릭터와 장면에 집중하여 카메라 숏에 따른 배역의 습관, 움직임의 설계등의 연기표현을 하는 과목이다. 이를 위해서 카메라 앵그로가 숏을 이해하고, 카메라 숏에 따른 연기 표현 테크닉을 발전시켜나가야 한다. 나아가서 카메라 숏 연기를 구체화 하고, 캐릭터 이미지를 스타일링해나간다. 세부적으로 시선과 얼굴 근육 구현, 이미지 시각화 계획과 재현을 통해 배우 뿐만 아니라 연출자로서도 연기를 연출하는 과정을 실천적으로 공부한다."
                        }
                    ],
                    "전공심화": [
                        {
                            "과목 코드": "MAE4001",
                            "과목명": "융합미디어와 이용자",
                            "강의시간": "3시간",
                            "학점": 3,
                            "내용": "기존 미디어와 융합미디어의 가장 큰 차이는 이용자가 주도적인 생산자의 역할을 수행할 수 있게 됨에 따라서 기존의 생산영역과 다른 방식의 콘텐츠 생산을 가능케하고 있다는 점이다. 따라서 융합미디어에 대한 이해는 기본적으로 이용자에 대한 이해를 전제로 한다. 본 과목을 통해서 커뮤니케이션 양식을 변화시키고 있는 융합미디어 이용자의 역동성과 함께 다양한 유형의 이용자가 분석될 것이다."
                        },
                        {
                            "과목 코드": "MAE4002",
                            "과목명": "가상현실 커뮤니케이션",
                            "강의시간": "3시간",
                            "학점": 3,
                            "내용": "융합미디어 환경은 보다 생생한 가상현실 환경으로 진화하고 있다. 본 과목은 현실세계와 차별화되는 가상현실 세계를 구성하는 개념과 함께 다양한 가상현실 서비스에 대해서 살펴보고, 가상현실과 현실세계와의 관계에 대한 다양한 함의를 분석한다."
                        },
                        {
                            "과목 코드": "MAE4003",
                            "과목명": "엔터테인먼트심리학",
                            "강의시간": "3시간",
                            "학점": 3,
                            "내용": "미디어를 통한 인간의 ‘즐김’의 심리에 초점을 둔 심화 과목이다. 관심(주목)경제의 관점에서 이제 사람들의 관심을 끌지 못하는 것은 점점 더 가치를 잃어 가고 있다. 주목을 끌며 즐거움을 주면서도 인류 사회에 유용한 미디어 콘텐츠는 어떤 속성을 지니고 있어야 하는지, 공연 및 영화는 물론, 가상현실 게임 및 치료, 힐링 미디어아트, 에듀테인먼트, 인포테인먼트, 에코테인먼트 등의 영역을 포괄하는 내용을 다룸으로써, 학생들의 개성을 살려 각자의 장점을 개발하는 데 활용 가능한 과목이다."
                        },
                        {
                            "과목 코드": "MAE4004",
                            "과목명": "설득과 미디어",
                            "강의시간": "3시간",
                            "학점": 3,
                            "내용": "사람의 마음을 움직이는 힘은 믿을만한 사람들의 스토리에서 나오며, 이것이 실려 전달되는 미디어에 따라 영향력이 달라질 수도 있다. 이러한 설득의 과정에 포함된 심리학적 원리들과 그 응용, 미디어의 작동 방식 및 영향력의 크기 등을 체계적으로 다룬다. 이를 통해 학생들은 윤리적이지 않은 설득 메시지는 받아들이지 않으면서도 바람직한 설득 메시지는 그 영향력을 확대할 수 있는 원리들을 숙지하여, 개인과 사회의 발전에 도움이 되는 방향으로 다양한 영역에서 미디어를 활용하는 능력을 키울 수 있다."
                        },
                        {
                            "과목 코드": "MAE4005",
                            "과목명": "Non-Fiction Filmmaking Workshop",
                            "강의시간": "3시간",
                            "학점": 3,
                            "내용": "This is an intensive filmmaking workshop in English designed for students with previous filmmaking experience to direct either music videos, experimental film, and/or experimental documentaries."
                        },
                        {
                            "과목 코드": "MAE4006",
                            "과목명": "시네마틱 스토리텔링",
                            "강의시간": "3시간",
                            "학점": 3,
                            "내용": "영화 대사는 캐릭터와 장면을 분명하게 해주는 역할을 한다. 그러나 영화 언어는 대사 자체보다 더욱 영화적이며 미묘하고 풍부한 느낌을 준다. 이 수업은 뛰어난 작가들과 감독들의 작품 사례를 통해 그들이 어떠한 서사 도구로서 플롯에 활력을 불어넣고 캐릭터를 창조하며 행동을 촉발시켰는지에 대해 연구하는 수업이다. 그리하여 조명, 편집, 사운드와 같은 영화 테크닉의 의도적 사용이 어떻게 대사 한 마디 없이 공포와 분노 그리고 증오와 같은 감정을 관객에게 전달하는지 살펴볼 것이다. 학생개개인은 이러한 연구와 실습을 통해 자신의 시나리오를 ‘영화적인’ 시나리오로 개발하는데 역량을 집중한다."
                        },
                        {
                            "과목 코드": "MAE4007",
                            "과목명": "Advanced Film Directing : Visualization Workshop",
                            "강의 시간": "3시간",
                            "학점": "3학점",
                            "내용": "This is an intensive filmmaking workshop in English designed for students with previous filmmaking experience to direct narrative films with an emphasis on camera style and visual design."
                        },
                        {
                            "과목 코드": "MAE4008(구 COM3313)",
                            "과목명": "드라마 연출",
                            "강의 시간": "3시간",
                            "학점": "3학점",
                            "내용": "연출자로서 작품선정에서 Casting, 리허설을 책임 있게 진행하여 완성된 작품을 무대화하는 과정을 실천적으로 공부한다.",
                            "비고": "2025-1 폐지"
                        },
                        {
                            "과목 코드": "MAE4009",
                            "과목명": "각색 워크샵",
                            "강의 시간": "3시간",
                            "학점": "3학점",
                            "내용": "완전한 이야기 구조를 갖춘 오리지널 스토리를 다른 매체용 대본으로 완성한다."
                        },
                        {
                            "과목 코드": "MAE4010(구 COM3316)",
                            "과목명": "극작 워크샵",
                            "강의 시간": "3시간",
                            "학점": "3학점",
                            "내용": "실제 제작 가능한 original full-length script를 완성한다."
                        },
                        {
                            "과목 코드": "MAE4011",
                            "과목명": "퍼포먼스의 세계",
                            "강의 시간": "3시간",
                            "학점": "3학점",
                            "내용": "연극, 뮤지컬, 영화, 음악 등의 장르에서의 퍼포먼스를 예술적, 문화적, 철학적 차원에서 이해하도록 한다."
                        },
                        {
                            "과목 코드": "MAE4012(구 COM3427)",
                            "과목명": "초지능사회론",
                            "강의 시간": "3시간",
                            "학점": "3학점",
                            "내용": "ICT의 기술적 발전에 기반한 산업적 혁신들에 대한 이해를 높이고 이로 인한 미래사회의 변화를 조망해보는 과목. 주요 내용이 인공지능, 사물인터넷, 빅데이터 등과 같은 새로운 성장 엔진들의 기술적 혁신에 초점을 두고 있어 다학제적 접근이 이루어진다. 이를 통해 미디어& 엔터테인먼트 플랫폼 비즈니스 뿐만 아니라 자율주행차, 핀테크, 스마트 홈& 팩토리, AR&VR, 스마트 헬스케어 등 새로운 블루오션으로 진출하고자 학생들의 실질적 역량강화에 도움이 될 것이다."
                        },
                        {
                            "과목 코드": "MAE4014(구 COM3437)",
                            "과목명": "스마트 앱 비즈니스 모델연구",
                            "강의 시간": "3시간",
                            "학점": "3학점",
                            "내용": "Smart Media의 발전으로 다양한 스마트앱 기반Service들이 나타나고 있으며 이러한 앱 서비스들의 비즈니스 모델들을 탐색하고 서비스 기획 과정에서 Sustainable한 수익 모델과 확산 모델을 설계할수 있는 능력을 배양하는 수업이다. 이를 위해 현재 운용중인 서비스 앱들의 한계를 분석하고 이를 개선 또는 대체할 앱 서비스들을 실제 설계함으로써 실제 앱 설계 및 기획을 수행할 협업 실무 능력을 배양해 나가는 캡스톤 디자인형 수업이다."
                        },
                        {
                            "과목 코드": "MAE4015",
                            "과목명": "디지털 미디어 데이터 분석론",
                            "강의 시간": "3시간",
                            "학점": "3학점",
                            "내용": "디지털 미디어를 활용한 다양한 서비스의 수용 및 이용을 결정하는 요인에 대해 파악하고, 다양한 분석기법을 활용하여 예측모델을 구축하는 방법을 습득한다. 사회통계기법을 활용하여 변인들 간의 관계를 파악하고, 머신 러닝 알고리즘을 활용하여 예측모델을 구축하는 방법을 습득한다. 실질적인 데이터에 기반 한 예측 모델을 구축하고 모델의 유의성 또한 파악하는 기회를 가진다.",
                            "비고": "2024-2학기 폐지"
                        },
                        {
                            "과목 코드": "MAE4016",
                            "과목명": "미디어 벤처 창업 캡스톤 디자인",
                            "강의 시간": "3시간",
                            "학점": "3학점",
                            "내용": "다양한 벤처창업이 활성화되는 현상속에서 일반 벤처 창업과 미디어 벤처 창업의 특수성을 이해하고 이를 실제에 응용할 수 있는 안목을 기르는데 그 목적을 두고 있는 수업이다. 특히 미디어 관련 산업의 특수성을 고려한 사업 기회의 발견과 이를 사업적으로 연결하기 위한 비즈니스 기획 역량 및 실제 현장 평가를 토대로 한 사업 가능성을 프로젝트 베이스화하여 프로토 타입을 개발하고 이를 현장 전문가를 통해 평가하는 팀베이스 캡스톤 디자인 수업으로 디자인 되어 있다."
                        },
                        {
                            "과목 코드": "MAE4017(구 COM3431)",
                            "과목명": "디지털콘텐츠기획[캡스톤디자인]",
                            "강의 시간": "3시간",
                            "학점": "3학점",
                            "내용": "디지털 콘텐츠 산업 현장에서 발생하는 다양한 서비스 개선 및 신규 서비스 런칭을 담당할 실무 기획자 양성 과정으로 고객가치 개발을 통해 실제 기업의 문제해결을 연결하는 Project Based Learning 수업이다. 이를 위해 Ideation  고객탐색  고객 가치개발  서비스 설계  프로토 타입을 완성해 나가는 캡스톤 디자인으로 설계되어 있다."
                        },
                        {
                            "과목 코드": "MAE4018",
                            "과목명": "단편영화제작 워크숍[캡스톤디자인]",
                            "강의 시간": "3시간",
                            "학점": "3학점",
                            "내용": "이 수업에서는 완성된 스크립트의 검증 및 팀 구성을 거쳐 30분 이내의 단편영화 또는 다큐멘터리를 완성한다. 매주 프리 프로덕션, 프로덕션, 포스트 프로덕션 진행에 대한 발표, 분석 및 토론 과정을 거친다."
                        },
                        {
                            "과목 코드": "MAE4019",
                            "과목명": "아시아 영화사",
                            "강의 시간": "3시간",
                            "학점": "3학점",
                            "내용": "세계 영화사 과목에서 미처 다루지 못했던 한국영화사를 그 기반으로 하는 동시에 일본, 중국, 태국, 인도네시아 및 아시아 권역 전반의 영화사를 통해 작금에 증대되는 아시아의 가치(Asian Value)를 아시아 영화사를 통해 조명해보는 동시에 아시아 필름마케팅의 연대와 네트워크를 구성하는데 매우 중요한 과목이다."
                        },
                        {
                            "과목 코드": "MAE4020(구 COM3303)",
                            "과목명": "세계연극사",
                            "강의 시간": "3시간",
                            "학점": "3학점",
                            "내용": "연극의 흐름과 변천을 역사적으로 고찰하여 다양한 형태의 공연과 연극형식 등을 이해하도록 한다."
                        },
                        {
                            "과목 코드": "MAE4021(구 COM3307)",
                            "과목명": "공연의미학과이론",
                            "강의 시간": "3시간",
                            "학점": "3학점",
                            "내용": "연극과 공연을 미학과 이론의 관점에서 이해하게 하여 비평과 작품창작의 기초가 되게 한다."
                        },
                        {
                            "과목 코드": "MAE4022(구 COM3310)",
                            "과목명": "영상기호학",
                            "강의 시간": "3시간",
                            "학점": "3학점",
                            "내용": "영상에서 재현되는 기호와 관련한 고찰을 제공한다."
                        },
                        {
                            "과목 코드": "MAE4023",
                            "과거코드": "COM3311",
                            "과목명": "연출입문",
                            "강의시간": "3시간",
                            "학점": "3학점",
                            "내용": "연극영화의 연출의 기초를 공부한다. 이를 위해 연출의 기본원리를 체계적으로 살펴보고, 이에 기초하여 짧은 장면들을 실제로 연출하는 연습을 한다."
                        },
                        {
                            "과목 코드": "MAE4024",
                            "과거코드": "COM3312",
                            "과목명": "장면연출(캡스톤 디자인)",
                            "강의시간": "3시간",
                            "학점": "3학점",
                            "내용": "연출의 기본 원리들을 익히고 다양한 연극 연출사례를 파악하는 한편, 학생들이 직접 장면을 무대화하는 실습 과정을 통해 공연 창작의 실천적 지식을 습득한다."
                        },
                        {
                            "과목 코드": "MAE4025",
                            "과거코드": "COM3319",
                            "과목명": "공연의기획과경영",
                            "강의시간": "3시간",
                            "학점": "3학점",
                            "내용": "공연산업의 경영과 기획의 이론과 실제를 고찰한다."
                        },
                        {
                            "과목 코드": "MAE4026",
                            "과거코드": "COM3325",
                            "과목명": "고급영화제작",
                            "강의시간": "3시간",
                            "학점": "3학점",
                            "내용": "단편영화제작을 이수한 학생들이 보다 발전된 단계에서 작품제작에 임할 수 있도록 한다. 따라서 작품선정에서 캐스팅 그리고 촬영과 편집에 이르는 전 과정이 보다 전문성을 갖고 진행된다."
                        },
                        {
                            "과목 코드": "MAE4027",
                            "과거코드": "COM3327",
                            "과목명": "공연제작실습",
                            "강의시간": "3시간",
                            "학점": "3학점",
                            "내용": "공연을 실제로 제작해볼 수 있는 실습 기회를 제공한다."
                        },
                        {
                            "과목 코드": "MAE4028",
                            "과거코드": "COM3328",
                            "과목명": "공연영상저널리즘캡스톤디자인",
                            "강의시간": "3시간",
                            "학점": "3학점",
                            "내용": "공연영상과 관련한 저널리즘적 고찰을 실무적이면서도 심층적으로 연습하는 것을 목적으로 한다."
                        },
                        {
                            "과목 코드": "MAE4030",
                            "과거코드": "COM3333",
                            "과목명": "뮤지컬창작심화(캡스톤디자인)",
                            "강의시간": "3시간",
                            "학점": "3학점",
                            "내용": "작곡가와 협업하여 90분 이상의 뮤지컬 대본을 완성하고, 쇼케이스 워크샵을 시연한다."
                        },
                        {
                            "과목 코드": "MAE4031",
                            "과거코드": "COM3403",
                            "과목명": "디지털방송론",
                            "강의시간": "3시간",
                            "학점": "3학점",
                            "내용": "방송환경의 디지털화에 따른 다양한 이슈를 제작, 배급/유통, 이용/시청의 관점에 다차원적으로 접근하고 이의 사회적 함의를 논의한다."
                        },
                        {
                            "과목 코드": "MAE4032",
                            "과거코드": "COM3411",
                            "과목명": "디지털미디어정책론",
                            "강의시간": "3시간",
                            "학점": "3학점",
                            "내용": "디지털미디어의 산업구조와 정책의 동향을 다루고, 주요국의 현황을 고찰한 후 한국사회에 있어서 각 매체별 산업을 제도적으로 규정짓는 정책에 대한 문제점과 그 대응방안을 모색한다."
                        },
                        {
                            "과목 코드": "MAE4033",
                            "과거코드": "COM3418",
                            "과목명": "매체미학",
                            "강의시간": "3시간",
                            "학점": "3학점",
                            "내용": "방송 및 영상 미디어의 필수적인 미학 요소의 구조와 영역에 대한 연구, 즉 빛과 색의 기능과 구성, 면과 공간의 깊이와 구조, 음향시간, 그리고 움직임의 구조 등을 연구한다."
                        },
                        {
                            "과목 코드": "MAE4035",
                            "과거코드": "COM3428",
                            "과목명": "모바일커뮤니케이션",
                            "강의시간": "3시간",
                            "학점": "3학점",
                            "내용": "모바일 미디어의 정의, 역사를 살펴보고 모바일 미디어가 대인관계, 조직, 사회에서 어떠한 영향을 미치며 어떠한 기능을 하고 있는지를 다양하게 알아본다. 갈수록 진화하고 있는 모바일 미디어를 둘러싼 다양한 이슈와, 이와 관련된 주요 이론을 연구한다. 모바일 미디어 CPND 생태계에서 각각의 특성을 분석하고 다양한 발전 형태에 대한 사례를 알아본다."
                        },
                        {
                            "과목 코드": "MAE4036",
                            "과거코드": "COM3434",
                            "과목명": "디지털미디어기업.경영컨설팅",
                            "강의시간": "3시간",
                            "학점": "3학점",
                            "내용": "미디어 기업 지식과 기업 경영 지식을 융합한 과목으로, 기업의 전략 개발, 조직/인사 설계, 회계/재무 이해, 시장 분석과 마케팅, 신사업 기안, 사업 계획서 개발, 전략적 제휴 등의 기술을 배우며 디지털미디어 산업의 기업경영에 대해 이론과 실제의 괴리를 이해하고 적극적으로 준비할 수 있도록 한다."
                        },
                        {
                            "과목 코드": "MAE4037",
                            "과거코드": "COM3435",
                            "과목명": "가상현실콘텐츠기획제작",
                            "강의시간": "3시간",
                            "학점": "3학점",
                            "내용": "오늘날 미디어 환경의 변화로 인해 급부상하고 있는 가상현실 콘텐츠에 대해서 이론적인 측면에서 접근하며, 이를 토대로 기획하고 제작할 수 있는 능력을 배양하는 기회를 제공하도록 한다. 이 과목의 수강을 통해 변화하는 미디어 환경에 걸맞은 넓고 깊은 시각을 가질 수 있도록 한다."
                        },
                        {
                            "과목 코드": "MAE4038",
                            "과거코드": "COM3438",
                            "과목명": "게임커뮤니케이션",
                            "강의시간": "3시간",
                            "학점": "3학점",
                            "내용": "게임이라는 매체 자체의 특징과 가능성들을 커뮤니케이션과 미디어학적인 측면에서 접근하여 연구해 본다."
                        },
                        {
                            "과목 코드": "MAE4039",
                            "과목명": "나노디그리심화워크숍(미디어기업전략경영)",
                            "강의시간": "총 6시간",
                            "학점": "0학점",
                            "내용": "본 과목은 [미디어기업전략경영] 나노디그리 취득을 위한 필수 과목이며, 본 심화워크숍에서는 다양한 분야의 미디어 산업에 종사하는 전문가를 초빙하여 미디어 기업의 전략적 운영에 대한 현장 기반의 전문 지식을 습득하는 기회를 가진다."
                        },
                        {
                            "과목 코드": "MAE4040",
                            "과목명": "실험연극의 발전",
                            "강의시간": "3시간",
                            "학점": "3학점",
                            "내용": "20세기 중반 이후부터 현재에 이르는 연극적 실험 성과를 연구함으로써 오늘날 연극의 본질과 존재 의미, 그리고 대안적 무대 창작 방식의 가능성에 대해 실천적으로 고민하고 토론하는 시간을 마련한다."
                        },
                        {
                            "과목 코드": "MAE4041",
                            "과목명": "메타버스 기획론",
                            "강의시간": "3시간",
                            "학점": "3학점",
                            "내용": "인공지능과 메타버스를 중심으로 펼쳐질 새로운 시대는 새로운 인재를 요구한다. 메타버스 패러다임이 요구하는 창의력과 비즈니스 역량, 그리고 기술역량을 겸비한 기획 인재를 길러냄이 이 과목의 목표이다."
                        },
                        {
                            "과목 코드": "MAE4042",
                            "과목명": "크리에이티브 웹툰 제작(캡스톤 디자인)",
                            "강의시간": "3시간",
                            "학점": "3학점",
                            "내용": "미디어 생태계 내에서의 웹툰 산업에 대해 전반적으로 이해하고, 웹툰 제작을 위한 기본적인 이론에 대해 학습함, 이론적 지식을 기반으로 실제 웹툰을 기획하고 제작하여 개인별 웹툰 작품을 학기 말에 최종적으로 제출하여 웹툰 작가로부터 피드백을 받음"
                        },
                        {
                            "과목 코드": "MAE4043",
                            "과목명": "가상인간의 상호작용의 이해와 응용",
                            "강의시간": "3시간",
                            "학점": "3학점",
                            "내용": "인공지능과 컴퓨터 그래픽 기술의 발전으로 미디어 이용자는 가상인간과의 상호작용 기회가 확대되고 있다. 가상인간은 챗봇이나 소셜미디어 인플루언서, 가상환경에서의 NPC (Non-Player Character) 등의 여러 형태를 띠고 있으며 창조 목적에 따라 주어진 역할을 수행한다. 본 과목은 가상인간에 대한 이용자의 반응을 사회인지학적 관점에서 이해하고 교육, 오락, 심리상담 등의 다양한 영역에서의 활용 가능성을 탐색하는 것을 목적으로 한다."
                        },
                        {
                            "과목 코드": "MAE4590",
                            "과목명": "공연영상현장실습(계절)",
                            "강의 시간": "3시간"
                        },
                        {
                            "과목 코드": "MAE4690",
                            "과목명": "디지털미디어/콘텐츠현장실습(계절)",
                            "강의 시간": "3시간",
                            "학점": "3학점",
                            "내용": "본 교과목은 미디어&엔터테인먼트학과 학생들에게 학교에서 배우는 디지털 미디어 과목에서 다루어진 이론 및 지식들을 현장과 밀접하게 연계시키고, 이를 통해 현장 적응력과 경쟁력을 제고시킴을 그 목적으로 한다."
                        }
                    ],
                    " Sogang International Summer Program (SISP)": [
                        {
                            "과목 코드": "MAE9000",
                            "과목명": "Understanding Contemporary Korean Cinema",
                            "강의 시간": "3시간",
                            "학점": "3학점",
                            "내용": "This class is designed to introduce students to contemporary Korean culture and history through cinema. By watching and discussing two films per week, it seeks to provide a broad purview Rather than offering a mere compilation of factual knowledge, however, it seeks to challenge common assumptions about Korean Culture being ‘Totally Unique’ or ‘Absolutely Other.’ To Gwangju Massacre, Confucianism, comfort women, crisis of masculinity and the rise of feminism, and last but not least, globalization, focusing on heated debates and recent controversies about them. Set against this backdrop, your understanding of contemporary Korea and Korean Cinema, this class would never be the same."
                        },
                        {
                            "과목 코드": "MAEG302",
                            "과목명": "캐릭터연구",
                            "강의 시간": "3시간",
                            "학점": "3학점",
                            "내용": "융의 분석심리학을 기본으로 캐릭터의 유형을 학습하고, 고전 및 현대 작품, 신화 및 역사 속 캐릭터들을 분석하며, 작품 창작을 위한 캐릭터 구축 방법론을 탐구한다."
                        },
                        {
                            "과목 코드": "MAEG401",
                            "과목명": "디지털콘텐츠 캡스톤 디자인 프로젝트",
                            "강의 시간": "3시간",
                            "학점": "3학점",
                            "내용": "영상제작 심화 과목으로서 다양한 영상 이론과 기술을 실제 제작에 적용시키며 방송용 전문 프로그램 제작을 위한 다양한 역할을 훈련하는 기회로 삼는다. 따라서 학생들은 preproduction, production 그리고 postproduction에 이르는 전 과정에 직접 참여해서 수준 높은 작품을 제작한다."
                        },
                        {
                            "과목 코드": "MAEG402",
                            "과목명": "영상미학 캡스톤 디자인",
                            "강의 시간": "3시간",
                            "학점": "3학점",
                            "내용": "컨텐츠의 가장 기본인 영상제작의 이론에서 실제 제작까지 다루는 과목이다. 영상 컨텐츠 기획, 연출, 촬영, 편집에 이르는 전 과정을 실질적으로 매스터하고 이를 온라인(유튜브 등)에 노출시키는 경험은 이제는 대학생들에게 기본적 소양이 되고 있다. 이를 기반으로 창.취업에 필요한 영상 포트폴리오를 준비할 수 있으며, 실제로 이런 훈련을 통해 마련된 졸업생들의 포트폴리오는 성공적 창.취업에 매우 유효한 툴로 지속적으로 입증되고 있다."
                        },
                        {
                            "과목 코드": "MAEG403",
                            "과목명": "소셜 빅데이터 분석론",
                            "강의 시간": "3시간",
                            "학점": "3학점",
                            "내용": "소셜 데이터 기반의 사회 관계망 분석에서 감정 분석에 이르는 이론 및 실제를 다루는 과목이다. 관계망 분석과 감정 분석은 사회과학적 이론 및 방법론 훈련은 물론 통계, 컴퓨터 프로그래밍 등에 대한 지식이 동시에 요구된다. 이런 다학제적 역량을 통해 빅데이터 분석가로 길러지게 된다."
                        },
                        {
                            "과목 코드": "MAEG404",
                            "과목명": "디지털미디어데이터분석론",
                            "강의 시간": "3시간",
                            "학점": "3학점",
                            "내용": "디지털 미디어를 활용한 다양한 서비스의 수용 및 이용을 결정하는 요인에 대해 파악하고, 다양한 분석 기법을 활용하여 예측모델을 구축하는 방법을 습득한다. 전통적인 사회통계 기법과 머신 러닝/딥러닝 알고리즘을 활용하여 예측모델을 구축하는 방법을 학습한다. 학습한 기법을 디지털미디어 데이터 분석에 적용하여 프로젝트를 수행한다."
                        }
                    ]
                }
            },
            "Art & Technology": {
                "과목 정보": {
                    "AAT2002": {
                        "과목 코드": "AAT2002",
                        "선수과목": "ANT2003",
                        "과목명": "Humanities & Creativity",
                        "학점": 3,
                        "내용": "This course aims to approach topics of humanities while cultivating students’ creativity. With various activities, discussions and performance projects, students will explore their “being-in-the-world” through artistic creation."
                    },
                    "AAT2003": {
                        "과목 코드": "AAT2003",
                        "선수과목": "ANT2004",
                        "과목명": "Intro to Digital Arts",
                        "학점": 3,
                        "내용": "This course introduces students develop basic skills to convey and articulate complex and abstract ideas and personal expression into digital visual forms. Students will learn the digital visual expressions that is basic skills in digital creations through lectures, hands-on practice, and group critique. During the class, they will explore different materials, techniques, and themes, grounded in detailed observation and free imagination. For the final project, students will be encouraged to apply further contemporary experimentation responding to his/her own style."
                    },
                    "AAT2004": {
                        "과목 코드": "AAT2004",
                        "선수과목": "ANT2010",
                        "과목명": "Intro to Creative Computing",
                        "학점": 3,
                        "내용": "In this course, students will be introduced to using a computer as a creative medium. Students will learn how to use a computer for visual arts and designs. Topics include how to program images, animation, and interactivity. Fundamentals of computer programming (variables, repetition, functions, selection, object-oriented programming, etc.) will be taught. This course will use Processing and JavaScript as main programming languages."
                    },
                    "AAT2005": {
                        "과목 코드": "AAT2005",
                        "선수과목": "ANT4020",
                        "과목명": "Creative Capstone Project Ⅰ",
                        "학점": 3,
                        "내용": "This is part I of two-semester long creative capstone graduation projects. The aims of this course is to develop creative content, product, or service that has high degree of completion, meets sensitivity of consumers, and improves value of one's life. Each project group chooses a project that is proposed by institutions, companies, or students themselves. And they should perform overall process containing planning, design, production, and marketing. The final outcome will be shown to publics in the form of exhibition, performance and others."
                    },
                    "AAT2006": {
                        "과목 코드": "AAT2006",
                        "선수과목": "ANT4013",
                        "과목명": "Creative Capstone Project Ⅱ",
                        "학점": 3,
                        "내용": "This course is part Ⅱ of two-semester long graduation projects to develop creative content, product, or service that has high degree of completion, meets sensitivity of consumers, and improves the value of one's life. Each project group chooses a project that is proposed by companies, institutions, or students themselves. Students have to perform overall processes of planning, design, and production. The final outcome will be shown to publics in the form of exhibition, performance, or others."
                    },
                    "AAT2007": {
                        "과목 코드": "AAT2007",
                        "과목명": "Fundamentals of Still & Moving Images",
                        "학점": 3,
                        "내용": "Generally, the basis unit of a moving image is a short. However, this course explores the experimental methods of producing a moving image by the temporal and spatial arrangement of still images. Students will understand the various artists’ film and video practices originated from handmade cinema."
                    },
                    "AAT2008": {
                        "과목 코드": "AAT2008",
                        "과목명": "Foundations of Human-Computer Interaction",
                        "학점": 3,
                        "내용": "This course introduces principles and methods for human-computer interaction design. Human-computer interaction (HCI) is a multi-disciplinary field of study focusing on the design of interaction between humans and computers based on cognitive science, social science, and design. This course will focus on how the properties of the interface can be designed to serve the needs of the user and our society. Students will use prototyping tools to build functional prototypes and evaluate them."
                    },
                    "AAT2009": {
                        "과목 코드": "AAT2009",
                        "과목명": "Interactive Storytelling",
                        "학점": 3,
                        "내용": "The purpose of this course is to learn how users or audiences can interact with content using media. Therefore, in this class, the entire process of interactive content meeting with audiences and users through exhibition spaces, movie screens, or various platforms will be covered."
                    },
                    "AAT3002": {
                        "과목 코드": "AAT3002",
                        "선수과목": "ANT2002",
                        "과목명": "Content Planning & Development",
                        "학점": 3,
                        "내용": "This course introduces principles and techniques for planning and developing digital content. The course is intended to help students become successful content planners and managers."
                    },
                    "AAT3003": {
                        "과목 코드": "AAT3003",
                        "선수과목": "ANT2009",
                        "과목명": "Digital Fabrication (캡스톤디자인)",
                        "학점": 3,
                        "내용": "This course introduces the fundamental digital fabrication skills that enable students to create tangible prototypes. Students can learn through building creative projects using Arduino with useful electronic components, sensors and actuators for bringing their creative ideas to the real tangible working prototypes. Furthermore the students also can learn about how to translate of digital designs into physical objects using computer-controlled machine such as 3D printer, laser cutter, PCB router for the fast prototyping designs of circuit, case design and mechanical structure."
                    },
                    "AAT3004": {
                        "과목 코드": "AAT3004",
                        "선수과목": "ANT2011",
                        "과목명": "Intro to Sonic Art",
                        "학점": 3,
                        "내용": "This course investigates the artistic practices to utilize sound as materials. The topics are voice, improvisational performance, spatial structure, specific place, instrument, recording, sampling and mixing, and album and distribution. Students will examine the contemporary practices to produce sound on an alternative way and to traverse the boundary between temporal and spatial arts."
                    },
                    "AAT3005": {
                        "과목 코드": "AAT3005",
                        "선수과목": "ANT2015",
                        "과목명": "Visual Design",
                        "학점": 3,
                        "내용": "This design fundamental course introduces ideas, methodologies, principles, and skills that comprise a common knowledge base important to all design disciplines. These fundamentals including color, shape, texture, space, form, balance, hierarchy, etc foster a multidisciplinary design experience among students and prepare them to move to the next level."
                    },
                    "AAT3007": {
                        "과목 코드": "AAT3007",
                        "선수과목": "ANT2017",
                        "과목명": "Network Media",
                        "학점": 3,
                        "내용": "The web is the most popular interactive medium and evolving into a universal medium for communication, computing, and creative expression. In this course, students will be introduced to the fundamental modern network media technologies HTML5, CSS3, and JavaScript to develop creative content and service on the web."
                    },
                    "AAT3008": {
                        "과목 코드": "AAT3008",
                        "선수과목": "ANT3016",
                        "과목명": "Creative Algorithms",
                        "학점": 3,
                        "내용": "This course introduces students to fundamental computer algorithms for creative applications. This course comprises two parts. In the first part, wide range of creative algorithms will be introduced in five themes: Repetition, Parameterization, Transform, Visualization, and Simulation. Specific topics include Generative Design, Recursion, L-System, Slitscanning, Trans-Coding, Data Visualization, Particle System, Genetic Algorithms, Cellular Automata, etc. The second part of the course focuses on machine learning algorithms for creative applications. Students will learn computational processes of various machine learning algorithms such as k-NN, Decision Tree, Neural Networks, SVM, Linear/polynomial Regression, etc. Through hands-on workshops, they will learn how to apply the various algorithms for creative applications in practice."
                    },
                    "AAT3009": {
                        "과목 코드": "AAT3009",
                        "선수과목": "ANT3017",
                        "과목명": "Sound Production",
                        "학점": 3,
                        "내용": "This course introduces the principles and techniques of producing sound. Students will learn the fundamental theories and techniques of sound synthesis using audio programming language. Prerequisite: AAT3004(prev. ANT2011) Intro to Sonic Art or equivalent."
                    },
                    "AAT3010": {
                        "과목 코드": "AAT3010",
                        "선수과목": "ANT4001",
                        "과목명": "Visual Story",
                        "학점": 3,
                        "내용": "This class is mainly designed to make short films such as fiction, documentary, animation, video arts and diverse media arts. Therefore, each student will make a short film for his/her own final project. Filmmaking is totally based on how to discover creative idea and develop it for a good story telling. This is called “content” as a screenplay. Students will learn to discover great ideas and develop original stories throughout this course. Finally, students will carry their own story in film production as well as learn about what cinema language is through the short film production."
                    },
                    "AAT3015": {
                        "과목 코드": "AAT3015",
                        "선수과목": "ANT3012",
                        "과목명": "3D Modeling",
                        "학점": 3,
                        "내용": "This course introduces the principles and techniques of 3D modeling. Topics include polygon based modeling, texture mapping, human body modeling, character modeling, lighting and rendering."
                    },
                    "AAT3016": {
                        "과목 코드": "AAT3016",
                        "선수과목": "ANT3014",
                        "과목명": "UI/UX Design (캡스톤디자인)",
                        "학점": 3,
                        "내용": "This course provides a comprehensive overview of the user interface and user experience design process, and is intended to familiarize students with the concepts and techniques necessary to make user interface and user experience design an integral part of developing media interfaces. The course provides students with an opportunity to acquire the skills and hands-on experience they need to design, develop, and evaluate media interfaces from a user-centered design perspective."
                    },
                    "AAT3018": {
                        "과목 코드": "AAT3018",
                        "과목명": "Cinematography & Editing (25-1 폐지)",
                        "학점": 3,
                        "내용": "This course focuses on the technical skills and creative principles required for camera shooting and post production. Topics include video recording, compositing, lighting, continuity, and editing. Students will complete some moving image works through hands-on exercises, projects, and assignments."
                    },
                    "AAT3019": {
                        "과목 코드": "AAT3019",
                        "과목명": "Data Visualization",
                        "학점": 3,
                        "내용": "This course provides foundations necessary to understand and create effective visualizations. Topics include principles from graphics design, visual art, interaction techniques, and cognitive science."
                    },
                    "AAT3021": {
                        "과목 코드": "AAT3021",
                        "과목명": "나노디그리심화워크숍(메타버스)",
                        "학점": 0,
                        "내용": "나노디그리심화워크숍(메타버스) 과목은 메타버스 나노디그리를 취득하기 위한 필수 과목으로, 본 과목은 단기 집중 워크샵 과정을 통해 메타버스 환경 구현에 필요한 전문 지식과 경험을 메타버스 영역 현장 전문가들에게 배우는 워크숍입니다. 이를 통해 학생들은 메타버스 구현에 필요한 실무적 지식을 전수 받을 수 있을 것으로 기대하고 있습니다."
                    },
                    "AAT3020": {
                        "과목 코드": "AAT3020",
                        "과목명": "Natural Language Processing",
                        "학점": 3,
                        "내용": "This course introduces fundamentals of natural language processing utilizing machine learning and neural networks within the context of arts, design, and creative applications. Students will gain a mathematical foundation as well as programming skills in order to understand and implement various NLP models and machine learning in general."
                    },
                    "AAT3022": {
                        "과목 코드": "AAT3022",
                        "과목명": "Speculative Design",
                        "학점": 3,
                        "내용": "This course introduces students to speculative design methods for exploring the personal and societal impacts of emerging technologies. Through creative approaches to design future, undergraduate students will acquire methods to shape technologies with a focus on positive societal change."
                    },
                    "AAT4001": {
                        "과목 코드": "AAT4001",
                        "선수과목": "ANT2005",
                        "과목명": "Computer Graphics",
                        "학점": 3,
                        "내용": "In the course, students will learn the fundamental concepts and techniques of computer graphics. Topics include geometries, transform, camera, light, texture, shader programming, and animation. At the end of the semester, students will develop a creative interactive 3D computer graphics applications (interactive art, visualization, games, etc.). Processing, WebGL, and GLSL will be used for programming."
                    },
                    "AAT4002": {
                        "과목 코드": "AAT4002",
                        "선수과목": "ANT3003",
                        "과목명": "Advanced Web Development (캡스톤디자인)",
                        "학점": 3,
                        "내용": "This course introduces students to full stack web development. In addition to client side web programming, the course will focus on server side programming of the web and the students will learn how to handle web frameworks during the course.",
                        "Prerequisite": "AAT3007(prev. ANT2017) or equivalent."
                    },
                    "AAT4004": {
                        "과목 코드": "AAT4004",
                        "선수과목": "ANT3008",
                        "과목명": "Interactive Media Arts",
                        "학점": 3,
                        "내용": "This course explores the creative possibilities of technology and interactivity. students will have theoretical understanding about interactivity and hands-on experiences with tools for producing projects. Students will learn historical and current cases of interactive arts and study the cultural effects of interactive technology by looking at literary studies, performance studies, and fine arts. Students will implement interactivity in individual media art projects using various tools such as Unity, MAX, Processing, sensors, etc."
                    },
                    "AAT4005": {
                        "과목 코드": "AAT4005",
                        "선수과목": "ANT3009",
                        "과목명": "Games & Interactive Media",
                        "학점": 3,
                        "내용": "This is an introductory course for computer game and other interactive media development. Students will learn the principles and techniques required for developing successful game and interactive media using real-time game engines."
                    },
                    "AAT4006": {
                        "과목 코드": "AAT4006",
                        "선수과목": "ANT3010",
                        "과목명": "3D Animation",
                        "학점": 3,
                        "내용": "This course introduces the principles and techniques for making 3D computer animation. It covers principles of motion, staging and editing action, rigging, morphing, camera, lighting, inverse kinematics, etc.",
                        "Prerequisite": "AAT3015(ANT3012) 3D modeling or equivalents."
                    },
                    "AAT4007": {
                        "과목 코드": "AAT4007",
                        "선수과목": "ANT4004",
                        "과목명": "Advanced Interactive Storytelling",
                        "학점": 3,
                        "내용": "This course, as a higher level course of the interactive storytelling course, aims to further expand the interaction of media through VR, AR, XR, or any other new media technologies to meet users. Therefore, this course is not limited to the production stage, but is designed as a course to understand and create various experimental interactive contents."
                    },
                    "AAT4008": {
                        "과목 코드": "AAT4008",
                        "선수과목": "ANT4007",
                        "과목명": "Visual Effects",
                        "학점": 3,
                        "내용": "This course introduces the fundamental principles and techniques of visual effects. Students will learn the concept and the workflow as well as the practical skill required for making visual effects used in cinema."
                    },
                    "AAT4011": {
                        "과목 코드": "AAT4011",
                        "선수과목": "ANT4012",
                        "과목명": "Immersive Media",
                        "학점": 3,
                        "내용": "This course provides students with principles and techniques for immersive media design and development. Students will be introduced to history of immersive media, theory on immersion, technologies and designs for immersion. Storytelling in immersive media will be emphasized and students will learn by conducting a series of immersive media projects.",
                        "Prerequisites": "AAT4005(ANT3009) Games & Interactive Media or equivalents."
                    },
                    "AAT4012": {
                        "과목 코드": "AAT4012",
                        "선수과목": "ANT4015",
                        "과목명": "Internship",
                        "학점": 3,
                        "내용": "This internship course is designed to provide students with professional experience in creative industries. Students are expected to work for at least 4 weeks as a full-time at a company or institution during summer or winter session."
                    },
                    "AAT4019": {
                        "과목 코드": "AAT4019",
                        "과목명": "Internship Ⅱ",
                        "학점": 3,
                        "내용": "This internship course is designed to provide students with professional experience in creative industries. Students are expected to work for at least 4 weeks as a full-time at a company or institution during summer or winter session."
                    },
                    "AATG001": {
                        "과목 코드": "AATG001",
                        "과목명": "Metaverse: Design & Development (캡스톤디자인)",
                        "학점": 3,
                        "내용": "This course is an introduction to the design and development of a Metaverse. Students will learn technologies of constructing and navigating 3D virtual worlds in the context of a Metaverse including the creation of 3D avatars"
                    },
                    "AATG009": {
                        "과목 코드": "AATG009",
                        "선수과목": "AAT4009, ANT4008",
                        "과목명": "Physical Computing",
                        "학점": 3,
                        "내용": "In this course, students learn how to design a system for the physical Human-Computer interaction between a user and a computer. Students study the basic concepts and programming of computer interfaces with electronic circuits, physical sensors, lighting, and mechanical devices, and plan and implement media systems or artworks based on visual, auditory, and mechanical interactions."
                    },
                    "AATG010": {
                        "과목 코드": "AATG010",
                        "과목명": "Generative AI",
                        "학점": 3,
                        "내용": "In this course, students explore the fundamental principles and practical applications of generative artificial intelligence (Generative AI). The curriculum covers key topics, including variational autoencoders (VAEs), generative adversarial networks (GANs), diffusion models, and large language models (LLMs). Students will gain a deep understanding of each generative model and implement these concepts using Python and PyTorch framework."
                    },
                    "AATG013": {
                        "과목 코드": "AATG013",
                        "선수과목": "AAT4013",
                        "과목명": "Deep Learning & Computer Vision",
                        "학점": 3,
                        "내용": "This course introduces fundamental principles of deep learning and computer vision. It focuses chiefly on deep neural network (DNN) and its models for solving computer vision problems. Topics include data manipulation, regularization, optimization, convolutional neural network (CNN), image classification, object detection, and basic generative adversarial network (GAN). We will develop the intuitions in class, and then implement models in projects."
                    },
                    "AATG015": {
                        "과목 코드": "AATG015",
                        "과목명": "Deep Learning for Music & Audio",
                        "학점": 3,
                        "내용": "This course introduces deep learning programming for handling music and audio signal including a basic introduction to digital signal processing. Students will learn about how to apply deep learning for music and audio data, such as auto-tagging or sound synthesis."
                    },
                    "AATG100": {
                        "과목 코드": "AATG100",
                        "과목명": "Future Cinema (25-1 폐지)",
                        "학점": 3,
                        "내용": "This course introduces the use of cutting-edge technologies in the cinema, which is undergoing major changes in both content and format as various advanced creative technologies are developed. Students will study new types of cinematic images produced with new technologies which go beyond the traditional concept of projecting images on a screen allowing the audience to directly participate in the content in a space outside the theatre."
                    },
                    "AATG102": {
                        "과목 코드": "AATG102",
                        "과목명": "Audio Visual Performance",
                        "학점": 3,
                        "내용": "The act of projection is at the heart of cinema and media art. This theory and practice course explores the possibilities of the alternative exhibition for projected image and sound focusing on performance. Students will experiment with a wide variety of audiovisual strategies, complemented by related readings, screenings, and exhibitions. The technical, historical, and aesthetical aspects of the projected image and sound will be studied in order to reinvent cinema and investigate how the projected image can find meaning outside the black box of theaters or the white cube of galleries."
                    },
                    "AATG104": {
                        "과목 코드": "AATG104",
                        "과목명": "Media Aesthetics",
                        "학점": 3,
                        "내용": "In this class, students will study the artistic practices of deconstructing and reconstructing the materiality and historicity of the medium by understanding the technical characteristics of the medium and analyzing the socialization process of the medium."
                    },
                    "AATG106": {
                        "과목 코드": "AATG106",
                        "과목명": "Generative Audio Visualization",
                        "학점": 3,
                        "내용": "This course introduces students to the generative arts. Students will acquire methods for creating new audio and/or visual artworks using algorithms and autonomous process."
                    },
                    "AATG800": {
                        "과목 코드": "AATG800",
                        "과목명": "Creative Entrepreneurship",
                        "학점": 3,
                        "내용": "This course surveys entrepreneurship in creative industry to increase understanding of how digital innovations grow into societal change. It will explore a range of business models and opportunities in creative industry."
                    }
                }
            }
        }
    }
}