{
    "2025 서강대학교 요람": {
        "서강대학교 전인(全人) 교육과정": {
            "교양 교육과정": {
            "과목 정보": {
                "공통필수교과": [
                    {
                        "과목 코드": "COR1007",
                        "과목명": "성찰과 성장",
                        "이론/실습": "1시간",
                        "평가": "S/U 평가",
                        "학점": "1학점",
                        "내용": "이 과목은 1학년을 대상으로 하는 교양 필수 과목입니다. 이 과목은 개인이 겪은 청소년기와 서강대학교의 새내기가 되어 지낸 시간을 성찰하도록 도와줍니다. 본 과목을 통해 수강생들은 독립적이고 자유로운 청년으로 스스로를 인식하고, 일상을 지속적으로 성찰할 수 있는 능력을 키웁니다."
                    },
                    {
                        "과목 코드": "COR1016~COR1034",
                        "과목명": "알바트로스 세미나",
                        "강의": "1시간",
                        "평가": "S/U 평가",
                        "학점": "1학점",
                        "내용": "입학 초에 학교에 대한 긍지와 자부심을 북돋우고, 대학 학문의 연착륙과 대학생활 적응을 도우며, 전공 탐색과 진로 설계를 통한 성공적인 대학생활이 될 수 있도록 신입생 전체 공통교육들과 전공별 특성에 따른 전공교육 프로그램들로 진행된다. 단과대학별, 학과별 과목코드 구분을 확인하고 수강신청하여야 한다."
                    },
                    {
                        "과목 코드": "COR1010",
                        "과목명": "기초인공지능프로그래밍",
                        "강의": "3시간",
                        "학점": "3학점",
                        "내용": "본 과목에서는 학생 자신이 직접 작성한 프로그래밍을 통해 다양한 빅데이터에 대한 분석이 가능하도록 하기 위하여, Python 언어를 이용한 기초 SW 프로그래밍 개념과 기본적인 문법을 소개하고, 데이터 과학 영역에서 많이 사용되는 라이브러리를 실습을 통해 빅데이터를 인공지능 기법을 이용하여 처리할 수 있는 능력을 배양하도록 한다. 또한, 단과대별 특성을 반영하고 학생들의 흥미를 유발하는 기초 인공지능 빅데이터 처리 프로그래밍을 하기 위해, Numpy, Pandas, R 등 빅데이터 처리 라이브러리를 이용한 기본 처리 방법을 소개한다."
                    },
                    {
                        "과목 코드": "COR1012",
                        "과목명": "인문사회 글쓰기",
                        "강의": "3시간",
                        "학점": "3학점",
                        "내용": "본 교과목은 서강대학교 인문계열, 사회계열, 경상계열에 입학한 1학년생들을 대상으로, 현대사회의 주요 문제들을 깊이 있게 생각하고 그것을 자신만의 언어로 비판적으로 표현할 수 있는 글쓰기 능력을 길러주는 것을 목적으로 한다."
                    },
                    {
                        "과목 코드": "COR1013",
                        "과목명": "자연계 글쓰기",
                        "강의": "3시간",
                        "학점": "3학점",
                        "내용": "본 교과목은 서강대학교 이공계열에 입학한 1학년 학생들을 대상으로, 전공과 관련된 제반 과학적 지식을 올바른 한국어로 표현하여 전달할 수 있는 글쓰기 능력을 갖추도록 하기 위한 교과목이다."
                    },
                    {
                        "과목 코드": "LLA1001",
                        "과목명": "Introduction to Korean Culture",
                        "강의": "3시간",
                        "학점": "3학점",
                        "내용": "This course introduces the main aspects and themes of Korean culture to international students starting higher education programmes in Korea. This course aims to help overseas students gain a better understanding of Korean culture and society."
                    },
                    {
                        "과목 코드": "LLA1002",
                        "과목명": "College Life and Academic Exploration",
                        "강의": "3시간",
                        "학점": "3학점",
                        "내용": "This is a compulsory course offered to international students in their second semester at Sogang University. This class aims to provide a springboard for understanding and adapting to university life and academic studies in Korea by exploring the following topics together. A. Courses individual students will take to follow their curriculum. B. Activities students can participate in on and off campus. C. Academic and non-academic communication skills students need at Sogang D. Planning a meaningful vacation."
                    },
                    {
                        "과목 코드": "COR1003",
                        "과목명": "영어글로벌 의사소통 I",
                        "강의": "3시간",
                        "학점": "3학점",
                        "내용": "영어 말하기와 듣기의 기본 능력을 배양한다. 전계열 공통의 실용 회화를 내용으로 외국인과 의사소통이 가능할 정도로 말하기, 듣기 수준을 향상시킨다."
                    },
                    {
                        "과목 코드": "COR1005",
                        "과목명": "영어글로벌 의사소통 I (고급)",
                        "강의": "3시간",
                        "학점": "3학점",
                        "내용": "영어 언어 문화권에 거주한 경험이 있거나 영어 실력이 상대적으로 높은 학생을 대상으로 수준 높은 영어 학습을 통해 토론, 발표 및 작문 능력을 향상시킨다.",
                        "비고": "고급수준의 영어능력을 갖춘 학생은 고급과목 이수"
                    },
                    {
                        "과목 코드": "LCS2001",
                        "과목명": "독일 언어와 문화 I",
                        "강의": "3시간",
                        "학점": "3학점",
                        "내용": "기본 독어의 습득과 연습을 통하여 독일사회의 문화에 대한 이해를 목표로 한다."
                    },
                    {
                        "과목 코드": "LCS2003",
                        "과목명": "프랑스 언어와 문화 I",
                        "강의": "3시간",
                        "학점": "3학점",
                        "내용": "기초적인 프랑스어 회화에 필요한 말하기, 읽기, 듣기, 쓰기 등 언어적 기능과 프랑스인의 사고방식, 제도, 풍속 등 문화적인 지식을 함께 공부한다. 언어 구조의 바탕에 깔려있는 프랑스인의 문화적 코드에 대한 올바른 이해를 통해 보다 실제적인 의사소통능력을 함양하고자 한다."
                    },
                    {
                        "과목 코드": "LCS2005",
                        "과목명": "중국 언어와 문화 I",
                        "강의": "3시간",
                        "학점": "3학점",
                        "내용": "중국어와 중국을 처음 접하는 학생들이 중국어 기초와 기본 문장 구조 등을 습득하고 이를 통하여 중국 문화를 이해하도록 한다."
                    },
                    {
                        "과목 코드": "LCS2007",
                        "과목명": "일본 언어와 문화 I",
                        "강의": "3시간",
                        "학점": "3학점",
                        "내용": "일본어와 일본을 처음 접하는 학생들이 일본어 말하기, 읽기의 기초를 습득하고 이를 통하여 일본 문화를 이해하도록 한다."
                    },
                    {
                        "과목 코드": "LCU4021",
                        "과목명": "초급 라틴어",
                        "강의": "3시간",
                        "학점": "3학점",
                        "내용": "서구어 문학의 축을 이루는 라틴어에 대한 초보적 지식과 문법을 익혀 로마 고전에 대한 감각을 기르도록 준비시키고, 학생들이 전공하는 서구 관련 학문 연구의 토대를 마련한다."
                    },
                    {
                        "과목 코드": "LCU4025",
                        "과목명": "초급 이탈리아어",
                        "강의": "3시간",
                        "학점": "3학점",
                        "내용": "이탈리아어의 초급과정으로 기본적인 언어 능력과 기초적 문장 구조를 다룬다."
                    },
                    {
                        "과목 코드": "LCU4030",
                        "과목명": "초급 스페인어",
                        "강의": "3시간",
                        "학점": "3학점",
                        "내용": "스페인어의 초급과정으로 기본적인 언어능력과 기초적 문장구조를 다룬다."
                    },
                    {
                        "과목 코드": "LCU4035",
                        "과목명": "초급 러시아어",
                        "강의": "3시간",
                        "학점": "3학점",
                        "내용": "러시아어의 초급과정으로서 포괄적 언어능력 및 문장 이해의 기초적인 능력을 습득하게 한다."
                    },
                    {
                        "과목 코드": "LCU4105",
                        "과목명": "초급 아랍어",
                        "강의 시간": "3시간",
                        "학점": "3학점",
                        "내용": "아랍어를 처음 배우는 학습자를 위한 교과목으로 아랍어 문자 익히기, 쓰기, 읽기, 기초 문법, 기초 회화 및 기본 문형 익히기에 중점을 둔다. 학습자는 아랍어 기본회화를 습득하고 이를 응용할 수 있는 능력을 배양할 수 있을 것이다."
                    },
                    {
                        "과목 코드": "KLC1021",
                        "과목명": "학문 목적 한국어 말하기 I",
                        "강의 시간": "3시간",
                        "학점": "3학점",
                        "내용": "본 과목은 학생들이 학문적 환경에서 일상적인 의사소통을 할 수 있도록 기본적인 한국어 말하기 능력을 함양하는 데 중점을 둔다. 학문적 주제와 관련된 어휘 및 표현 학습과 다양한 학업 상황에서의 대화 연습을 통해 학생들은 자신감 있는 의사소통 능력을 기를 수 있다. 특히, 인공지능 도구를 활용하여 문법적 정확성과 표현의 적절성을 점검하고, 더욱 자연스러운 표현을 구사하는 연습을 함으로써 학문적 환경에서 자기 생각을 효과적으로 전달하는 방법을 익힌다."
                    },
                    {
                        "과목 코드": "KLC1022",
                        "과목명": "학문 목적 한국어 말하기 I(고급)",
                        "강의 시간": "3시간",
                        "학점": "3학점",
                        "내용": "본 과목은 인공지능 기술을 활용하여 학생들이 학문적 주제에 대해 논리적이고 설득력 있는 발표 및 토론 능력을 함양하도록 돕는 고급 수준의 강좌이다. 학생들은 인공지능 도구를 활용하여 데이터 기반의 발표 자료를 제작하고, 이를 통해 주장을 뒷받침하는 방법을 학습한다. 또한, 다양한 발표 및 토론 과제를 수행하며 정확한 발음과 표현력을 향상하고, 자기 생각을 효과적으로 전달하는 능력을 기른다. 이 과정은 발표와 토론의 기초적인 원리를 익히는 것을 넘어, 학생들이 비판적 사고를 바탕으로 다양한 의견을 존중하고 효과적으로 소통할 수 있는 능력을 배양하는 데 중점을 둔다."
                    },
                    {
                        "과목 코드": "KLC1023",
                        "과목명": "학문 목적 한국어 말하기 II",
                        "강의 시간": "3시간",
                        "학점": "3학점",
                        "내용": "본 과목은 학생들이 다양한 학문적 주제에 대해 설명, 질문, 답변 등의 말하기 활동을 통해 심층적인 학문적 의사소통 능력을 함양하도록 설계되었다. 특히, 구체적인 주제를 명확하게 설명하고 자신의 의견을 논리적으로 전달하는 능력을 강화하며, 인공지능 도구를 활용하여 정교하고 논리적인 표현을 구사하는 연습을 한다. 이를 통해 학생들은 학문적 환경에서 자기 생각을 효과적으로 전달하고, 다양한 의견을 존중하며 소통하는 능력을 기를 수 있다."
                    },
                    {
                        "과목 코드": "KLC1024",
                        "과목명": "학문 목적 한국어 말하기 II(고급)",
                        "강의 시간": "3시간",
                        "학점": "3학점",
                        "내용": "본 과목은 고급 학문 목적 한국어 말하기의 심화 과정으로, 학생들이 연구 발표 및 학술 토론에 필요한 한국어 능력을 강화하는 데 중점을 둔다. 실제 학문 환경의 사례를 바탕으로, 학생들은 연구 결과 발표, 복잡한 주제에 대한 학술적 토론, 데이터 분석 기반 주장 전달 등의 실질적인 발표 및 토론 능력을 함양한다. 특히, 인공지능 도구를 활용하여 발표 내용의 구성과 표현 방식을 분석하고 개선함으로써, 논리적이고 설득력 있는 발표를 위한 심화 기술을 습득한다. 이 과정을 통해 학생들은 자신감을 가지고 고급 학문적 발표와 토론을 수행하며, 한국어로 복잡한 학문적 주제를 명확하고 논리적으로 표현하는 능력을 기른다."
                    },
                    {
                        "과목 코드": "KLC1025",
                        "과목명": "학문 목적 한국어 글쓰기 I",
                        "강의 시간": "3시간",
                        "학점": "3학점",
                        "내용": "이 과목은 학문적 한국어 글쓰기에 필요한 기초적인 한국어 구사 능력을 기르는 것을 목표로 삼는다. 학생들은 우선 한국어 문장, 단락 단위의 짧은 글을 문어적 격식에 맞으면서도 정확하게 쓰는 연습을 통해 학문적 한국어 글쓰기를 위한 기본 문법과 어휘를 익힌다. 이후 논증과 설명을 중심으로 한 간단한 보고서, 에세이 작성법을 학습하면서 문어적, 학술적 표현의 활용법을 익히고 이를 바탕으로 학술 연구에 필요한 사고력을 확장한다."
                    },
                    {
                        "과목 코드": "KLC1026",
                        "과목명": "학문 목적 한국어 글쓰기 I(고급)",
                        "강의 시간": "3시간",
                        "학점": "3학점",
                        "내용": "이 과목은 학생들이 고급 수준의 학문적 글쓰기에 필요한 구조적, 논리적인 글을 한국어로 작성할 수 있도록 하는 것에 목표를 둔다. 우선 고급 수준의 한국어 어휘 및 표현 활용 능력을 바탕으로 전공 영역에서 필요로 하는 논리적 글쓰기의 구성 원리를 익히고, 이후 연구 보고서와 논문 작성의 기본 틀과 기술을 학습함으로써 전문적 수준의 학술적 한국어 쓰기 및 체계적 사고 능력을 기른다."
                    },
                    {
                        "과목 코드": "KLC1027",
                        "과목명": "학문 목적 한국어 글쓰기 II",
                        "강의 시간": "3시간",
                        "학점": "3학점",
                        "내용": "이 과목은 학생들이 학문적 글쓰기의 다양한 형식을 체계적으로 실습하여 실질적인 작문 능력을 향상시키는 것을 목표로 한다. 구체적인 주제에 대해 논리적으로 글을 구성하고 표현하는 방법을 배우며, 자신의 의견을 명확히 글로 표현하는 연습을 통해 사고력과 설득력을 기른다."
                    },
                    {
                        "과목 코드": "KLC1028",
                        "과목명": "학문 목적 한국어 글쓰기 II(고급)",
                        "강의 시간": "3시간",
                        "학점": "3학점",
                        "내용": "이 과목에서는 고급 학문적 글쓰기에 필요한 심화된 기술을 다룬다. 학생들은 학술적 논문 작성, 비평문 작성 등 고급 작문 과제를 통해 정확성과 표현력을 배양하며, 학문적 글쓰기에 적합한 어조와 스타일을 구사할 수 있다."
                    }
                    ],
                "공통선택교과": {
                    "① 인간과 신앙": [
                        {
                            "과목 코드": "HFS2001",
                            "과목명": "철학적 인간학",
                            "강의 시간": "3시간",
                            "학점": "3학점",
                            "내용": "인간의 본질과 인간 이해의 주요 개념인 세계, 영혼과 육체, 정신, 자유, 삶과 죽음, 관계, 사랑, 역사, 문화, 신 등을 가톨릭 세계관에 입각한 인간학적 관점에서 고찰함으로써 인간의 자기 이해를 도모한다."
                        },
                        {
                            "과목 코드": "HFS2002",
                            "과목명": "신학적 인간학",
                            "강의 시간": "3시간",
                            "학점": "3학점",
                            "내용": "인간의 존재양식과 본질적 구성요소에 대한 문제, 인간의 삶을 규정짓는 노동, 자유, 정의, 고통, 죽음, 희망 등에 관한 물음에 대하여 인간학적 통찰들과 철학적, 종교학적 답변들을 객관적으로 소개한다. 그리스도 신앙의 관점에서 답변을 모색하고 “남을 위한 삶”을 구현하도록 한다."
                        },
                        {
                            "과목 코드": "HFS2003",
                            "과목명": "그리스도교 윤리",
                            "강의 시간": "3시간",
                            "학점": "3학점",
                            "내용": "그리스도교 윤리는 윤리문제를 신학적으로, 즉 자연도덕률을 전제하는 계시진리에 의거하여 연구하는 것이다."
                        },
                        {
                            "과목 코드": "HFU4012",
                            "과목명": "그리스도교 신앙과 영성",
                            "강의 시간": "강의 3시간",
                            "학점": "3학점",
                            "내용": "그리스도교 신앙이란 예수 그리스도를 참되게 알아가는 여정이자 예수 그리스도의 인격을 닮아가는 삶이라고 할 수 있다. 예수 그리스도를 어떻게 참되게 알 수 있는지를 살펴보고 그것이 어떻게 삶에 연결이 되는지를 고찰하고자 한다."
                        },
                        {
                            "과목 코드": "HFU4023",
                            "과목명": "진·선·미·성",
                            "강의 시간": "강의 3시간",
                            "학점": "3학점",
                            "내용": "본 교과목은 서강의 교양교육이념을 상징적으로 드러내는 과목으로서, 본 과목의 이수를 통해서 학생들이 지성적인 가치와 도덕적인 가치를 통합하는 것을 배우고, 더 나아가 배운 바를 삶의 현장에서 실천하며 ‘남을 위한 인격’으로 형성되는 것을 돕고자 한다."
                        }
                    ],
                    "② 인간과 사상": [
                        {
                            "과목 코드": "CHS2002",
                            "과목명": "현대 한국의 형성",
                            "강의 시간": "강의 3시간",
                            "학점": "3학점",
                            "내용": "개항 이후부터 현재까지의 한국사의 전개를 정치·경제·사회·문화·사상적 경향 등을 중심으로 다룬다. 특히 근대화, 민족운동, 해방과 독립, 한국전쟁, 민주화 등 한국 현대사의 주요 주제에 대해 체계적으로 이해한다."
                        },
                        {
                            "과목 코드": "CHS2003",
                            "과목명": "현대 동아시아의 형성",
                            "강의 시간": "강의 3시간",
                            "학점": "3학점",
                            "내용": "현대 동아시아의 정치·경제·사회·문화적 제 경향의 역사적 형성 과정을 비교 검토한다. 근대화와 동아시아 세계의 대두 등 근·현대 동아시아 세계의 발전에 대해 체계적으로 이해한다."
                        },
                        {
                            "과목 코드": "CHS2004",
                            "과목명": "현대 서양의 형성",
                            "강의 시간": "강의 3시간",
                            "학점": "3학점",
                            "내용": "현대 서양 문명의 정치·경제·사회·문화적 제 경향의 역사적 형성 과정을 비교적 관점에서 검토한다. 프랑스 혁명과 산업혁명 이후 형성된 근대 서양 세계에 대해 체계적으로 이해한다."
                        },
                        {
                            "과목 코드": "ETS2001",
                            "과목명": "현대세계와 윤리문제",
                            "강의 시간": "강의 3시간",
                            "학점": "3학점",
                            "내용": "삶의 도덕적이며 선한 가치와 삶의 궁극적 의미를 탐구함으로써 구체적 삶 안에서 올바른 가치 판단과 선택을 할 수 있는 능력과 자기 행위에 스스로 책임지는 윤리적 소양을 기른다."
                        },
                        {
                            "과목 코드": "ETS2002",
                            "과목명": "논리와 비판적 사고",
                            "강의 시간": "강의 3시간",
                            "학점": "3학점",
                            "내용": "언어의 논리적 사고와 철학적이며 구체적인 현실 문제에 대한 비판적 사고 방법을 익힘으로써 현대 사회의 다양한 문제를 효과적으로 사고하는 능력을 기른다."
                        },
                        {
                            "과목 코드": "ETS2004",
                            "과목명": "종교와 세계 문화",
                            "강의 시간": "강의 3시간",
                            "학점": "3학점",
                            "내용": "세계 문화의 토대가 되는 종교 전통들의 비교적 고찰과 이해를 통하여 인류문화의 기본적 유형과 성격을 파악한다."
                        },
                        {
                            "과목 코드": "HSS3032",
                            "과목명": "인문학의 세계",
                            "강의 시간": "강의 3시간",
                            "학점": "3학점",
                            "내용": "인간 존재와 사회를 이해하기 위한 기초적인 관점을 제공하는 과목으로, 인문학의 기본 개념과 다양한 학문 분야를 소개하고, 연구 방법론을 배우며, 인문학적 사고를 통해 현대 사회를 이해하고 문제를 해결하는 능력을 함양하는 것을 목표로 한다. 역사, 철학, 언어, 문학 등 융합 인문학 분야를 탐구하고, 인문학적 지식을 바탕으로 현대 사회의 주요 이슈를 분석하며, 미래 사회를 위한 인문학적 소양을 함양한다."
                        },
                        {
                            "과목 코드": "LLA1020",
                            "과목명": "Global History",
                            "강의 시간": "강의 3시간",
                            "학점": "3학점",
                            "내용": "This course aims to provide students with a broad range of global human experiences from ancient times to the present. It would be helpful for students to view the world as a whole and in comparison. Furthermore, students could comprehend their national and regional community within the context of the global community."
                        },
                        {
                            "과목 코드": "SHS2009",
                            "과목명": "한류와 미디어",
                            "강의 시간": "강의 3시간",
                            "학점": "3학점",
                            "내용": "한국의 대중 문화가 세계적인 인기를 누리는 현상이 어디에서 온 것인지 알아보고, 한국인과 세계인에게 어떤 영향을 미칠 것인지 학습한다."
                        }
                    ],
                    "③ 인간과 사회": [
                        {
                            "과목 코드": "SHS2001",
                            "과목명": "현대사회의 이해",
                            "강의 시간": "강의 3시간",
                            "학점": "3학점",
                            "내용": "현대사회에 대한 사회과학적 이해를 위한 입문과목으로 사회학적인 관점에서 급변하는 사회를 이해하고 조망할 수 있는 능력과 안목을 기른다."
                        },
                        {
                            "과목 코드": "SHS2002",
                            "과목명": "한국과 세계",
                            "강의 시간": "강의 3시간",
                            "학점": "3학점",
                            "내용": "한국 사회의 중요한 정치적, 사회적 이슈들을 세계 사회의 총체적 변화와 연계하여 체계적이고 비판적으로 고찰한다. 이를 기반으로 현실적인 관점에서 우리 사회의 지향점을 모색해 본다."
                        },
                        {
                            "과목 코드": "SHS2003",
                            "과목명": "커뮤니케이션과 사회",
                            "강의 시간": "강의 3시간",
                            "학점": "3학점",
                            "내용": "사회의 관계에 대한 다양한 이론을 비판적으로 고찰하고 종합한다. 새로운 정보 기술 등장의 구조적 원인과 그에 따른 정치, 경제, 사회, 문화 전반의 변화, 이러한 변화의 파급 효과를 고찰하고, 사회적 전망을 제시한다."
                        },
                        {
                            "과목 코드": "SHS2005",
                            "과목명": "법과지식재산",
                            "강의 시간": "강의 3시간",
                            "학점": "3학점",
                            "내용": "정신적 창작의 결과를 거래하는 산업인 제약·의료·화학·전기·전자·기계·컴퓨터 프로그램·빅데이터·인공지능 분야의 기술혁신, 특허발명, 영업비밀, 방송, 출판, 음악, 미술, 건축, 사진, 조각, 산업디자인, 연극, 영화, 드라마, 광고, 저명브랜드, 원산지/가공지 표시, 도메인이름, 농수산물의 지리적 표시, 유명인의 퍼블리시티권 등의 관련 산업에서 발생하는 법적 분재의 원인과 배경, 입법정책, 판결 등을 체계적으로 학습한다."
                        },
                        {
                            "과목 코드": "SHS2007",
                            "과목명": "생활속의 심리학",
                            "강의 시간": "강의 3시간",
                            "학점": "3학점",
                            "내용": "심리학의 기초 개념과 이론을 습득하고 이러한 개념과 이론이 생활과 현장에서 어떻게 적용되는지를 소개한다."
                        },
                        {
                            "과목 코드": "LLA1021",
                            "과목명": "Understanding Euro MENA",
                            "내용": "This course offers a historical survey of the political, economic, social, and cultural interactions between Christian-centered Europe and the Islamic cultural sphere of the Middle East and North Africa following the rise of Islam in the 7th century.",
                            "lecture_hours": "3시간",
                            "credits": "3학점"
                        },
                        {
                            "과목 코드": "SHS2010",
                            "과목명": "한국의 경제 발전",
                            "내용": "이 강좌에서는 한국의 경제발전을 어떻게 이해할 것인지에 대한 역사적 설명을 시도할 것이며 이를 통해 현재 한국 경제가 당면하고 있는 다양한 문제점들을 살펴보고 그 해결 방법에 대해서도 학습한다.",
                            "lecture_hours": "3시간",
                            "credits": "3학점"
                        }
                    ],
                    "④ 인간과 과학 & AI": [
                        {
                            "과목 코드": "STS2001",
                            "과목명": "자연과 인간",
                            "내용": "현대 자연과학의 바탕이 되고 있는 중요한 물리적, 화학적 원리를 알아보고, 자연의 그러한 원리가 인간의 현대 생활에 어떻게 활용되고 있는가를 알아본다. 이로부터 인간이 자연과 함께 더불어 조화롭게 살아가기 위하여 필요한 기본적인 원칙을 함께 연구한다.",
                            "lecture_hours": "3시간",
                            "credits": "3학점"
                        },
                        {
                            "과목 코드": "STS2002",
                            "과목명": "생명과 환경",
                            "내용": "유기체로서의 생명의 특징을 이해하고, 생명의 기원과 진화, 인간의 발생과 진화 및 뇌의 발달, 인간의 행동을 다루며 모든 생명체의 환경인 자연을 이해하고, 무한한 가능성을 지닌 대양과 그 생물상, 지구의 산소 공급원인 나무와 숲 등의 생태계를 공부하며 인간과의 관계를 확인한다.",
                            "lecture_hours": "3시간",
                            "credits": "3학점"
                        },
                        {
                            "과목 코드": "STS2005",
                            "과목명": "미적분학 I",
                            "내용": "실수, 함수, 극한과 연속성, 미분계수, 도함수, 미분, 함수의 극치, 평균치 정리, 극대·극소의 응용, 정적분, 미적분학의 기본정리, 정적분의 응용, 초월함수의 미분 및 적분과 그 응용, 미분법, 극좌표, 극방정식 등을 다룬다.",
                            "lecture_hours": "3시간",
                            "credits": "3학점"
                        },
                        {
                            "과목 코드": "STS2010",
                            "과목명": "과학사",
                            "내용": "동서양의 자연과학의 발달 과정을 역사적으로 개관한다.",
                            "lecture_hours": "3시간",
                            "credits": "3학점"
                        },
                        {
                            "과목 코드": "STS2011",
                            "과목명": "기초 빅데이터 프로그래밍",
                            "내용": "‘컴퓨팅 사고력’ 교과목을 이수한 학생들을 수강 대상으로 컴퓨팅 사고와 파이썬을 활용하여 산업의 현장에서 필요로 하는 기초응용 부분에 대한 프로그래밍을 교육하는 것을 목표로 한다. 또한 이와 관련된 SW 프로그래밍 실습을 할 수 있도록 한다.",
                            "lecture_hours": "3시간",
                            "credits": "3학점"
                        },
                        {
                            "과목 코드": "STS2012",
                            "과목명": "딥러닝기반 빅데이터처리 실습",
                            "내용": "본 과목은 Tensorflow, Keras, Pytorch 등 많이 사용되는 딥러닝 프레임워크를 활용하여 딥러닝 기반 빅데이터 처리 실습을 수행한다.",
                            "lecture_hours": "3시간",
                            "credits": "3학점"
                        },
                        {
                            "과목 코드": "STS2015",
                            "과목명": "과학도를 위한 파이썬",
                            "내용": "본 교과는 파이썬의 변수, 조건 및 반복문, 함수, 자료구조(판다스), 클래스와 속성, 크롤링(스크래핑) 등의 구문을 배우고 자연과학의 시계열 데이터로부터 기본적인 정보를 찾는 알고리즘을 구현하고 PyQt5 패키지를 이용하여 시각화할 수 있는 능력을 키운다.",
                            "lecture_hours": "3시간",
                            "credits": "3학점"
                        },
                        {
                            "과목 코드": "STU4011",
                            "과목명": "우주와 원자시대",
                            "내용": "과학의 발달과 우주관의 변화를 시대 순서대로 살펴보고, 풍요로움과 우주관의 대변혁 세기인 19세기와 20세기의 우주관을 이해하고, 21세기 인류가 당면하고 있는 전 지구적 한계를 극복할 수 있는 새로운 우주적 세계관을 전망해 본다.",
                            "lecture_hours": "3시간",
                            "credits": "3학점"
                        }
                    ]
                },
                "전공입문교과": [
                    {
                        "과목 코드": "HSS3013",
                        "과목명": "인문세미나",
                        "내용": "인간의 언어, 문학, 역사, 사유, 종교, 문화 등 인문학 연구대상 전반에 대한 포괄적인 이해를 통해, 인문학의 보편적 가치에 대한 인식을 함양하고 인문학적 소양을 기르기 위한 융합 인문학 과목이다.",
                        "lecture_hours": "3시간",
                        "credits": "3학점"
                    },
                    {
                        "과목 코드": "STS2004",
                        "과목명": "대학 수학",
                        "내용": "Boole 대수, 벡터와 볼록집합, 행렬과 행렬식, 미분법과 그 응용, 적분, 편미분법과 그 응용, 차분방정식과 미분방정식, 통계 중 적당한 내용을 선정하여 다룬다.",
                        "lecture_hours": "3시간",
                        "credits": "3학점"
                    },
                    {
                        "과목 코드": "STS2006",
                        "과목명": "미적분학 Ⅱ",
                        "내용": "매개 방정식과 평면벡터, 곡률, 호의 길이, 특이적분, 부정형, L' Hopital의 정리, 이차곡면, 편미분법, 유향미분계수, 선적분, 이중적분, 이중적분의 응용, 삼중적분, 삼중적분의 응용, 무한급수, 멱급수 등을 다룬다.",
                        "lecture_hours": "3시간",
                        "credits": "3학점"
                    },
                    {
                        "과목 코드": "TLS1004",
                        "과목명": "영어글로벌 의사소통 Ⅱ",
                        "내용": "글로벌 의사소통 Ⅱ는 글로벌 의사소통 I의 후속과목으로서 말하기, 듣기, 쓰기, 읽기 능력을 통합하여 교육하는 영어 과목이다. 이 과목은 학생들이 고재와 영상 매체를 통한 충분한 연습과 경험을 통해서 네 가지 능력을 균형 있게 증진시킬 수 있도록 디자인 되어 있다.",
                        "lecture_hours": "3시간",
                        "credits": "3학점"
                    },
                    {
                        "과목 코드": "LCS2002",
                        "과목명": "독일 언어와 문화 Ⅱ",
                        "내용": "독일 언어와 문화Ⅰ의 후속과목으로, 독어활용능력을 더욱 향상시켜 독일사회의 문화에 대한 이해를 심화시킨다.",
                        "lecture_hours": "3시간",
                        "credits": "3학점"
                    },
                    {
                        "과목 코드": "LCS2004",
                        "과목명": "프랑스 언어와 문화 Ⅱ",
                        "내용": "프랑스 언어와 문화 1의 후속 과목으로 말하기, 읽기, 듣기, 쓰기 능력을 더욱 향상시키고 프랑스인의 사고방식, 제도, 풍속 등 문화적인 지식을 더 깊이 공부한다.",
                        "lecture_hours": "3시간",
                        "credits": "3학점"
                    },
                    {
                        "과목 코드": "LCS2006",
                        "과목명": "중국 언어와 문화 Ⅱ",
                        "내용": "중국 언어와 문화Ⅰ을 이수한 학생들을 대상으로 기본 문장 독해 및 실용 초급 회화, 그리고 관련 중국 문화의 이해를 목표로 한다.",
                        "lecture_hours": "3시간",
                        "credits": "3학점"
                    },
                    {
                        "과목 코드": "LCS2008",
                        "과목명": "일본 언어와 문화 Ⅱ",
                        "내용": "일본 언어와 문화Ⅰ을 이수한 학생들을 대상으로 기본 문장 독해 및 실용 초급 회화를 학습하고 이를 통해 일본 문화에 대한 이해를 높인다.",
                        "lecture_hours": "3시간",
                        "credits": "3학점"
                    },
                    {
                        "과목 코드": "LCU4022",
                        "과목명": "중급 라틴어 Ⅰ",
                        "내용": "문장론 초보과정을 익힌다. 복합문과 장문의 해독을 시작함으로써 로마 고전에 대한 감각을 익히고 학생들이 전공하는 서구 관련 어학문 연구의 토대를 마련한다.",
                        "lecture_hours": "3시간",
                        "credits": "3학점"
                    },
                    {
                        "과목 코드": "LCU4026",
                        "과목명": "중급 이탈리아어 Ⅰ",
                        "강의시간": "3시간",
                        "학점": "3학점",
                        "내용": "초급 이탈리아어를 이수한 학생을 위한 중급 과정으로 복잡한 문장 구조를 익히고 어휘력을 배양한다."
                    },
                    {
                        "과목 코드": "LCU4031",
                        "과목명": "중급 스페인어 Ⅰ",
                        "강의시간": "3시간",
                        "학점": "3학점",
                        "내용": "초급 스페인어를 이수한 학생을 위한 중급과정으로 복잡한 문장 구조를 익히고 어휘력을 배양한다."
                    },
                    {
                        "과목 코드": "LCU4036",
                        "과목명": "중급 러시아어 Ⅰ",
                        "강의시간": "3시간",
                        "학점": "3학점",
                        "내용": "초급 러시아어의 계속으로서 비교적 평이한 문장과 기초문법 및 언어능력을 학습한다."
                    },
                    {
                        "과목 코드": "LCU4114",
                        "과목명": "중급 아랍어",
                        "강의시간": "3시간",
                        "학점": "3학점",
                        "내용": "초급 아랍어를 통해 알파벳 익히기, 기본문법과 기본 표현 및 기초 회화를 배운 수강생들이 심화된 문법 및 다양한 회화, 표현을 익혀 현지인들과 자유로운 대화를 가능하게 하는 것이 목표이다. 또한, 아랍 및 이슬람 문화에 대한 기본 지식을 함양하여 아랍세계와 아랍인을 보다 잘 이해할 수 있도록 한다."
                    }
                ],
                "자유선택교과": {
                    "① 치유·봉사·리더십": [
                        {
                            "과목 코드": "HFU4024",
                            "과목명": "문학치료와 스토리텔링",
                            "강의시간": "3시간",
                            "학점": "3학점",
                            "내용": "‘문학치료와 스토리텔링’은 다양한 문학을 통해 나를 바라보고, 자기 이야기를 스토리텔링 할 수 있도록 함으로써 나를 객관화하여 바라볼 수 있도록 한다. 우리나라 문학 및 외국 문학 작품, 그리고 성경에 드러난 ‘자기 초월’의 다양한 모습들을 살펴보고 자신과 세계에 대한 성찰의 거울로 삼음으로써 궁극적으로 ‘자기 이해’를 가능하게 하는 치유의 힘을 경험한다. 또한 문학치료학을 통해 인간관계 속 갈등의 원인과 해결 방안을 탐색하여 앎과 삶의 일체화를 목표로 한다."
                        },
                        {
                            "과목 코드": "HFU4026",
                            "과목명": "치유의 행복학",
                            "강의시간": "3시간",
                            "학점": "3학점",
                            "내용": "이 교과목은 기능적 사고와 도구적 이성이 판을 치는 한국사회에서 학생들이 자신들이 처한 실존적 상황에 대한 구체적 이해와 해석을 수행함으로써 변화될 수 없는 치명적인 삶의 조건과 사회적 조건에도 좌절하지 않고 창의적이며 자발적인 철학적 사고를 통해 ‘마음’을 치유할 수 있도록 돕는다. 특히 이 교과목은 철학실천을 접목한 새로운 철학교육의 일환으로서 학생들로 하여금 자신이 처한 현실인식을 통해 행복저해 요소가 무엇인지 탐구함으로써 삶의 도전에 직면하는 개인적인 방식을 발달시키고, 자신이 안고 있는 문제를 스스로 감당할 수 있는 내적인 힘을 강화하여 행복에 대한 인식을 전환시킬 수 있는 실천적 교육내용을 목표로 한다."
                        },
                        {
                            "과목 코드": "HFU4027",
                            "과목명": "거꾸로. 다시 그리고 치유",
                            "강의시간": "3시간",
                            "학점": "3학점",
                            "내용": "본 교과목은 현대 사회를 살아가는 오늘날의 대학생들이 자유로운 정신을 통해 자기와 사회를 주체적인 시선에서 해석하고, 그 속에서 자신의 삶을 다시 고민하며 재구성하는 과정을 학습하기 위해 개설되었다. 이 과정에서 본 교과목은 수강생 개개인 삶의 치유에 궁극적인 지향점을 둘 것이다. 이를 위해 본 교과목의 전반부에서는 나의 한계이기도 한 ‘자기 경계’에 대한 철학적 자기검토를 하며, 후반부에서는 ‘영적 훈련’으로서 나의 좁은 경계의 울타리를 넘어서는 시도를 한다. 특히 후반부 수업은 학생들이 집단 협업을 통해서 현재 자신들에게 가장 어려운 삶의 문제가 무엇인지 스스로 찾아내 구체적인 사례를 제시하고, 그 사례에 대한 문제 해결에 도움이 되는 철학적 방법이 무엇이며, 어떻게 접근해야 하는지를 팀별, 공동의 작업을 통해 찾아내도록 하는 능동적이고 자발적인 문제 중심의 자기 주도형 수업 방식(PBL: 問題中心學習, Problem-Based Learning]으로 진행된다."
                        },
                        {
                            "과목 코드": "HSS3001",
                            "과목명": "인간과 인성",
                            "강의시간": "2시간",
                            "학점": "2학점",
                            "내용": "봉사적 인성을 갖춘 인재양성을 위하여 이웃에 대한 관심과 공감능력을 갖춘 리더십을 배양하고 다양성을 포용할 수 있는 성숙한 시민의식을 기르기 위한 교과 내용으로 구성된다. 이를 위하여 각 영역의 전문가 특강 및 토론, 주제별 에세이 작성 등이 진행된다."
                        },
                        {
                            "과목 코드": "HSS3002",
                            "과목명": "사회봉사",
                            "강의시간": "2시간",
                            "학점": "2학점",
                            "내용": "인간의 존엄성과 인간애를 사회현장에서 봉사와 자원 활동을 통하여 학습하여 전인적 인간 발달을 도모한다."
                        },
                        {
                            "과목 코드": "HSS3004",
                            "과목명": "특수교육과 장애의 이해",
                            "강의시간": "3시간",
                            "학점": "3학점",
                            "내용": "특수교육을 소개하며 장애에 대한 올바른 인식을 갖도록 한다."
                        },
                        {
                            "과목 코드": "HSS3005",
                            "과목명": "수화의 이해",
                            "강의시간": "3시간",
                            "학점": "3학점",
                            "내용": "수화를 기초부터 배우고 익힘으로써 청각장애인과 비장애인 간에 기본적인 의사소통이 가능하도록 하며 상호이해를 돕는다."
                        },
                        {
                            "과목 코드": "HSS3019",
                            "과목명": "세계를 간다",
                            "강의시간": "3시간",
                            "학점": "2학점",
                            "내용": "세계화 시대에 세계문화 및 역사에 대한 이해를 높이며 국제적인 감각을 함양하는 것을 목적으로 한다."
                        },
                        {
                            "과목 코드": "HSS3021",
                            "과목명": "인간과 지성",
                            "강의시간": "2시간",
                            "학점": "2학점",
                            "내용": "창의적 지성을 갖춘 인재양성을 위하여 학문연구의 바탕이 되는 기초소양을 증진하고, 새로운 시대를 선도하는 문제해결능력과 창의성을 기르기 위한 교과 내용을 구성된다. 이를 위하여 각 영역의 전문가 특강 및 토론, 주제별 에세이 작성 등이 진행된다."
                        },
                        {
                            "과목 코드": "HSS3022",
                            "과목명": "인간과 영성",
                            "강의시간": "2시간",
                            "학점": "2학점",
                            "내용": "통합적 영성을 갖춘 인재양성을 위하여 나와 이웃, 인간과 사회, 자연과 우주를 통합적으로 성찰하며, 인간의 소명인 사랑을 실천하고 지행일치의 삶을 살 수 있도록 돕기 위한 교과 내용으로 구성된다. 이를 위하여 각 영역의 전문가 특강 및 토론, 주제별 에세이 작성 등이 진행된다."
                        },
                        {
                            "과목 코드": "HSS3023",
                            "과목명": "사회참여와 성찰",
                            "강의시간": "3시간",
                            "학점": "3학점",
                            "내용": "‘사회참여와 성찰’은 서강대 재학생 스스로 우리 사회에서 일어나고 있는 사회적 이슈에 대해 충돌과 갈등이 발생하는 원인과 현상을 알아보고, 충돌과 갈등 해소에 관한 이론적 교육과 사회현장에서 발생하는 구체적 사안 간의 적용과 가능성을 모색해봄으로써, 학생의 입장에서 효과적이고 효율적인 해소방안을 고민해보고 그 원리를 찾는 데에 목적이 있다."
                        },
                        {
                            "과목 코드": "HSS3024",
                            "과목명": "글로벌 기업 CEO의 기업가정신 특강",
                            "강의시간": "실습 1.5시간",
                            "학점": "1학점",
                            "내용": "글로벌 기업 CEO들의 경험을 정규 교과목 형식을 통해 체계적으로 전수하고 면담 및 멘토링 등의 기회를 제공함으로써, 학생들의 글로벌 감각을 높이고, 적성의 발견 및 경력 개발을 보다 실질적으로 지원하고자 한다."
                        },
                        {
                            "과목 코드": "HSS3026",
                            "과목명": "SOFEX 100 동아시아와 예수회교육",
                            "강의시간": "강의 2시간, 설계1시간",
                            "학점": "3학점",
                            "내용": "SOFEX100 수업은 일본 조치대학교와 공동으로 운영하는 글로벌 교육플랫폼 교과이다. 전세계 예수회 대학교들이 공유하고 있는 예수회 교육 철학을 이해하며, 이를 토대로 우리 주변(동아시아)의 이슈들을 함께 찾아보고 문제를 해결할 수 있는 글로벌 프로젝트를 진행한다."
                        },
                        {
                            "과목 코드": "HSS3027",
                            "과목명": "공존의 시대와 세계시민교육",
                            "강의시간": "3시간",
                            "학점": "3학점",
                            "내용": "다양한 타 문화에 대한 이해를 넘어서 공존의 개념을 향상시키고, 더불어 함께 살아가는 가치관과 생활방식을 학습, 체험토록 한다. 세계시민교육의 주된 이슈인 ‘세계시민’, ‘난민’, ‘다문화’, ‘타문화 이해와 커뮤니케이션’, ‘현장 학습’ 등을 주제로 다룬다."
                        },
                        {
                            "과목 코드": "HSS3028",
                            "과목명": "아픈영혼을 철학으로 치유하기",
                            "강의시간": "3시간",
                            "학점": "3학점",
                            "내용": "철학적 사유의 도구인 세계관 해석을 통해 미래에 대한 불안한 마음을 극복하는 자기 변화와 치유에 목표를 둔 철학상담 강의와 집단철학상담을 병행한 교과목이다. 자기 정체성 찾기, 관계 맺기, 감정 읽기, 불안의 근원, 가족, 수치심, 죄책감, 절망, 폭력의 법칙, 용서, 내적 자유, 의미와 행복 등의 주제 강의와 집단상담을 통해 자기 변화와 치유를 도모한다."
                        },
                        {
                            "과목 코드": "HSS3029",
                            "과목명": "사회인 준비 특강",
                            "강의시간": "1시간",
                            "학점": "1학점",
                            "내용": "실제 기업 사례를 바탕으로 산업사회의 현재와 미래에 대한 이해, 커뮤니케이션 스킬, 테크트리 등 현장의 실무를 연계하여 기업경영에 대한 전반적인 이해를 돕고자 한다."
                        },
                        {
                            "과목 코드": "HSS3030",
                            "과목명": "지속가능한발전과 ESG실천",
                            "강의시간": "이론및설계 3시간",
                            "학점": "3학점",
                            "내용": "ESG(환경,사회,지배구조)에 대한 기본적 이해를 갖추고, 지속가능한발전을 위한 개념을 학습한다. 배려와 나눔을 통한 더 나은 미래사회를 위해 사회가 직면한 문제 해결에 협력하고 동참할 수 있도록 한다(UAP). ESG실천을 통해 사회적 가치를 추구하고, 인류공동체 발전을 위한 사회공헌에 기여하도록 한다. 따라서, 기업시민의 이해를 바탕으로 기업 및 이해관계자와 소통·공감하며 ESG 아젠다를 다룬다. 기업의 현장실무 담당자와 구체적인 사례를 중심으로 멘토링을 제공하고, 프로젝트 기반 학습(Project-Based Learning: PBL)을 진행한다."
                        },
                        {
                            "과목 코드": "HSS3031",
                            "과목명": "도시혁신프로젝트",
                            "강의시간": "설계 3시간",
                            "학점": "3학점",
                            "내용": "지속가능한발전(SDGs)과 도시혁신을 위하여 지자체 도시재생사업과 대학교육, NGO와 기업, 지자체를 연계한 민·관·학 협력체계 구축을 토대로 컬렉티브 임팩트를 창출하도록 한다. 사회문제 해결의 주체로서 성장을 돕고, 배려와 나눔을 통한 사회가 직면한 문제 해결에 협력하고 동참할 수 있도록 한다(UAP). ‘지역주민의 삶의 질 향상’이라는 총체적 관점으로 접근하고, 대학생 연합 및 주민참여를 통해 지역사회 전반에 긍정적인 변화를 도출하여, 지속가능한발전을 도모한다. 기업 및 현장 전문가 멘토링을 제공하고, 프로젝트 아이디어 고도화 및 실천 경험을 확대 적용하여 실현화하도록 한다. 프로젝트 기반 학습(Project-Based Learning: PBL)을 통해 지역사회 문제를 발굴, 해결하여 사회적 가치를 실천한다."
                        },
                        {
                            "과목 코드": "LAU4023",
                            "과목명": "문학예술의 심리학",
                            "강의시간": "3시간",
                            "학점": "3학점",
                            "내용": "시와 소설, 드라마와 영화 등의 각종 문학예술에는 인간의 심리가 다양하고도 구체적으로 투영돼 있다. 문학을 비롯한 예술의 기능과 가치를 심리적 차원에서 생각해 본다. 문학예술 작품에 등장하는 개성적이고 전형적이며 매력적인 각종 인물형을 심리학적 관점에서 다양하고 깊이 있게 살피는 작업을 통해 인간존재에 대한 이해를 확장하고 심화한다. 그리고 문학을 읽고 들으며 여기에 다양한 예술적 표현으로 반응해 본다. 이러한 과정을 통해 문학에 숨겨진 심리적 의미를 찾아내고 나의 반응을 점검하며 최종적으로 나 자신에 대한 이해에 도달하는 것을 목표로 한다."
                        },
                        {
                            "과목 코드": "LAU4045",
                            "과목명": "치유서사 창작론",
                            "강의시간": "3시간",
                            "학점": "3학점",
                            "내용": "문학·예술작품들과 종교(신비주의), 정신분석(프로이트, 융), 상담심리학, 표현예술치료(시치료, 연극치료, 오세틱 무브먼트, 꿈 분석) 등과 같은 다양한 영역들로부터 치유하는 예술을 위한 지침과 영감을 얻어내는 것을 목적으로 한다. 치유서사라는 중핵개념으로 다양한 영역들의 지식과 영감을 수용하여 수렴하면서 구체적인 모색의 예를 제시하고, 이로써 삶과 예술분야에서 치유하는 창작을 꿈꾸는 분들에게 도움을 주고자 한다."
                        },
                        {
                            "과목 코드": "LED3001",
                            "과목명": "성경으로 배우는 리더십",
                            "강의시간": "3시간",
                            "학점": "3학점",
                            "내용": "가톨릭 정신을 바탕으로 21세기를 주도하는 리더를 기르는 것을 목표로 한다. 특히 구약 및 신약성경에서 나타나는 인물들이 리더십을 발휘하게 되는 계기와 방법 그리고 그 목적을 살펴본다."
                        },
                        {
                            "과목 코드": "LED3002",
                            "과목명": "리더십 훈련",
                            "강의시간": "3시간",
                            "학점": "3학점",
                            "내용": "인간의 각 성숙 단계를 심리학적으로 이해하며 옳은 일을 올바르게 실행하는 리더의 의미를 성찰한다. 자기 독립성, 자기 통제성, 자기 책임성 위에 상호 연대성을 통하여 함께 승리하는 정신으로 시너지 효과를 창출하는 자기 통합적인 자질을 함양한다."
                        },
                        {
                            "과목 코드": "LED3005",
                            "과목명": "기업경영 리더십",
                            "강의시간": "3시간, S/U 평가",
                            "학점": "2학점",
                            "내용": "21세기를 주도하는 글로벌 경영 리더를 기르기 위해 리더십의 이론과 실제를 겸한 수업이다."
                        },
                        {
                            "과목 코드": "LED3015",
                            "과목명": "자기브랜드 리더십",
                            "학점": "3학점",
                            "내용": "리더십의 기본개념에 대한 이해를 바탕으로 개인리더십과 대인관계리더십 등의 능력개발을 위한 전문기법을 배우고 훈련한다. 본 과정은 준비된 리더를 육성하는데 그 목적이 있으며, 리더십의 개념과 역량을 학습하여 자신의 강점과 약점을 파악하고, 자신만의 브랜드 리더십을 개발하도록 돕는다. 다양한 의견 제시와 수용, 피드백을 통한 통합 능력을 개발시켜 자신만의 리더십을 함양하기 위한 꿈과 비전을 설정한다."
                        },
                        {
                            "과목 코드": "LED3017",
                            "과목명": "동감과 실천",
                            "학점": "3학점",
                            "내용": "본 교과는 관계적인 삶과 그 철학적 및 신학적 배경을 이해하고 다양성을 긍정하는 의식을 제시함으로써 인간 사회 및 자연과의 관계 맺음에 보다 친화적일 수 있도록 하는 것을 목표로 한다. 이것은 삶의 다양한 공동체 안에서 자신의 위치와 역할에 관한 이해로부터 출발하여 개인적 차원에서만 자신을 이해하는 데서부터 공동체의 일원으로서 갖는 자신의 정체성을 이해하도록 돕는다. 나아가 실제 관계 맺기 상황에 적용함으로써 실질적으로 관계 속에 자아와 공동체가 성장하는 체험을 하게 한다."
                        },
                        {
                            "과목 코드": "LED3018",
                            "과목명": "글로벌리더십체험실습(캡스톤디자인)",
                            "학점": "3학점",
                            "내용": "글로벌 시대의 사회, 경제, 정치, 문화, 환경 등을 주제로 사회문제 및 해결방안을 심층적으로 탐구하는 프로젝트 및 체험 실습 과목으로, 동아시아지역 5개 예수회 대학 간 교류 프로그램(대학별 프로젝트 발표 및 토론, 현장실습 등)을 포함한다. 해당 연도 주제에 따라 팀을 구성하여 나라별 현황, 문화연구, 현지방문, 필드워크를 통해 분석하고 결과물을 발표하는 방식으로 워크숍 세미나를 진행한다. 특별히 본 프로그램은 환경, 생태, ESG에 초점을 두고 소셜벤처 창업의 과정도 지원한다."
                        },
                        {
                            "과목 코드": "SHU4003",
                            "과목명": "시민참여와 시민교육",
                            "학점": "3학점",
                            "내용": "한국의 권위주의 해체와 민주화, 향후 개혁과제, 시민사회·시민운동·시민정치, 참여민주주의에 대한 이해와 민주시민의식, 지구촌 시민운동 및 글로벌 에티켓들을 다룬다. 민주시민교육과 시민운동을 이끌 수 있는 시민 리더십의 기본소양을 갖추게 한다."
                        },
                        {
                            "과목 코드": "SHU4006",
                            "과목명": "인권과 정의",
                            "학점": "3학점",
                            "내용": "‘세계인권선언’의 분석, 인권에 관한 일반적 고찰, 인권과 민주화의 관계, 현재 한국의 인권 상황, 인권운동 및 인권교육의 과제, 북한 및 지구촌 인권문제, 성서에서의 인권 및 정의, 각자의 실천 등에 관해 고찰하는 체계적인 인권교육 강좌이다."
                        },
                        {
                            "과목 코드": "SHU4015",
                            "과목명": "사회복지의 이해",
                            "학점": "3학점",
                            "내용": "사회사업의 개념, 원리, 과정에 대한 기초 이론을 제공한다."
                        },
                        {
                            "과목 코드": "SHU4050",
                            "과목명": "국제개발협력의 이해",
                            "학점": "3학점",
                            "내용": "국제관계는 갈등과 협력이 동시에 나타난다. 본 수업은 이 가운데 국제개발협력에 초점을 맞추어 선진국이 개발도상에 있는 국가들에게 제공하는 개발원조와 그 밖의 개발협력에 대한 이해를 도모하고자 한다."
                        },
                        {
                            "과목 코드": "ROT4001",
                            "과목명": "안보학 (학군단교과목)",
                            "학점": "3학점",
                            "내용": "군사보안의 중요성과 인원 및 시설, 문서 등 각 분야별 규정을 이해하고, 보안사고 사례 학습을 통하여 초급장교로서 임무수행가능한 군사보안 능력을 배양한다."
                        },
                        {
                            "과목 코드": "ROT4002",
                            "과목명": "안전및조직관리사례연구 (학군단교과목)",
                            "학점": "3학점",
                            "내용": "군 안전 문화의 개념과 필요성을 인식하고, 안전 및 조직관리 사례를 통하여 군 조직 문화에 대한 이해와 안전사고 예방조치 능력을 배양한다."
                        },
                        {
                            "과목 코드": "ROT4003",
                            "과목명": "조직리더십 (학군단교과목)",
                            "학점": "3학점",
                            "내용": "군 조직에 대한 이해를 바탕으로 장교로서 요구되는 군 리더십이 무엇인지 파악하여, 리더 역량 및 올바른 품성과 가치관을 확립한다."
                        },
                        {
                            "과목 코드": "ROT4004",
                            "과목명": "조직리더십사례연구 (학군단교과목)",
                            "학점": "3학점",
                            "내용": "과거 전쟁영웅들이 발휘한 리더십 사례들을 연구하고, 실제 발생가능한 상황에 대한 토의를 통하여 주도성과 창의성, 군에서 요구되는 리더십을 함양한다."
                        },
                        {
                            "과목 코드": "ROT4005",
                            "과목명": "군사훈련Ⅰ(학군단 과목)",
                            "학점": "3학점",
                            "내용": "동·하계 방학기간 입영훈련을 통하여 군인기본자세와 군인정신을 체득 및 함양하고, 올바른 가치관을 정립한다. 또한 전투상황 속 장교로서의 지휘 및 지도능력을 익힌다."
                        },
                        {
                            "과목 코드": "ROT4006/4007",
                            "과목명": "군사훈련 Ⅱ, Ⅲ(학군단 과목)",
                            "학점": "1학점",
                            "내용": "방학기간 전투지휘자 훈련으로 기본전투기술과 분대급 제대 편제화기 및 장비운용을 숙달하고 강인한 체력을 배양한다. 학생 중심의 참여형 교육을 통하여 주도성과 창의성을 개발하고 임무형 지휘능력을 체득한다."
                        }
                    ],
                    "② 인간과 신앙": [
                        {
                            "과목 코드": "ETU4006",
                            "과목명": "이성과 신앙",
                            "학점": "3학점",
                            "내용": "이성과 신앙의 본질과 둘 사이의 관계를 철학적으로 규명함으로써 인간의 삶에 직접적으로 다가와 있는 인간의 종교성의 의미를 반성적으로 이해한다. 종교와 철학의 관계를 고찰한다."
                        },
                        {
                            "과목 코드": "HFU4003",
                            "과목명": "생명 윤리",
                            "학점": "3학점",
                            "내용": "생명과학기술의 급성장과 더불어 현대를 사는 인간에게 일차적으로 요구되는 것은 생명가치와 인간존엄성에 대한 올바른 인식이다. 요즘 문제가 되고 있는 생명과학기술의 주제들을 다루면서 인간생명에 대한 올바른 가치관을 확립하도록 하며, 사례연구를 통하여 올바른 윤리판단을 내릴 수 있도록 한다."
                        },
                        {
                            "과목 코드": "HFU4004",
                            "과목명": "성서와 생활",
                            "학점": "3학점",
                            "내용": "신앙의 근원인 성서는 인간을 찾아오신 하느님과 인간 사이의 역사임을 이해하고 구원을 주시는 생명의 말씀을 직접 읽고 묵상하며 동시에 진리이신 말씀에 순응함으로써 생활의 활력을 도모한다."
                        },
                        {
                            "과목 코드": "HFU4005",
                            "과목명": "개인과 공동체",
                            "강의 시간": "강의 3시간",
                            "학점": "3학점",
                            "내용": "신앙의 개인 구원과 사회 구원의 두 요소를 고찰하고 사랑의 사도적 공동체를 통하여 기초교회 공동체 건설을 위한 정행, 정론을 연구한다. 이를 통하여 개인과 공동체의 근본적인 관계 매김을 성찰한다."
                        },
                        {
                            "과목 코드": "HFU4008",
                            "과목명": "과학과 종교",
                            "강의 시간": "강의 3시간",
                            "학점": "3학점",
                            "내용": "이 과목은 바로 종교, 특히 그리스도교(가톨릭, 개신교)와 자연과학 간의 관계에 관한 여러 관점들과 구체적 쟁점들을 다룬다. 이 과목의 핵심 주제는 1. 종교와 과학간의 관계 설정을 위한 여러 접근 방식들,2. 진화론적 무신론, 창조론적 유신론 및 진화론적 유신론에 관한 정확한 이해와 각 관점의 특징들 등이다."
                        },
                        {
                            "과목 코드": "HFU4009",
                            "과목명": "영성과 문화예술",
                            "강의 시간": "강의 3시간",
                            "학점": "3학점",
                            "내용": "인류(내지는 우리 민족) 역사의 문맥 안에서 예술적 상상력을 통한 인간과 세계의 구원 문제가 어떻게 드러나는가를 살펴보고, 실제 작품들을 통해 구원의 다양한 주제들의 현대적 양상을 고찰함으로써 종교적 심성을 계발한다."
                        },
                        {
                            "과목 코드": "HFU4011",
                            "과목명": "더 나은 삶을 위한 가치교육",
                            "강의 시간": "강의 3시간",
                            "학점": "3학점",
                            "내용": "본 과목은 학생들로 하여금 취업과 성공너머 ‘더 나은 세상’에 관한 가치들에 대해 배움으로써 ‘더 나은 삶’, 곧 공부하고 살아가는 더 나은 이유와 의미를 스스로 모색하도록 이끄는 가치교육 과목이다. 본 과목은 〈가톨릭 사회론〉의 정치, 노동, 경제, 문화와 교육, 환경 등의 주제별 가르침과 정의, 평화, 자유, 평등, 인권, 공동선, 민주주의 등의 시민적·복음적 가치들을 ‘더 나은 세상’을 추구하는 하나의 텍스트로서 먼저 공부하고 열린 토론을 함으로써 사회적 관심과 연대의식 및 가치관의 폭을 넓히고, 더 나아가 학생들 스스로 진정 ‘더 나은 삶’을 위한 가치관을 확립해 가는데 도움이 되고자 한다."
                        },
                        {
                            "과목 코드": "HFU4014",
                            "과목명": "영성수련",
                            "강의 시간": "강의 1시간, 실습 1시간",
                            "학점": "2학점",
                            "내용": "하느님과 인간 그리고 세계에 대하여 잘 고찰할 수 있도록 기도의 체험을 제공하고자 한다. 특히 이냐시오의 영성이 소개될 것이고 그 방법에 따라 기도를 체험하도록 한다.",
                            "비고": "S / U 평가"
                        },
                        {
                            "과목 코드": "HFU4021",
                            "과목명": "성화로 성경읽기",
                            "강의 시간": "강의 3시간",
                            "학점": "3학점",
                            "내용": "성경이란 무엇인가를 이해하고 성경 형성과정을 살펴본다. 그리고 성경을 주제로 한 그림들을 통해 구약성경 및 신약성경의 이야기에 접근한다. 본 과목은 그림을 통하여 성경을 이해하고 예술적 교양을 심화시키는 것을 목적으로 한다."
                        },
                        {
                            "과목 코드": "HFU4025",
                            "과목명": "소명과 선택",
                            "강의 시간": "강의 4시간, 실험/실습 23시간",
                            "학점": "1학점",
                            "내용": "이 과목은 학부 1학년 중핵필수과목인 ‘성찰과 성장1’과 연계하여, 앞서 익힌 성찰방법을 심화하여 인생을 전망해보는 교양선택과목입니다. 이 과목을 통해 수강자는 청년기에 던져야 할 질문들을 교우들과 함께 대면하고, 그 과정에서 우정과 연대 의식을 공유하게 됩니다. 이 작업은 ‘행복한 삶(생의 소명)’과 ‘사랑하는 삶(실천)’이 어떤 것인지를 참가자 스스로가 설명할 수 있도록 이끌어 줍니다.",
                            "비고": "S / U 평가"
                        }
                    ],
                    "③ 윤리와 사상": [
                        {
                            "과목 코드": "ETS2003",
                            "과목명": "철학 산책",
                            "강의 시간": "강의 3시간",
                            "학점": "3학점",
                            "내용": "동서고금의 철학사에 나타난 철학적 문제의 식을 검토함으로써 철학적 사유와 그 방법을 익힌다."
                        },
                        {
                            "과목 코드": "ETU4001",
                            "과목명": "환경 윤리",
                            "강의 시간": "강의 3시간",
                            "학점": "3학점",
                            "내용": "산업사회의 발전과 자연의 무분별한 사용에 따라 빈번하게 나타나는 환경재난에 직면하여, 먼저 생명위기의 근원적 원인으로 간주되는 서양적 세계관을 추적하여 진단하고, 또한 산업사회의 자연 이데올로기를 분석하여, 위기극복의 방안으로 제시되는 여러 서양 이론을 다룬다."
                        },
                        {
                            "과목 코드": "ETU4002",
                            "과목명": "정보 윤리학",
                            "강의 시간": "강의 3시간",
                            "학점": "3학점",
                            "내용": "정보화 사회의 지배적 커뮤니케이션의 장인 사이버 공간을 중심으로 새로운 시대의 기술문명과 정보의 윤리적 활용에 대하여 성찰하고 성숙한 실천 방안을 모색한다."
                        },
                        {
                            "과목 코드": "ETU4003",
                            "과목명": "직업과 윤리",
                            "강의 시간": "강의 3시간",
                            "학점": "3학점",
                            "내용": "직업 생활에 필요한 윤리의식을 함양한다."
                        },
                        {
                            "과목 코드": "ETU4004",
                            "과목명": "동아시아철학 고전 읽기",
                            "강의 시간": "강의 3시간",
                            "학점": "3학점",
                            "내용": "동양의 대표적인 철학 고전을 선택하여 읽고 그 속에 담긴 사상을 이해하고 검토한다."
                        },
                        {
                            "과목 코드": "ETU4005",
                            "과목명": "서양철학 고전 읽기",
                            "강의 시간": "강의 3시간",
                            "학점": "3학점",
                            "내용": "서양의 대표적인 철학 고전을 선별하여 읽고 그 속에 담긴 사상을 이해하고 검토한다."
                        },
                        {
                            "과목 코드": "ETU4008",
                            "과목명": "삶과 죽음",
                            "강의 시간": "강의 3시간",
                            "학점": "3학점",
                            "내용": "인생의 중심에 자리 잡고 있는 삶 그 자체와 죽음의 문제를 철학적으로 검토하고 토론함으로써 인생의 궁극적 의미가 무엇인지 생각해 본다."
                        },
                        {
                            "과목 코드": "ETU4009",
                            "과목명": "영화와 철학",
                            "강의 시간": "강의 3시간",
                            "학점": "3학점",
                            "내용": "현대 사회의 주요 영상 매체인 영화를 대상으로 그 속에 나타난 다양한 철학적 주제를 찾아내고 그것이 우리의 실질적 삶에 주는 메시지와 관련하여 그 본래의 의미를 철학적으로 검토하고 토론한다."
                        },
                        {
                            "과목 코드": "ETU4010",
                            "과목명": "한국 문화와 종교",
                            "강의 시간": "강의 3시간",
                            "학점": "3학점",
                            "내용": "다원적 종교 전통이 살아 있는 한국의 문화적 특성을 고찰하고, 한국인의 가치관과 사회관에 영향을 주고 있는 종교 전통들을 분석하여 미래를 전망한다."
                        },
                        {
                            "과목 코드": "ETU4016",
                            "과목명": "종교, 폭력, 평화",
                            "강의 시간": "강의 3시간",
                            "학점": "3학점",
                            "내용": "인류 역사상의 중요 폭력 사태를 종교적 관점에서 고찰하고 문화적, 종교적 갈등을 극복하여 평화를 추구하는 인류의 노력의 중요성에 대하여 이해한다."
                        },
                        {
                            "과목 코드": "ETU4018",
                            "과목명": "행복의 추구",
                            "강의 시간": "강의 3시간",
                            "학점": "3학점",
                            "내용": "행복이란 무엇이며, 자신이 원하는 ‘행복의 추구’에 대한 근본적인 가치관에 대해 고찰해 보고자 한다. 이를 위해 철학, 종교, 법, 사회 등 모든 영역에서 이야기하는 행복의 의미를 살펴보고, 행복에 대한 자신의 가치관을 점검하는 시간을 가지고자 한다."
                        }
                    ],
                    "④ 문명과 역사": [
                        {
                            "과목 코드": "CHS2001",
                            "과목명": "한국 문화와 역사",
                            "강의 시간": "3시간",
                            "학점": "3학점",
                            "내용": "한국사의 전개를 한국 문화의 형성과 발전을 중심으로 개관하고, 한국사의 정치·경제·사회·문화의 제 측면에 대해 포괄적으로 이해한다. 고대부터 조선시대까지를 다룬다."
                        },
                        {
                            "과목 코드": "CHS2006",
                            "과목명": "역사란 무엇인가",
                            "강의 시간": "3시간",
                            "학점": "3학점",
                            "내용": "역사의 본질이 무엇인가를 알기 위해, 역사학의 연구 방법과 개념 및 이론을 쉽게 풀이하여 상식적인 접근 방법을 통해 다루는 입문 과목으로, 역사에 대한 기초적인 지식과 더불어 시대적인 통찰력과 사고력을 키우는 것을 목표로 한다."
                        },
                        {
                            "과목 코드": "CHU4002",
                            "과목명": "인물로 본 한국사",
                            "강의 시간": "3시간",
                            "학점": "3학점",
                            "내용": "한국사의 특정 시기·주제·사건과 관련된 인물들을 한국사의 발전 과정과 연계하여 고찰한다. 대중적인 인물 중심 사관의 단점을 보완하면서 한국사를 입체적으로 이해한다."
                        },
                        {
                            "과목 코드": "CHU4003",
                            "과목명": "한국의 기념과 기억문화",
                            "강의 시간": "3시간",
                            "학점": "3학점",
                            "내용": "한국사회가 고대부터 현대에 이르기까지 역사를 어떻게 기억하고 기념하는지를 비판적으로 검토한다. 역사적 기억과 기념에 대한 이론적인 학습을 바탕으로, 각종 박물관, 기념관, 기념물, 기념행사, 묘역, 시민 대상 역사 체험 프로그램, 디지털 기념관 및 홈페이지 등을 직접 답사하거나 체험하고, 각 장소와 행사의 의미와 한계, 문제점을 고찰한다."
                        },
                        {
                            "과목 코드": "CHU4005",
                            "과목명": "인물로 본 중국사",
                            "강의 시간": "3시간",
                            "학점": "3학점",
                            "내용": "중국사에 등장하는 다양한 인물들의 행적을 고찰함으로써 역사 발전에 대해 이해한다. 대중적인 인물 중심 사관의 단점을 보완하면서 인물 탐구를 통해 중국사의 발전 과정을 입체적으로 이해한다."
                        },
                        {
                            "과목 코드": "CHU4007",
                            "과목명": "인물로 본 서양사",
                            "강의 시간": "3시간",
                            "학점": "3학점",
                            "내용": "서양사에 등장하는 다양한 인물들의 행적을 고찰함으로써 역사 발전에 대해 이해한다. 대중적인 인물 중심 사관의 단점을 보완하면서 서양사의 발전 과정을 입체적으로 이해한다."
                        },
                        {
                            "과목 코드": "CHU4010",
                            "과목명": "성의 역사",
                            "강의 시간": "3시간",
                            "학점": "3학점",
                            "내용": "고대부터 현대까지 나타난 성적 관행, 결혼, 가족 등을 주제로 성이 어떻게 사회적으로 규정되어 영위되고 변하여 왔는가를 고찰한다. 기존의 역사 서술을 전면적으로 재조명하는 새로운 역사적 시각을 제시하는 입장에서 여성사 연구의 기초 이론과 여성사 서술의 실제를 고찰한다."
                        },
                        {
                            "과목 코드": "CHU4011",
                            "과목명": "영화로 본 역사",
                            "강의 시간": "3시간",
                            "학점": "3학점",
                            "내용": "현대 대중문화의 총아인 영화가 역사를 이해하는 효과적인 경로일 수 있음을 전제로 다양한 성격의 영화들을 매체로 하여 입체적으로 역사를 이해한다."
                        },
                        {
                            "과목 코드": "CHU4013",
                            "과목명": "문학작품으로 읽는 한국사",
                            "강의 시간": "3시간",
                            "학점": "3학점",
                            "내용": "근현대 문학작품을 통하여 한국 전통사회부터 현대에 이르기까지 한국 사회의 성격과 변화에 대해 살펴본다."
                        },
                        {
                            "과목 코드": "CHU4016",
                            "과목명": "한국사와 유교문화",
                            "강의 시간": "3시간",
                            "학점": "3학점",
                            "내용": "한국 전통문화의 중심을 이루는 조선시대의 유교문화에 대하여 역사적 입장에서 그 내용과 성격을 살핀다."
                        },
                        {
                            "과목 코드": "CHU4018",
                            "과목명": "이주의 역사",
                            "강의 시간": "3시간",
                            "학점": "3학점",
                            "내용": "오늘날 전 세계에서 일어나고 있는 이주현상에 대한 분석과 함께 이주민 통합정책 및 그 역사를 탐구한다. 이를 통해 다문화 사회에 대한 전향적인 이해를 도모한다."
                        },
                        {
                            "과목 코드": "CHU4019",
                            "과목명": "인물로 본 일본사",
                            "강의 시간": "3시간",
                            "학점": "3학점",
                            "내용": "일본사에 등장하는 다양한 인물들의 삶을 살펴봄으로써 일본사에 대한 이해를 높이고, 나아가 인물이 역사에서 수행한 역할에 대한 이해를 도모한다. 이를 통해 역사적인 인물을 그가 살았던 시대적 환경과 맥락 속에서 평가할 수 있는 눈을 키운다."
                        },
                        {
                            "과목 코드": "CHU4020",
                            "과목명": "유라시아의 문명과 교류",
                            "강의 시간": "2시간",
                            "학점": "2학점",
                            "내용": "유라시아 지역 문명의 형성 과정과 다양성을 비교 검토하고 다양한 유라시아 문명간의 교류의 역사를 파악하는 것을 목표로 한다."
                        },
                        {
                            "과목 코드": "CHU4021",
                            "과목명": "4차혁명과 인문학",
                            "강의 시간": "3시간",
                            "학점": "3학점",
                            "내용": "이 과목은 산업, 경제, 정치의 변화를 중점으로 논의하는 ‘4차 산업혁명’에서 더 근본적인 수준의 변화에 중점을 두는 ‘4차 혁명’으로 논의의 시점에 변화를 줌으로써 기술이 기술의 본성 그리고 기술 발달로 인해 ‘인간과 세계에 대한 우리의 이해’가 어떻게 변화하고 있으며 그 의미는 무엇인지 살펴보고자 한다. 또한 인공지능과 같은 기술 활용 영역에 따라 발생할 수 있는 다양한 문제와 쟁점들을 개별적으로 이해하고 발굴할 뿐만 아니라 ‘인간과 세계에 대한 우리의 이해’에 대한 관점에서 통합적으로 사유할 수 있는 역량을 키우는 것을 목표로 한다."
                        },
                        {
                            "과목 코드": "CHU4022",
                            "과목명": "이슬람과 서양: 문명교류의 역사",
                            "강의 시간": "3시간",
                            "학점": "3학점",
                            "내용": "근대 이전 무슬림들은 지중해를 사이에 두고 유럽과, 20세기부터는 북미(미국, 캐니다)와 교류하였다. 이슬람은 7세기 태동 시기부터 유럽 그리스도교 문명과 밀접한 관계를 맺었고 십자군, 콘스탄티노플 함락, 나폴레옹 이집트 침략 등 굵직굵직한 역사적 사건을 남겼다. 또 에너지와 안보를 매개로 북미는 초강대국으로 부상한 미국과 애증의 역사를 써왔다. 현대 서양은 이슬람문화권에서 오는 이주민을 두고 심각한 문화마찰을 빚고 있다. 이 과목은 이슬람과 서양문명의 교류사를 만남, 교류, 갈등, 공존이라는 주제어로 개관하며 세계사를 보는 시각의 지평을 넓힌다."
                        },
                        {
                            "과목 코드": "SHU4052",
                            "과목명": "세계대전의 이해",
                            "강의 시간": "3시간",
                            "학점": "3학점",
                            "내용": "20세기 전반부에 있었던 두 번의 세계대전은 20세기 후반부의 세계를 규정하였고 그 여파는 21세기 오늘날에도 미치고 있다."
                        }
                    ],
                    "⑤ 사회와 인간": [
                        {
                            "과목 코드": "HSS3016",
                            "과목명": "진로탐색 입문",
                            "강의시간": "1.5시간",
                            "평가방식": "S/U 평가",
                            "학점": "1학점",
                            "내용": "자기탐색도구를 통해 자신의 행동스타일 및 직무연관성을 측정해보고 진로를 탐색할 수 있도록 돕는다. 진로와 삶에 대해 생각해보고 자신의 Vision을 설정한 후, 이에 대한 실행 계획을 수립한다."
                        },
                        {
                            "과목 코드": "HSS3017",
                            "과목명": "학습매니지먼트",
                            "강의시간": "2시간",
                            "평가방식": "S/U 평가",
                            "학점": "1학점",
                            "내용": "능동적인 학습자가 되기 위한 자기주도학습의 핵심 전략을 인지적 측면, 정의적 측면, 환경 관리의 측면에서 다루어보고, 이를 실제 학습생활에 적용하도록 훈련하는 실습을 병행한다."
                        },
                        {
                            "과목 코드": "HSS3025",
                            "과목명": "진로탐색 심화",
                            "강의시간": "1.5시간",
                            "평가방식": "S/U 평가",
                            "학점": "1학점",
                            "내용": "진로탐색의 심화과정으로, 진로 포트폴리오 구성, 기업/산업/직무 분석, 커리어 전략토론, 자기소개서 완성 및 면접 준비 등 진로 설계를 위한 일련의 과정을 실습함으로써, 장기적 관점에서 사회 진출과 취업준비를 지원한다."
                        },
                        {
                            "과목 코드": "SHS2008",
                            "과목명": "창업과 기업경영",
                            "강의시간": "3시간",
                            "학점": "3학점",
                            "내용": "신기술 기반의 벤처창업의 의의와 중요성을 이해하고, 사업계획서 실습을 통해 의미와 내용 작성 방법을 이해함으로써 기업경영의 실체를 학습하는 데에 역점을 두고 있다. 이외에도 기업 경영상 발생할 수 있는 여러 사례 (벤처성공 및 실패 사례 등)를 토의함으로써 성공적인 창업의 노하우를 습득한다."
                        },
                        {
                            "과목 코드": "SHU2001",
                            "과목명": "인공지능 규제의 윤리 및 법적 쟁점(탐구공동체)",
                            "강의시간": "1.5시간",
                            "학점": "1.5학점",
                            "내용": "인공지능의 발전 상황을 점검하고 인공지능의 안전한 이용을 위하여 필요한 윤리적, 법적인 쟁점에 관하여 설명하고 상호 토론한다."
                        },
                        {
                            "과목 코드": "SHU4001",
                            "과목명": "북한의 이해와 통일 후 한국",
                            "강의시간": "3시간",
                            "학점": "3학점",
                            "내용": "통일에 대한 이론적 고찰, 통일의 국제환경, 분단국 통일 사례, 통일 시나리오 평가 및 통일의 과제 등의 주제를 중심으로 한반도 통일문제를 포괄적으로 이해한다."
                        },
                        {
                            "과목 코드": "SHU4004",
                            "과목명": "평화교육론",
                            "강의시간": "3시간",
                            "학점": "3학점",
                            "내용": "오늘날 우리 사회는 물론 현대문명의 가장 중요한 주제인 평화의 문제를 생태적, 생활 세계적 및 주관적 차원 등에서 총체적으로 이해하며, 특히 평화라는 가치의 교육적 의미를 찾아보고 그 교육적 실천의 필요성과 가능성을 모색한다."
                        },
                        {
                            "과목 코드": "SHU4007",
                            "과목명": "국제이해 교육",
                            "강의시간": "3시간",
                            "학점": "3학점",
                            "내용": "지구화 시대에 한국이 나아가야 할 국제이해교육의 방향을 살펴보고, ‘함께 사는’ 방안으로서 평화, 인권, 발전, 환경, 과학기술, 문화 등의 세계적 이슈에 대해 실천적 지식과 공존의 시각을 함양하는 것을 목표로 한다."
                        },
                        {
                            "과목 코드": "SHU4014",
                            "과목명": "식량과 사회",
                            "강의시간": "3시간",
                            "학점": "3학점",
                            "내용": "식량문제를 현대 사회 전체의 문제로 파악하고, 새로운 해결책을 검토한다."
                        },
                        {
                            "과목 코드": "SHU4016",
                            "과목명": "현대사회와 복지국가",
                            "강의시간": "3시간",
                            "학점": "3학점",
                            "내용": "사회복지정책의 개념정립, 복지국가 발전에 영향을 준 다양한 이데올로기 연구, 복지국가의 발전에 관한 이론 검토, 복지정책의 과정·내용·효과 분석을 위한 준거 틀에 대한 이해, 복지제도의 이해 등을 기초로 복지국가의 현재를 이해하고 미래의 발전을 조망하는 능력을 배양한다."
                        },
                        {
                            "과목 코드": "SHU4019",
                            "과목명": "삶과 교육",
                            "강의시간": "3시간",
                            "학점": "3학점",
                            "내용": "인간 삶에 있어서 교육이 차지하고 있는 중요성에 대하여 이해하고, 교육적 체험의 가치를 직접 체득하도록 한다. 가르치고 배우는 즐거움과 열정을 체험함으로써, 학창생활과 졸업 후 사회생활을 누리는 데 도움을 주고자 한다."
                        },
                        {
                            "과목 코드": "SHU4023",
                            "과목명": "성 의식과 인간이해",
                            "강의시간": "3시간",
                            "학점": "3학점",
                            "내용": "문화이며 생활 그 자체인 성의 생리·심리·사회·문화·영적 측면에서 성을 바라보는 다양한 관점을 듣고 말하고 성찰하여, 성적 존재로서 성숙한 인격형성을 촉진한다."
                        },
                        {
                            "과목 코드": "SHU4024",
                            "과목명": "결혼준비 특강",
                            "강의시간": "3시간",
                            "학점": "3학점",
                            "내용": "결혼을 위하여 갖추어야 할 마음의 자세를 중심으로 올바른 생활 태도를 기른다. 이성관, 인생관, 자녀관, 삶에 대한 준비 등을 올바로 갖출 수 있는 길을 강의한다."
                        },
                        {
                            "과목 코드": "SHU4028",
                            "과목명": "인문 지리",
                            "강의시간": "3시간",
                            "학점": "3학점",
                            "내용": "환경과 인간과의 관계, 인구와 자원과의 관계, 산업입지와 지역개발과의 관계 등 지리적 문제를 파악함으로써 지리학을 올바로 이해하고 환경보전, 인구정책, 자원개발을 비롯한 국토종합개발을 위한 종합적인 해결 능력을 배양한다."
                        },
                        {
                            "과목 코드": "SHU4029",
                            "과목명": "광고로 사회읽기",
                            "강의시간": "3시간",
                            "학점": "3학점",
                            "내용": "광고는 시대의 흐름과 변화를 무엇보다도 잘 반영해주고 있다. 광고 분석을 통하여 사회의 특성과 변화추세를 파악할 수 있기 때문에 이 강의는 우리 주변에 흔히 발견되는 광고의 사회학적 의미를 탐색하는 것을 목적으로 한다."
                        },
                        {
                            "과목 코드": "SHU4031",
                            "과목명": "인권과 교육",
                            "강의시간": "3시간",
                            "학점": "3학점",
                            "내용": "교사의 입장에서 그리고 장차 학부모의 입장에서, 인권교육을 실제로 실행하기에 필요한 지식, 문제의식, 방법론에 대해 고찰한다. 인권에 대한 일반론, 인권교육방법론, 학교인권교육의 주제, 내용 및 방법론에 이어, 인권향상을 위한 가정교육과 학부모의 역할 등을 다룬다."
                        },
                        {
                            "과목 코드": "SHU4032",
                            "과목명": "세계화와 다문화 사회",
                            "강의시간": "3시간",
                            "학점": "3학점",
                            "내용": "세계화가 각 지역의 경계 허물기를 실행하면서 물적 자원 뿐 아니라 다양한 인구 이동을 가능하게 하고 있다. 각 지역의 인구구성과 문화적 정체성은 이러한 환경 속에서 재조정될 수밖에 없다. 이 강의는 세계화가 다문화사회에 미치는 영향을 중점적으로 다룬다."
                        },
                        {
                            "과목 코드": "SHU4054",
                            "과목명": "인간관계의 심리와 대인관계 기술",
                            "강의 시간": "3시간",
                            "학점": "3학점",
                            "내용": "현대 심리학의 다양한 인간관계 이론을 습득하고 이러한 개념과 이론이 생활과 현장에서 어떻게 적용되는지를 소개한다. 인간관계의 발달, 필요성 뿐만 아니라 부모-자녀, 또래, 이성관계, 직장 등 다양한 인간관계 상황에서 일어나는 현상을 이해하고 건강한 대인관계 기술 능력을 함양한다."
                        },
                        {
                            "과목 코드": "SHU4057",
                            "과목명": "공감의 시대",
                            "강의 시간": "2시간",
                            "학점": "2학점",
                            "내용": "타인의 처지를 이해하고 깊이 공감하는 다양한 체험과 성찰을 통하여, 학생들이 스스로 배우고, 발견하며, 창조하고 반성하는 독립적인 학습자로 자신의 양성을 스스로 지속시키려는 능력과 관심을 갖게 하는 것을 목표로 하며, 건학이념인 타인과 함께 가는 사람으로 성장함을 주요한 가치로 삼는다."
                        },
                        {
                            "과목 코드": "SHU4058",
                            "과목명": "내가 설계하는 최고의 인문학",
                            "강의 시간": "2시간",
                            "학점": "2학점",
                            "내용": "학생들의 관심 주제로 동료학생들을 대상으로 실험적이고도 다양한 인문학 코스를 설계하는 과정을 통해 스스로 배우고, 발견하며, 창조하고 반성하는 독립적인 학습자로서 양성하는 것을 목표로 한다."
                        },
                        {
                            "과목 코드": "SHU4060",
                            "과목명": "생명의 사랑학",
                            "강의 시간": "3시간",
                            "학점": "3학점",
                            "내용": "본 과목은 가톨릭 사제교수, 혼인 20년차 이상의 시니어부부와 5년차 이내의 주니어부부의 팀티칭을 통해 연애기간과 혼인생활 안에서 사랑과 일치를 이룬 생생한 체험담을 들려주고 서로의 생각과 경험을 토론하는 방식으로 진행된다. 본 강의에서는 진정한 사랑의 의미를 이해하고, 배우자와 “생명”을 주는 관계를 맺으며 서로 성장시킬 수 있는 방법을 배운다. 또한 자녀는 하느님으로부터 부여받은 선물로서, 이성과 감성, 그리고 영성을 겸비한 한 사람의 인격체로 양육하는 방법을 배운다. 아울러 일치하는 혼인 생활을 위해 가족관계, 부부의 건강한 성, 자녀의 출산과 양육, 재정 등의 모든 문제를 미리 계획하고 실천하는 방법을 배운다."
                        },
                        {
                            "과목 코드": "SHU4062",
                            "과목명": "미래학",
                            "강의 시간": "3시간",
                            "학점": "3학점",
                            "내용": "본 과목은 미래의 사회, 경제, 정치, 기술 등에 대한 내용과 함께 주요 미래학자에 관한 소개로 구성된다. 델파이, 시나리오 기법과 같은 전통적인 미래 예측 기법과 함께 최신 예측 기법인 빅데이터 기법을 이용한 미래 예측 방법론을 간단히 다룬다. 또한 미래에 있어서 가장 중요한 키워드인 ‘미래와 창의성’ 그리고 ‘미래와 생존’에 관한 주요 이슈가 다루어진다."
                        },
                        {
                            "과목 코드": "SHU4063",
                            "과목명": "4차산업혁명과 기업가정신",
                            "강의 시간": "2시간",
                            "학점": "2학점",
                            "내용": "창업 및 취업을 희망하는 학생들에게, 4차 산업혁명에 대한 기본적인 이해와 시사점을 바탕으로, 기업 및 기업가 정신에 대한 일반적인 이해 및 직업 개발의 다양한 세계를 알려주고, 졸업 후 본인의 진로(전공 포함)를 결정하는데, 도움을 주기 위한 과정이며, 이번 학기에는 한국산업기술진흥협회 CTO클럽과 공동으로 진행하는 교과목이다."
                        },
                        {
                            "과목 코드": "SHU4065",
                            "과목명": "글로벌 경제 및 금융시장 분석과 대응",
                            "강의 시간": "3시간",
                            "학점": "3학점",
                            "내용": "주요 경제 지표를 해설하고 최근 미국, 중국 등 세계 경제 분석과 전망, 환율 동향, 한국 경제의 현황과 전망을 논의하며 또한 주식, 채권, 주택 가격을 분석 하여 개인 및 기업의 적정 자산 배분 전략을 다룬다."
                        },
                        {
                            "과목 코드": "SHU4066",
                            "과목명": "베트남 사회와 문화",
                            "강의 시간": "3시간",
                            "학점": "3학점",
                            "내용": "이 과목은 현대 베트남 사회와 문화를 이해하는데 목표를 둔다. 베트남은 중국과의 관계, 분단, 통일 등 역사적으로 한국과 유사한 역사적 경험을 공유하고 있으며, 문화적으로도 불교, 유교 문화와 한자를 받아들여 사용하는 등 유사한 부분이 많은 국가다. 근래에는 양국 관계가 경제적으로나 인적 교류 등 여러 부문에서도 활성화되었다. 현대 베트남 사회를 이해하기 위해, 현대사, 문화, 현대 사회의 제문제들을 학습한다."
                        },
                        {
                            "과목 코드": "SHU4067",
                            "과목명": "동남아시아 현대사회의 이해",
                            "강의 시간": "3시간",
                            "학점": "3학점",
                            "내용": "이 과목은 동남아시아 현대 사회를 이해하는데 목표를 둔다. 동남아시아 국가들은 한국과 지리적으로 근접해 있을 뿐만 아니라 근래 정치경제 및 인적 교류면에서도 한국과의 관계를 급속히 확대하고 있다. 이러한 밀접한 관계를 유지하고 있는 동남아에 대해 이해함으로써 양자간 관계의 발전을 위한 기초를 다지고자 한다."
                        },
                        {
                            "과목 코드": "SHU4068",
                            "과목명": "한·중 정치사회의 이해(중국어)",
                            "강의 시간": "3시간",
                            "학점": "3학점",
                            "내용": "중국 유학생들을 대상으로 한국 사회 생활 및 대학교육 이수에 필요한 핵심적인 문제들을 다룬다. 한국의 정치와 사회에 대한 단순한 소개를 지양하고 비교의 관점에서 중국과 한국의 차이점을 체계적으로 분석함으로써 심층적 차원에서 개별 국가의 특징을 이해하는 데 초점을 둔다."
                        },
                        {
                            "과목 코드": "SHU4070",
                            "과목명": "한국의 공공외교",
                            "강의 시간": "3시간",
                            "학점": "3학점",
                            "내용": "한국의 공공외교가 어떤 배경으로 등장했는지, 그리고 현재 어떤 형태로 진행되고 있는지, 앞으로의 과제는 무엇인지에 대해 학습한다. 이 과목을 통해 학생들은한국의 공공외교의 현실과 이론에 대해 학습함으로써 향후 더욱 확산될 것으로 예상되는 공공외교 분야에 종사할 수 있는 이론과 경험을 쌓게 될 것이다."
                        },
                        {
                            "과목 코드": "SHU4071",
                            "과목명": "기업으로 본 아시아 현대사회",
                            "강의 시간": "3시간",
                            "학점": "3학점",
                            "내용": "21세기는 기업으로 시작해서 기업으로 끝난다고 해도 과언이 아닌 시대다. 우리는 현대사회를 이해하는 데에 있어 기업을 제외하고는 상상할 수 없는 환경에 살고 있다. 그러한 배경으로 우리는 대부분의 기업이 다국적 기업인 현대 사회에 기업이 우리가 속한 사회에서 가지는 의미와 역할에 대해 좀 더 넓은 시야에서 바라볼 필요가 있다. 본 강의는 기업 자체에 대한 전문적인 지식보다 아시아의 근대적 문명이 형성되는 과정에서 기업은 어떠한 역사적 경험을 거쳐 현재에 이르렀는지를 살펴보고, 기업이 우리 사회에 던지는 다양한 논쟁점들을 이해하기 위해 개설되었다."
                        },
                        {
                            "과목 코드": "SHU4073",
                            "과목명": "법이란 무엇인가?",
                            "강의 시간": "3시간",
                            "학점": "3학점",
                            "내용": "이 과목은 법의 본질과 원리, 법의 목적과 존재 의미, 법학의 기초개념과 법률관계 등에 대한 법학 지식 일반에 대하여 알아보고 법적 사고의 습득을 목적으로 한다. 이를 위하여 문학작품, 영화의 주제와 소재로 다뤄지는 국가, 정치, 범죄, 가족, 사랑 등과 관계되는 다양한 법률적 쟁점들을 인문학적, 사회과학적 시각에서 살펴봄으로써 법학 기초지식과 이해를 확장할 수 있다."
                        },
                        {
                            "과목 코드": "SHU4074",
                            "과목명": "기후변화와 사회정의",
                            "강의 시간": "3시간",
                            "학점": "3학점",
                            "내용": "본 과목은 사회·경제·환경정의의 교차성에 주목하여 오늘날의 기후 위기를 야기하고 있는 구조적 원인과 책임 소재, 급격한 기후변화가 정치·경제·사회에 미치는 차등적 영향, 그리고 기후변화를 막기 위해 제시되고 있는 주요 정책들이 전제하는 사회적 가정을 비판적으로 검토한다. 이를 통해 기후위기, 불평등과 부정의가 중첩되는 양상을 체계적으로 이해하고, 보다 정의롭고, 평등하며, 민주적인 기후위기 대응과 실천방안을 모색한다."
                        },
                        {
                            "과목 코드": "SHU4075",
                            "과목명": "문화산업과 법",
                            "강의 시간": "3시간",
                            "학점": "3학점",
                            "내용": "이 수업은 문화산업 분야에서 발생하는 법적 분쟁의 원인과 이해관계의 충돌, 그리고 분쟁의 해결에 대한 실제 사례를 이론적·학술적 설명과 함께 학습한다. 이 수업의 목적은 단순한 법률의 해석이 아닌 산업의 구조와 분쟁의 뒤에 숨겨진 이해관계의 충돌을 이해하고, 법률 전공자가 아닌 학생도 쉽게 이해할 수 있도록 학술적인 내용을 풀어 설명하며, 법원이 이해관계를 조절하며 균형점을 찾아 나가는 과정을 이해하는 것이다."
                        },
                        {
                            "과목 코드": "SHU4076",
                            "과목명": "직장 생활과 법",
                            "강의 시간": "3시간",
                            "학점": "3학점",
                            "내용": "고용형태, 고용장소, 고용업종이 아주 다양한 상황에서 이 모든 직장 생활에서 직장인들이 보호받는 기본적 권리를 파악하고, 이 권리의 취지와 지향점을 이해하고, 미래의 직장 생활에서 겪을 수 있는 불이익이나 어려움에 대하여 법적으로 해결할 수 있는 방법을 모색한다. 더 나아가 직장 생활에서 필요한 윤리와 규범 의식을 제고한다."
                        },
                        {
                            "과목 코드": "SHU4077",
                            "과목명": "인간과 인권Ⅰ",
                            "강의 시간": "3시간",
                            "학점": "3학점",
                            "내용": "인권에 관한 이론 지식과 실천 지식 그리고 삶에서 발견되는 다양한 사례를 다룬다. 인권의 의미와 가치, 인권 존중의 기본 태도, 인권침해의 다양한 사례 분석을 통한 합리적인 문제 해결 방안 모색을 통해 교양인으로서 인권의 중요성을 인식하고, 인권 존중의 실천 능력을 함양하는 데 중점을 둔다. 본 교과목은 Ⅰ, Ⅱ로 구성되어 있으며, 「인간과 인권 Ⅰ」에서는 인권의 포괄적인 개념을 시작으로 헌법상의 실천 인권, 인권 침해와 구제 절차, 학교와 인권(언어폭력, 성희롱과 성폭력, 직장 내 괴롭힘 등), 성(性)과 인권(성차별과 인권 등), 노동과 인권(직장에서의 권리와 의무 등)을 다룬다."
                        },
                        {
                            "과목 코드": "SHU4078",
                            "과목명": "인간과 인권Ⅱ",
                            "강의 시간": "3시간",
                            "학점": "3학점",
                            "내용": "인권에 관한 이론 지식과 실천 지식 그리고 삶에서 발견되는 다양한 사례를 다룬다. 인권의 의미와 가치, 인권 존중의 기본 태도, 인권 침해의 다양한 사례 분석을 통한 합리적인 문제 해결 방안 모색을 통해 교양인으로서 인권의 중요성을 인식하고, 인권 존중의 실천 능력을 함양하는 데 중점을 둔다. 본 교과목은 Ⅰ, Ⅱ로 구성되어 있으며, 「인간과 인권Ⅱ」에서는 「인간과 인권Ⅰ」의 기본 지식을 바탕으로 생명과 인권(생명 존중, 존엄사 등), 현대사회와 인권(디지털 사회와 인권, 펜데믹 시대와 인권 등), 장애인 인권, 외국인(이주노동자, 다문화, 종교 등) 및 탈북자 인권 등 좀 더 확장된 주제를 다룬다."
                        },
                        {
                            "과목 코드": "SHU4079",
                            "과목명": "K-영화와 한류",
                            "강의 시간": "3시간",
                            "학점": "3학점",
                            "내용": "글로벌한 문화현상으로 부각되고 있는 한류(K-Wave)의 열풍을 사회과학적으로 진단하며 분석하고, 특별히 대표적인 한국 영화(K-Movie)의 글로벌 성공 사례를 체계적으로 살펴본다."
                        },
                        {
                            "과목 코드": "SHU4080",
                            "과목명": "K-문화와 미디어",
                            "강의 시간": "3시간",
                            "학점": "3학점",
                            "내용": "글로벌한 문화현상으로 부각되고 있는 한국 문화 (K-culture)의 다양한 콘텐츠들을 미디어 관점에서 다양하게 접근하고 사회과학적인 이해를 돕는다. K-pop, K-movie, K-drama, K-webtoon, K-food 등의 K-culture의 글로벌 성공 사례를 체계적으로 살펴본다."
                        },
                        {
                            "과목 코드": "SHU4081",
                            "과목명": "법과 금융",
                            "강의 시간": "3시간",
                            "학점": "3학점",
                            "내용": "경제학과 4학년 학생은 “나름 4년 동안 열심히 공부했지만 경제신문을 독해하는 것이 어렵다.”고 말한다. 또한, 한 일간지 경제부 차장과 경제신문 금융부 중견 기자도 “금융 공부를 어떻게 해야 하느냐?”고 묻는다. 그렇다면, 왜 경제신문을 이해하는 것과 금융 관련 기사를 쓰는 것이 어려울까? 그런데 경제는 실물경제와 금융경제로 이루어져 있다. 실물경제는 학교에서 많이 가르치지만, 금융경제는 많이 가르치지 않는다. 그래서 우리는 금융을 학습한 적이 없다. 그런데 한 마디로 금융은 법이다. 물론 실물경제를 이해해야 금융경제를 이해하기 쉽고, 수십 개가 되는 금융관련법을 이해할 수 있다. 현대사회는 금융세상이 되었다. 대출, 보험, 카드, 주식 등 모두 온통 금융 천지다. 금융은 복잡하고 어려운데, 아무도 가르쳐주지 않아 배운 적이 없다. 미국과 유럽 등 해외 많은 나라에서는 금융교육을 의무교육으로 가르치고, 고교나 대학에서도 상당한 양을 가르친다. 하지만 우리나라는 아직 그렇지 않다. 따라서 이 강의는 금융문맹을 벗어나 금융 관련 신문기사를 독해하는 능력을 함양하고, 사회 진출 시 필요한 금융 지식을 습득하는 것을 목표로 한다. 이를 위해 금융경제를 다루고, 개별 금융법상에 등장하는 금융상품, 금융기관, 금융시장, 금융행정의 핵심 내용을 학습하면서 신문의 주요 기사를 통해 금융을 이해하는 방식으로 진행한다."
                        },
                        {
                            "과목 코드": "SHU4082",
                            "과목명": "현대사회와 민주주의",
                            "강의 시간": "3시간",
                            "학점": "3학점",
                            "내용": "현대사회에서 민주주의란 무엇인가? 현대사회를 살아가는 우리들에게 민주주의는 매우 중요한 가치이자 정치적 개념이다. 많은 이들이 민주주의를 말하지만, 그 내용이 무엇인가에 관해서는 생각이 다르며, 때론 비민주인 것들을 민주주의로 포장하기도 한다. 따라서 이 수업은 현대사회에서 민주주의가 이론적으로 그리고 실제적으로 어떤 의미를 가지는지, 그리고 민주주의 정치체제는 어떤 것인지를 소개하고, 수강생들의 이해를 제고하고자 한다."
                        },
                        {
                            "과목 코드": "SHU4083",
                            "과목명": "창업기회탐색",
                            "설계 시간": "1시간",
                            "학점": "1학점",
                            "내용": "창업 및 창업 준비 활동에 실습학점을 부여하는 과목으로, 창업 관련 활동을 통해 진취적인 기업가정신을 체득하고 창업역량을 함양하는 것을 목적으로 한다.",
                            "비고": "S/U 평가"
                        },
                        {
                            "과목 코드": "SHU4084",
                            "과목명": "한국민주주의와 시민적실천",
                            "강의 시간": "2시간",
                            "학점": "2학점",
                            "내용": "현대 한국의 민주화 과정과 민주화운동의 역사적 경험, 오늘의 한국 민주주의가 직면한",
                            "비고": "S/U 평가"
                        },
                        {
                            "과목 코드": "SHU4086",
                            "과목명": "창업과 회사법",
                            "학점": "3학점",
                            "내용": "창업을 하는 과정에서 반드시 알아야 하는 회사법의 기본 지식에 대하여 공부한다. 회사는 자본주의 발전의 근간이고, 창업시 회사를 설립하는 절차를 거치게 된다. 따라서 창업시 회사 종류의 선택, 회사의 설립 과정, 주식의 발행, 이사와 감사 및 대표이사의 선임 등 회사 기관의 구성, 회사 운영의 기본 원리, 자본금 수집 과정에서 신주발행의 절차 등에 관하여 공부한다. 현대 자본주의 사회에서 창업시 회사의 기본적인 법원리를 알고 있어야 하는 것은 필수적이다."
                        }
                    ],
                    "⑥ 과학과 기술 & AI": [
                        {
                            "과목 코드": "HSS4004",
                            "과목명": "과학과 사회",
                            "학점": "1.5학점",
                            "내용": "오늘날 과학은 사회의 여러 부문에서 필수불가결한 위치를 점하고 있다. 전통적으로 과학은 자연의 ‘보편적인 진리나 법칙의 발견’으로 이해된다. 그에 반해 과학사와 과학기술학(STS)의 관점에서, 과학은 역사적이고 사회적인 맥락에서 다양한 사람이 함께 만들어낸 산물이며, 시대와 문화와 얽혀 함께 변동하는 상태에 있다. 이 과목에서는 과학으로서 지위가 논란이 되는 분야나 주제를 하나 골라서 그 탄생과 논쟁의 역사를 직접 연구해본다. 예시로 성인 ADHD, 만성피로증후군, 사주팔자, MBTI, 창조과학 중에서 하나를 골라, 해당 분야가 등장한 사회정치적 맥락과 과정을 살펴보고 그것의 합리성·신뢰성이 논쟁이 되는 이유를 여러 측면에서 분석한다. 이 연구의 목적은 해당 분야가 과학인지 사이비과학인지 직접 판단을 내리는 데에 있지 않다. 그보다는 과학의 지위는 어떻게 획득되고, 과학과 비과학의 경계는 어떻게 그려지며, 대중은 논쟁적인 과학을 왜 소비하는지 등을 고민해보며 ‘과학’ 자체의 정의와 성격을 색다른 시각에서 본다는 의미가 있다."
                        },
                        {
                            "과목 코드": "HSS4005",
                            "과목명": "양자이론과의식",
                            "학점": "1.5학점",
                            "내용": "이 수업은 현대 과학 문명의 핵심인 양자 이론과 그로 인해 현실화된 양자 컴퓨터 및 인공지능 지식에 대한 비전공자들의 이해를 돕는 데 중점을 둔다. 양자 개념이 여전히 난해하게 느껴질 수 있지만, 이 과정을 통해 학생들은 양자 이론의 핵심 개념을 쉽게 이해하고 양자 기술의 윤리적, 철학적 함의를 융합적으로 사고하는 능력을 키우며 학습한 내용을 바탕으로 SF이야기를 공동 창작하는 과정을 통해 미래 사회에서 필수적인 창의력과 협력적 리더십을 개발할 수 있다. 이 수업은 학생들이 현대 과학 기술의 본질을 이해하고, 이를 통해 미래 사회의 변화를 예측하며 대비할 수 있는 통합적 사고 능력을 갖추도록 돕는 것을 목표로 하며 과학 기술의 발전과 그 사회적 영향을 종합적으로 이해할 수 있는 기회를 제공한다."
                        },
                        {
                            "과목 코드": "LED3004",
                            "과목명": "과학기술과 커뮤니케이션",
                            "학점": "3학점",
                            "내용": "전문적인 과학과 기술에 대한 이해를 높이고, 어려운 과학과 기술을 일반인도 이해하기 쉬운 방법으로 표현하는 방법을 익히고자 한다."
                        },
                        {
                            "과목 코드": "STU4003",
                            "과목명": "인간과 환경",
                            "학점": "3학점",
                            "내용": "본 과목의 목표는 인간사회와 생태환경의 다층적이고 다면적인 상호관계를 비판적으로 고찰할 수 있는 기본 지식과 분석 능력을 함양하는 데 있다. 인간을 둘러싼 사회-생태적 관계, 지속가능성, 환경과 발전, 환경과 젠더, 환경정의 등의 이슈를 이해하고 접근하는 다양한 관점을 학습하고 비교 검토하는 한편, 이들을 활용하여 기후변화, 자원 고갈, 산림 훼손, 물 부족, 방사성/독성 폐기물, 생물다양성 감소 등의 구체적인 환경 사안들을 분석하고 논의한다."
                        },
                        {
                            "과목 코드": "STU4004",
                            "과목명": "생명의 신비",
                            "학점": "3학점",
                            "내용": "생명의 탄생과 본질에 대한 생물학적 개념을 성과 생식, 수정과 발생 및 유전과 진화에 연관시켜 살펴보며, 생명의 존엄성과 생물행동의 다양성 등 생명현상에 관한 제반문제를 다룬다."
                        },
                        {
                            "과목 코드": "STU4005",
                            "과목명": "바다의 이해",
                            "학점": "3학점",
                            "내용": "해양에서 일어나는 자연현상과 특성을 물리학적, 화학적, 생물학적, 지질학적 관점에서 이해하고, 해양환경이 지구환경(기후)변화와 인류의 미래에 미치는 영향과 중요성에 대해 알아본다."
                        },
                        {
                            "과목 코드": "STU4007",
                            "과목명": "지구과학",
                            "학점": "3학점",
                            "내용": "지구와 우주의 구성, 분포, 운동, 상호관계 및 역사를 다룬다. 지구의 내부를 밝히는 지구물리학, 맨틀과 지각의 구성과 변천 과정을 고찰하는 지질학, 해양과 그 운동을 연구하는 해양학, 대기의 구성과 그의 운동을 밝히는 기상학, 태양계 우주의 구성과 분포 및 이들 간의 상호작용을 논하는 천문학 등의 여러 영역을 다룬다."
                        },
                        {
                            "과목 코드": "STU4010",
                            "과목명": "건강과 한의학",
                            "학점": "3학점",
                            "내용": "의학을 전공하지 않는 일반인들이 전통 의학의 원리를 깨달아, 민족 의학을 통한 질병의 치료는 물론 그 예방과 양생(養生)에 도움이 될 수 있도록 한의학의 용어와 기본 이론(생리, 병리, 치법, 치방)을 터득하도록 한다."
                        },
                        {
                            "과목 코드": "STU4012",
                            "과목명": "물리학의 세계",
                            "학점": "3학점",
                            "내용": "현대문명 근간을 물리학의 입장에서 파악한다. 현재 인류가 파악해온 시공간의 개념들과 빛과 물질로부터 알아낸 새로운 개념들이 우리 생활에 어떤 영향을 주고 있는지 알아본다."
                        },
                        {
                            "과목 코드": "STU4014",
                            "과목명": "천문학의 세계",
                            "학점": "3학점",
                            "내용": "천문학은 바빌로니아 시대에 실용적인 필요성에 의해 발달한 점성술(占星術)로부터 유래하며 자연과학 가운데 가장 일찍 시작된 학문으로 코페르니쿠스 등 천문학의 탐구자들의 피나는 노력을 통해 확립된 현대우주론을 이해하고 다양한 자료를 통해 경이로운 우주의 기원과 구조 및 진화 등을 이해한다."
                        },
                        {
                            "과목 코드": "STU4016",
                            "과목명": "사상의학의 이해",
                            "학점": "3학점",
                            "내용": "이 강의는 한국의 전통 의학사상인 사상의학에 대한 이해를 목적으로 한다."
                        },
                        {
                            "과목 코드": "STU4017",
                            "과목명": "건강과 의·약학",
                            "내용": "대한 이해와 정확한 체질 판정을 통해, 음식과 섭생의 중요성을 배우고, 수양으로서 무병장수의 길을 도모하는 한의학의 정신을 이해한다.",
                            "강의 시간": "강의 3시간",
                            "학점": "3학점"
                        },
                        {
                            "과목 코드": "STU4019",
                            "과목명": "자연과학과 예술",
                            "내용": "자연과학 및 공학적 기본 개념을 이해하고 과학적 지식을 기반으로 자신만의 창의적 사고를 통해 예술적인 창작물을 해석한다. 특히 예술과 자연과학이 어떻게 상호연관을 가지고 연계적으로 발전 진화하고 있는지 종합적으로 고찰한다.",
                            "강의 시간": "강의 3시간",
                            "학점": "3학점"
                        },
                        {
                            "과목 코드": "STU4023",
                            "과목명": "우주와 인생",
                            "내용": "주로 인문사회계열 전공 학생들을 대상으로 21세기 첨단과학기술시대의 핵심역할을 수행하는, 자연과학의 기초가 되는 자연법칙 (주로 물리학)에 대한 기본개념을 배우고 이를 바탕으로 오늘날 우주가 왜 이런 모습으로 이루어졌는가를 이해한다. 또한 그 응용분야 및 인접관련분야에 관한 폭넓은 소개와 과학자들을 포함해 인간다운 삶을 살아간 분들(동양과 서양의 영적 스승들)의 삶을 조명하고 이를 바탕으로 대학생들로 하여금 “우주 속에서 나”를 파악시키고자 한다.",
                            "강의 시간": "강의 3시간",
                            "학점": "3학점"
                        },
                        {
                            "과목 코드": "STU4024",
                            "과목명": "현대 바이오텍의 이해와 벤처 응용",
                            "내용": "이 과목은 비과학 전공 학생을 위하여 디자인되었다. 이 과목을 통하여 학생들은 바이오테크에 관련된 여러 가지 기본 이론과 상업화 응용에 대해 배우고, 2학기에 개설되는 생명과학과의 “바이오텍의 상업화 종합설계(BIOG001)” 과목을 통하여 바이오 분야에서의 창업(스타트업)과정으로 적용할 수 있는 기회를 갖게 된다. 바이오의 많은 분야 중 산업화와 밀접한 관계가 있는 바이오텍 분야로의 진입을 위한 기본 이해와 언어를 배운다.",
                            "강의 시간": "강의 3시간",
                            "학점": "3학점"
                        },
                        {
                            "과목 코드": "STU4026",
                            "과목명": "글로벌캡스톤디자인",
                            "내용": "글로벌 캡스톤 디자인 프로젝트로 지역혁신중심 대학지원체계 준비를 위한 관-산-학 협력 프로그램으로 참여 학생들이 지역 및 산업체 문제점 조사, 프로젝트 현장 방문 및 프로젝트 진행을 통해 학생들이 이론적 지식을 실무적 지식으로 전환하고 실제적 문제해결 능력을 함양하는 것을 목표로 한다.",
                            "강의 시간": "설계 2시간, S/U 평가",
                            "학점": "2학점"
                        },
                        {
                            "과목 코드": "STU4027",
                            "과목명": "인공지능의 이해",
                            "내용": "인공지능 기술의 비약적 발전을 토대로 거의 모든 학문 분야에 인공지능 기술이 적용되고 있다. 본 강의는 비전공자를 대상으로 탐색 기법부터 지식표현과 추론, 지도/비지도 학습 알고리즘, 선형회귀, 인공신경망, 딥러닝, LLM(Large Language Model)에 이르기까지 광범위하게 인공지능의 기초 이론과 개념을 학습한다. 또 간단한 프로그래밍도 함께 소개해 배운 것을 응용하고 각 전공 분야에 인공지능을 활용하기 위한 기초 배경 지식을 갖추게 한다.",
                            "강의 시간": "강의 3시간",
                            "학점": "3학점"
                        }    
                    ],
                    "⑦ 언어와 문화": [
                        {
                            "과목 코드": "HSS3011",
                            "과목명": "영어 토론 세미나",
                            "내용": "인문교육 특성화 과목으로 현대 사회에서 논쟁되는 핵심적인 주제들에 대하여 글, 영화, 대중문화 등을 통하여 공부하고 토론한다. 이러한 주제들에 대해 다양한 시각에서 영어로 토론할 수 있도록 학생들을 훈련한다.",
                            "강의 시간": "강의 3시간",
                            "학점": "3학점"
                        },
                        {
                            "과목 코드": "HSS4002",
                            "과목명": "‘주(週)’의 인문학",
                            "내용": "인류문화사의 측면에서 바라보면, 인간은 시간을 통제하고 지배하려는 욕망을 부단히 드러내 왔다. 이와 같은 인간의 욕망이 인위적이고 자의적인 시간 단위 ‘주’를 만들어낸 원동력으로 작용했을 개연성이 크다. ‘주’의 탄생을 문화인류사적으로 추적함으로써 인간의 속성에 한발 더 가까이 다가간다.",
                            "강의 시간": "강의/실습 1.5시간",
                            "학점": "1.5학점"
                        },
                        {
                            "과목 코드": "LAU4003",
                            "과목명": "언어의 이해",
                            "내용": "인간 언어의 특성에 대하여 개략적으로 안내한다. 언어의 구조를 음운, 형태소, 문장 등을 통하여 이해하고, 언어의 계보, 언어의 변화, 문자의 정의 및 종류, 한국어 정서법 및 국어 정책, 언어학과 인접과학 등을 다루어 언어에 대한 기초적 지식을 쌓는다.",
                            "강의 시간": "강의 3시간",
                            "학점": "3학점"
                        },
                        {
                            "과목 코드": "LAU4004",
                            "과목명": "한문의 이해",
                            "내용": "한국 한문학 작품 강독을 통해 한문의 독해력을 함양함과 아울러 선인들의 사상과 정서에 대한 이해를 증진한다.",
                            "강의 시간": "강의 3시간",
                            "학점": "3학점"
                        },
                        {
                            "과목 코드": "LAU4009",
                            "과목명": "실무 논술 작법",
                            "내용": "고급 수준의 글쓰기로 각종 실용 서류 작성과 자기소개서, 보고서, 논설문, 경수필, 중수필, 시사 논문 작성, 학술 논문 작성 등의 능력을 배양한다.",
                            "강의 시간": "강의 3시간",
                            "학점": "3학점"
                        },
                        {
                            "과목 코드": "LAU4042",
                            "과목명": "자연과 문화속의 언어",
                            "내용": "인간의 고유한 능력인 언어능력의 실체를 인문학, 자연과학, 사회과학 등 다양하고 다층적인 차원에서 조망하고, 이를 통해 인간의 마음에 대한 이해를 도모한다.",
                            "강의 시간": "강의 3시간",
                            "학점": "3학점"
                        },
                        {
                            "과목 코드": "LAU4044",
                            "과목명": "기호학으로 문화 읽기",
                            "내용": "기호학이론을 통해 동서고금의 다양한 문화현상을 텍스트로 읽는다. 이 강좌를 통해 학생들은 현대 사회를 분석하는 유용한 틀로서 기호학에 대한 이해를 넓히고, 그를 활용해 인간의 의사소통의 본질을 보다 잘 이해할 수 있게 된다.",
                            "강의 시간": "강의 3시간",
                            "학점": "3학점"
                        },
                        {
                            "과목 코드": "LAU4046",
                            "과목명": "연극과 퍼포먼스",
                            "내용": "연극과 퍼포먼스를 교육 소재로 삼는 이교과목은 좀 더 역동적인 교양 수업의 교육과정을 개발하는 데 미래지향적 시각을 제공한다. 앎과 행위, 이론과 실천, 해석과 창조, 추상과 체현 사이의 이분법을 지양하고 세계를 더 이상 읽어야 할 책이 아니라 상호행위자와 함께 참여해야 할 연극적, 퍼포먼스적 무대로 바라보는 바, 본 교과는 대학생들의 교양적 소양을 능동적으로 형성하는데 도움을 주고자 한다.",
                            "강의 시간": "강의 3시간",
                            "학점": "3학점"
                        },
                        {
                            "과목 코드": "LCU4002",
                            "과목명": "영어 워크숍",
                            "details": {
                            "lecture_hours": "강의 3시간",
                            "credits": "3학점",
                            "description": "계절학기에만 개설되는 과목으로, 집중적으로 다양하고 의미 있는 영어문화를 습득할 수 있는 환경을 제공하여 실생활에 필요한 영어를 능숙하게 구사할 수 있게 한다. 교실 수업과 교실 외 현장수업을 병행하여 실시한다."
                            }
                        },
                        {
                            "과목 코드": "LCU4003",
                            "과목명": "중급영어읽기와 토론",
                            "details": {
                            "lecture_hours": "강의 3시간",
                            "credits": "3학점",
                            "description": "산문 형태의 독해자료를 읽고, 영어 토론 및 작문을 통하여 글의 대의, 배경, 저자의 의도 파악 및 논리 전개 등을 연구한다."
                            }
                        },
                        {
                            "과목 코드": "LCU4004",
                            "과목명": "영어쓰기를 통한 비판적 사고",
                            "details": {
                            "lecture_hours": "강의 3시간",
                            "credits": "3학점",
                            "description": "영어를 통한 비판적 사고를 함양하며 영작문 역량을 증진한다. 여러 분야에 보편적으로 적용될 수 있는 문제해결 접근방식을 채택하여 비판적으로 읽고, 생각하고, 쓸수 있도록 독려한다. 또한 다양한 글의 논리적 강점 및 약점을 분석하여 자신의 입장을 효과적으로 전개하도록 한다. 학생들은 고급 분석방법 및 커뮤니케이션 전략에 기반한 명료한 글쓰기 방법을 체득할 수 있다."
                            }
                        },
                        {
                            "과목 코드": "LCU4005",
                            "과목명": "정보매체를 통한 영어",
                            "details": {
                            "lecture_hours": "강의 3시간",
                            "credits": "3학점",
                            "description": "대중적인 정보매체를 활용하여 영어역량을 증진시키며 다양한 문화에 대한 이해를 넓히고 인터넷 상의 커뮤니케이션을 원활하게 할 수 있는 디지털 기술을 습득한다. 다양한 정보매체의 자원을 기반으로 실제 상황에서 사용할 수 있는 실용영어를 익힌다. 영상, 광고, 음악 등의 문화정보매체를 분석하며 사회적 이슈들에 대한 심도 깊은 토론을 통해 비판적 사고를 계발한다."
                            }
                        },
                        {
                            "과목 코드": "LCU4006",
                            "과목명": "고급 영어 연설",
                            "details": {
                            "lecture_hours": "강의 3시간",
                            "credits": "3학점",
                            "description": "공식적인 상황에서 많은 청중을 대상으로 일정한 형식을 갖추어 하는 연설(formal speech)을 연습한다."
                            }
                        },
                        {
                            "과목 코드": "LCU4007",
                            "과목명": "고급영어읽기와 토론",
                            "details": {
                            "lecture_hours": "강의 3시간",
                            "credits": "3학점",
                            "description": "다양한 분야에 걸쳐 논문 수준의 글을 강독함으로써 영문 독해 능력과 각 분야에 대한 지식을 확장한다."
                            }
                        },
                        {
                            "과목 코드": "LCU4011",
                            "과목명": "고급 영어 회화",
                            "details": {
                            "lecture_hours": "강의 3시간",
                            "credits": "3학점",
                            "description": "영어권 대학에서 토론식 수업에 참여할 수 있을 정도 또는 국제 비즈니스에서 불편 없이 업무에 관한 의사소통을 할 수 있을 정도의 영어 회화 능력 함양을 목표로 한다."
                            }
                        },
                        {
                            "과목 코드": "LCU4015",
                            "과목명": "영화를 통한 영어토론",
                            "details": {
                            "lecture_hours": "강의 3시간",
                            "credits": "3학점",
                            "description": "영화에서 묘사된 실제 상황들을 활용하여 영어 표현방법, 말하기, 듣기를 향상시킨다. 영화의 주제를 토대로 주기적인 소그룹 토론을 진행하고 각본을 창작하며 영어글쓰기 실력을 기른다. 또한 영화에 소개된 다양한 삶과 사회의 흥미로운 주제들을 서로 다른 문화권의 관점에서 비교 토의하며 비판적 사고력과 공감 능력을 기른다."
                            }
                        },
                        {
                            "과목 코드": "LCU4017",
                            "과목명": "비즈니스 영어연습",
                            "details": {
                            "lecture_hours": "강의 3시간",
                            "credits": "3학점",
                            "description": "통상, 무역 등 국제 업무에 필요한 실무영어를 현장 중심으로 공부한다. 국제문화와 의사소통을 연구하며 인간관계, 회사조직, 홍보, 회의진행, 발표, 통신 등에 필요한 표현과 영어지식을 습득하도록 한다."
                            }
                        },
                        {
                            "과목 코드": "LCU4018",
                            "과목명": "연극을 통한 영어 연습",
                            "details": {
                            "lecture_hours": "강의 3시간",
                            "credits": "3학점",
                            "description": "실생활에서 다양하게 쓰일 수 있는 실용적인 영어수행능력 향상을 목적으로 한다. 다양한 상황의 역할극, 이야기 만들기, 게임, 연극 등을 통해 영어 의사표현능력을 함양한다."
                            }
                        },
                        {
                            "과목 코드": "LCU4029",
                            "과목명": "이탈리아 사회와 문화",
                            "details": {
                            "lecture_hours": "강의 3시간",
                            "credits": "3학점",
                            "description": "오늘날의 이탈리아 문화 전반을 개략적으로 소개하기 위하여, 이탈리아의 문물, 풍속, 언어와 문학, 지리와 역사, 사회와 정치, 예술 이탈리아어의 기초 등을 다룬다."
                            }
                        },
                        {
                            "과목 코드": "LCU4039",
                            "과목명": "러시아 사회와 문화",
                            "details": {
                            "lecture_hours": "강의 3시간",
                            "credits": "3학점",
                            "description": "본 강의는 동부 슬라브 첫 국가체제 형성부터 천년간의 주요한 역사사건을 살펴보고 1917년 사회주의 10월 혁명에서 1991년 8월 쿠데타까지의 74년 소비에트 시기의 정치과정을 통해 러시아가 보고 있는 미래를 검토해 보는 데 목적을 둔다."
                            }
                        },
                        {
                            "과목 코드": "LCU4060",
                            "과목명": "현대 프랑스사회의 갈등과 통합",
                            "details": {
                            "lecture_hours": "강의 3시간",
                            "credits": "3학점",
                            "description": "역사적으로 프랑스는 다른 서구 국가에 비해 더 급진적인 사회적인 갈등과 변혁을 겪었다. 프랑스 대혁명과 이후의 공화파와 왕당파의 갈등, 그리고 20세기의 68혁명 등, 현대 프랑스 사회는 다른 서구국가에서는 보기 힘든 격렬한 갈등과 통합의 과정을 통해 만들어졌고, 이 과정에서 논의된 담론들은 인류사회의 발전에도 크게 기여했다고 평가된다. 본 강의는 특히 21세기 프랑스를 만든 가장 큰 사전으로 평가받는 68혁명과 최근의 시사적인 사건으로 프랑스 내의 이슬람 통합문제를 다각적으로 분석하며 그 갈등의 원인과 진행과정, 결과, 그리고 이것이 한국사회에 던지는 시사점을 이해하려 한다."
                            }
                        },
                        {
                            "과목 코드": "LCU4064",
                            "과목명": "스페인어 연수",
                            "details": {
                            "lecture_hours": "3시간",
                            "credits": "3학점",
                            "description": ""
                            }
                        },
                        {
                            "과목 코드": "LCU4103",
                            "과목명": "기본영어",
                            "details": {
                            "lecture_hours": "강의 3시간",
                            "credits": "3학점",
                            "description": "영어 활용에 필요한 기본 문법 및 말하기, 듣기의 능력을 배양하여, 영어필수과목 이수와 외국인과의 기본적인 의사소통을 준비한다."
                            }
                        },
                        {
                            "과목 코드": "LCU4106",
                            "과목명": "현대 중동 이해",
                            "details": {
                            "lecture_hours": "강의 3시간",
                            "credits": "3학점",
                            "description": "중동이라는 말은 유럽인의 시각을 고스란히 반영한 모호한 말이지만 대중화하였기에 편의상 쓰기로 한다. 나일강에서 아무다르야 강에 이르는 이슬람문화권 중동지역의 현대 역사와 문화에 대해 공부한다. 7세기 예언자 무함마드의 강렬한 종교 체험 이후 오늘날까지 약 1400년간 이 지역은 이슬람 신앙에 기반을 둔 문화가 발전하였다. 이 강의는 성속이 분리된 서구사회와 달리 이슬람 신앙에 바탕을 둔 문화를 이루어온 이 지역을 다양한 시각에서 살피며 현대 중동 세계를 둘러 싼 다양한 현안에 대해 공부한다."
                            }
                        },
                        {
                            "과목 코드": "LCU4107",
                            "과목명": "튜터링을 통한 글쓰기 능력 신장",
                            "details": {
                            "lecture_hours": "강의 3시간, S/U 평가",
                            "credits": "2학점",
                            "description": "이 과목은 글을 쓰는 전 과정에 튜터링을 연계하여 학습자 글쓰기 역량을 강화하는 것을 목표로 한다. 이 과목은 모듈화된 튜터링 과정연계 작업을 통해 글쓰기에 관여하는 학습자의 상위인지 능력을 개발할 수 있도록 설계되었다. 서강 고유의 글쓰기센터 튜터링 시스템은 학습자 수준에 알맞은 수준별, 개별화 지도가 가능하여 학습자가 자신의 글쓰기 역량을 개선하는 데 특화되어 있다. 또한 학습자 글쓰기의 이력 관리 및 추적 및 가능하여 종적 변화과정을 확인할 수 있다."
                            }
                        },
                        {
                            "과목 코드": "LCU4109",
                            "과목명": "글쓰기를 위한 기초 인문학",
                            "강의 시간": "3시간",
                            "학점": "3학점",
                            "내용": "‘생각’과 ‘표현’ 능력을 향상시키는 첫걸음인 인문학의 기본적이고 중요한 개념들을 글쓰기 과정과 연관시키는 것이 본 교과목의 목적이다. 그중에서도 근대 이후 형성된, 여러 학제에서 사용하는 기본 개념들이 연결 대상이 된다. 이러한 과정을 통해 인문학적 교양 함양과 글쓰기 능력의 두가지 목적을 달성함은 물론 글쓰기 자체의 기본 길잡이를 제시한다. 본 교과목을 수강한 학생들은 사유하는 방법을 중심으로 한 글쓰기 경험과 정확한 인문학의 의미를 학술하게 될 것이다. 글쓰기 과제 부여와 관리에 있어서는 다양한 소재와 시각(관점) 훈련, 글의 아이디어, 문장의 구조, 사유와 표현의 관계 지도에 집중한다."
                        },
                        {
                            "과목 코드": "LCU4110",
                            "과목명": "문학예술과 창의적 글쓰기",
                            "강의 시간": "3시간",
                            "학점": "3학점",
                            "내용": "본 교과목은 개념적 창의성을 지향하는 논리적 글쓰기를 제안한다. 연관되는 분야는 문학, 정신분석, 인류학, 표현예술치료, 시각·영상예술의 맥락이며 개념적 연관 관계에 대한 탐구를 중시하는 가운데 성찰적 조망으로의 확장을 추구한다. 접촉·소통·경계, 신비와 신화, 증여와 순수증여(불안과 박탈감정), 목적론적 서사와 순환론적 서사, 독단론과 회의론, 관념론과 유물론, 이미지와 실재, 공동체 등의 주제들을 제안하여 글쓰기에 관한 창의적인 과정, 수준 높은 성과물을 얻고자 한다. 이 같은 효과를 극대화하기 위한 교수자의 지속적인 피드백과 대화적 경험을 통한 수강생의 글쓰기 능력향상이 전제된다."
                        },
                        {
                            "과목 코드": "LCU4113",
                            "과목명": "사회학적 참여관찰과 글쓰기",
                            "강의 시간": "3시간",
                            "학점": "3학점",
                            "내용": "글쓰기를 통해 개인의 삶이 사회라는 거대한 물줄기와 연결되어 있음을 확인하고 현대사회의 키워드를 주변에 적용하여, 이를 수강생 본인의 언어로 해석하는 힘을 기르는 것이 교과목의 목적이다. 특히 현대사회의 대표적인 문제적 키워드라고 할 수 있는 양극화가 빚어낸 일상의 어그러진 모습들을 관찰한 후, 그 현장의 생생함과 자신을 연결시키는 글쓰기를 통해 사회와 개인 간의 관계를 드러낸다. 이를 위해 사회학적 글쓰기에 토대를 둔 현장연구서를 집중적으로 다루고 수강생 본인과 그들이 소속된 사회를 향한 글쓰기의 출발점을 찾는 것에 주안점을 둔다. 강의 내용은 읽기, 관찰하기, 글쓰기의 순서로 진행된다. 총 4회에 걸쳐 수강생 본인과 본인이 관찰한 세계가 어떻게 연결되어 있었는지를 성찰하는 최종 글쓰기 과제가 부여된다."
                        },
                        {
                            "과목 코드": "LCU4118",
                            "과목명": "K-pop and Cultural Studies",
                            "강의 시간": "3시간",
                            "학점": "3학점",
                            "내용": "This course is designed to help students understand South Korea (Korea hereafter) through its K-pop and Korean popular music, and enjoy Korean culture better by knowing more about Korean history. The modern forms of Korean popular music, which fascinate people around the globe, did not spring into existence out of nowhere. Instead, they emerged and have constantly co-evolved within the political, the economic, and the technological spheres in historical contexts. This course explores how Korean pop music has come to take on its current forms, corresponding with the national and international contexts. In doing so, this course focuses on Korean modern history, popular culture, and cultural studies theories for deep understandings of Korean pop music."
                        },
                        {
                            "과목 코드": "LCU4119",
                            "과목명": "Korean Language for exchange & visiting students _beginners",
                            "강의 시간": "3시간",
                            "학점": "3학점",
                            "내용": "This course is designed to help international exchange students improve their Korean communicative competence by learning Korean language and culture. Specifically, the course covers the Korean alphabet (Hangul), essential vocabulary, basic grammar, listening, reading, and speaking at the beginner level. Materials will be used to help students understand the Korean cultural context that will enable them to better communicate with others in Korean."
                        },
                        {
                            "과목 코드": "LCU4120",
                            "과목명": "4차 산업혁명시대의 디지털 글쓰기",
                            "강의 시간": "3시간, S/U 평가",
                            "학점": "3학점",
                            "내용": "4차 산업혁명은 디지털화, 인공지능, 빅데이터, 사물인터넷 등의 기술 발전을 중심으로 한 변화를 가져오고 있다. 이러한 변화 속에서 글쓰기 교육은 단순히 문장 구성이나 문법에 집중하는 것을 넘어서, 디지털 환경에서의 새로운 글쓰기 전략과 방식, 다양한 도구와 기술을 활용하는 방법 등을 포함하는 교육이어야 한다. 이 과목은 전통적인 텍스트 중심의 글쓰기뿐만 아니라 멀티미디어, 콘텐츠, 디지털 스토리텔링, 블로그나 소셜미디어 활용 등 다양한 매체와 플랫폼에서의 글쓰기 능력을 함양하는 것을 목적으로 한다."
                        },
                        {
                            "과목 코드": "LED3010",
                            "과목명": "발표와 토론",
                            "강의 시간": "3시간",
                            "학점": "3학점",
                            "내용": "현대사회는 자신의 생각과 의견을 효과적으로 표현하고 전달하는 의사소통 능력을 요구한다. 본 교과를 통해 프레젠테이션 이론과 실제를 함께 경험함으로써 다양한 목적과 대상에 맞는 프레젠테이션 능력을 함양한다."
                        },
                        {
                            "과목 코드": "SHU4010",
                            "과목명": "동남아시아 전통사회의 이해",
                            "강의 시간": "3시간",
                            "학점": "3학점",
                            "내용": "동남아시아 지역의 역사, 지리, 문화에 걸쳐 기본적 사항들을 소개한다."
                        },
                        {
                            "과목 코드": "SHU4011",
                            "과목명": "아프리카 전통사회의 이해",
                            "강의 시간": "3시간",
                            "학점": "3학점",
                            "내용": "아프리카 지역의 역사, 지리, 문화에 걸쳐 기본적 사항들을 소개한다."
                        },
                        {
                            "과목 코드": "TLS1002",
                            "과목명": "비평적 글쓰기 연습",
                            "강의 시간": "3시간",
                            "학점": "3학점",
                            "내용": "다양한 분야의 텍스트를 읽고 텍스트를 분석하면서 그 사회 문화적 맥락을 파악하고 그 결과를 언어로 표현하는 연습을 하는 과목이다."
                        },
                        {
                            "과목 코드": "TLS1003",
                            "과목명": "스토리텔링 글쓰기 연습",
                            "강의시간": "3시간",
                            "학점": "3학점",
                            "내용": "스토리텔링은 자신의 생각과 느낌, 삶의 어떤 부분을 누군가에게 전달하여 보여주는 것이다. 그것은 사실 의사소통의 한 방식이며, 의사소통이란 항상 상대가 있기 마련이다. 사회생활이란 결국 스토리텔링을 하기 위한 준비이거나 스토리텔링 과정 그 자체라고도 말할 수 있다. 이 과목은 우리의 기억과 경험, 사고, 감정을 어떠한 전략과 대응으로 전달할 것인가를 학습하는 과목이다. 자기표현이 특별히 강조되는 시대에 자신의 정체성과 위치를 성찰하는 것은 무척 중요하다. 자아와 그 주변을 스스로 성찰하고 그 결과를 표현하는 과정을 통해, 학생들 스스로 상호소통의 즐거움을 체험하고 공감 능력을 향상시키면서, 창의력과 개성을 극대화하는 훈련을 하게 될 것이다."
                        },
                        {
                            "과목 코드": "TLS1005",
                            "과목명": "영어읽기와 토론 연습",
                            "강의시간": "3시간",
                            "학점": "3학점",
                            "내용": "영어 읽기와 토론 연습은 영어학습자가 그들에게 유익하고 의미 있는 주제를 다룬 글을 읽고 이에 관해 사고하고 의사표현 할 때 가장 효과적인 영어 습득이 이루어진다는 전제하에 개설한다. 빠른 글로벌화와 발달된 테크놀로지를 통해 쉽게 교류하는 시대에 살고 있는 학생들은 인터넷을 통해 공유되는 무한한 자료, 소식 및 다양한 의견들을 접하고 있는데 이 가운데 세계인들과 폭넓고 효과적으로 소통하기 위해서는 영어가 가장 중요한 도구이므로, 본 과목은 학생들로 하여금 세계인의 주요 관심사와 쟁점들에 관한 글을 읽고 비판적 사고를 하여 이를 말과 글로 표현하는 연습을 하게 함으로써 세계공용어로서의 영어능력 향상 뿐 아니라 열린 세계와의 폭넓은 소통에 보다 효과적으로 참여할 수 있는 능력을 기를 수 있는 기회를 제공하고자 한다."
                        },
                        {
                            "과목 코드": "TLS1006",
                            "과목명": "실용영어와 발표 연습",
                            "강의시간": "3시간",
                            "학점": "3학점",
                            "내용": "전문적인 영어 의사소통 실력에 대한 필요성은 매해 증가하고 있는 해외 교환 학생 및 인턴쉽 참가 신청자들에게서 찾아 볼 수 있다. 빠르게 변화하고 있는 세계화 시대에 부응하는 인재 양성을 위해 체계적인 실무 영어 습득은 학생과 기업 모두에게 필수 조건이 되었다. 따라서 이 과목은 모든 전공 학생들이 영어 학습을 통하여 진로에 대해 좀 더 구체적으로 논의 및 계획하고 체계적으로 준비할 수 있도록 하여 졸업 후 국내 취업이나 인턴경험, 교환학생 프로그램 참여, 국제구직시장에서의 취업 등에 실질적인 도움을 주는 것에 중점을 두어 설계되었다. 실무와 관련된 주제에 대해서 영어로 말하기, 듣기, 읽기, 쓰기를 익혀서 수강생들이 상황에 적합한 언어를 구사하고, 새로운 환경에 응용하여 활용할 수 있도록 학습함을 목표로 한다."
                        }
                    ],
                    "⑧ 고전과 문학": [
                        {
                            "과목 코드": "LAU4001",
                            "과목명": "현대사회와 문학예술",
                            "강의시간": "3시간",
                            "학점": "3학점",
                            "내용": "인류역사의 문맥 안에서 문학예술과 사회와의 상호영향관계에 초점을 맞추고 문학예술에 대한 올바른 이해를 도모하고자 한다."
                        },
                        {
                            "과목 코드": "LAU4005",
                            "과목명": "한국 명문 감상",
                            "강의시간": "3시간",
                            "학점": "3학점",
                            "내용": "글쓰기의 전범인 한국의 우수한 문장들을 감상함으로써 글쓰기 능력과 이와 관련된 제반 문화적 소양을 기른다. 글쓰기의 다원화, 종합화에 부응하고 삶에 밀착한 글쓰기 능력을 함양한다."
                        },
                        {
                            "과목 코드": "LAU4006",
                            "과목명": "문학과 판타지",
                            "강의시간": "3시간",
                            "학점": "3학점",
                            "내용": "문학 속의 환상을 중심으로 하여 환상성, 환상 등의 개념을 정리하고, 고전문학에서 현대문학까지의 문학 텍스트 속에서 그 발현 양상을 살피며, 환상성을 사회적·정신분석적·정치적으로 고찰한다."
                        },
                        {
                            "과목 코드": "LAU4008",
                            "과목명": "다매체시대의 고전 읽기",
                            "강의시간": "3시간",
                            "학점": "3학점",
                            "내용": "현대의 문화 상황에 대한 깊은 이해를 바탕으로 한 새로운 고전 읽기를 시도함으로써 고전을 다매체 시대의 매체 환경에 적합한 방식으로 수용하고 재창조하며, 이를 통해 인간적 가치를 창출하고 유포하는 방법과 방향을 탐색한다. 편의 옛 시가도 포함될 수 있다."
                        },
                        {
                            "과목 코드": "LAU4012",
                            "과목명": "그리스 로마 신화",
                            "강의시간": "3시간",
                            "학점": "3학점",
                            "내용": "신화의 소개를 통하여 그리스 로마인들의 종교, 문학 및 예술에 대한 연구에 도움을 주고, 나아가서 신화를 소재로 하고 있는 현대 서양의 문학, 음악 및 미술에 대한 이해를 용이하게 한다."
                        },
                        {
                            "과목 코드": "LAU4047",
                            "과목명": "법과 사회문화",
                            "강의시간": "3시간",
                            "학점": "3학점",
                            "내용": "‘법과 사회문화’는 사회현상 혹은 문화현상으로서의 법을 이해하려는 과목이다. 이 과목은 법전 속의 법(black-letter law)이 아니라, 사회적 맥락과 문화에 따라 상이한 모습으로 등장하고 기능하는 “살아 있는 법”(living law)의 다양한 양상들을 사례 중심으로 살펴봄으로써 법의 상대성과 보편성 그리고 법의 역할과 기능에 대한 구체적이고 깊은 통찰을 제공하고자 한다."
                        },
                        {
                            "과목 코드": "LCU4104",
                            "과목명": "한국의 명시 감상",
                            "강의시간": "3시간",
                            "학점": "3학점",
                            "내용": "이 과목은 한국의 명시를 감상하는 것을 목표로 한다. 한국시 중 최고의 시를 골라 명시의 아름다움과 깊이를 감상하며 아울러 시인의 삶과 그 시대의 정치, 사회, 문화에 대한 지식을 탐구한다. 주로 1920-2000년 사이의 현대시를 다루지만 몇 편의 옛 시가도 포함될 수 있다."
                        },
                        {
                            "과목 코드": "TLS1001",
                            "과목명": "독서와 토론",
                            "강의시간": "3시간",
                            "학점": "3학점",
                            "내용": "이 강의는 학생들에게 자율적으로 독서하는 습관을 길러 주는 동시에 분석적이고 비판적으로 책을 읽을 수 있는 독서 능력을 함양하는 데에 그 목적이 있다. 특히 토론을 통하여 자신의 의견을 분명히 개진하고 다른 사람과 자신의 생각을 공유할 수 있도록 한다는 데에 과목 개설의 의의가 있다. 결국 이 강의가 지향하는 최종 목표는 수강생의 독해 능력을 발달시키고 비판적인 사고력을 함양하는 것이다. 이를 위하여 동서양의 고전을 분석적이고 비판적으로 읽는 독서 활동과 자신의 관점과 논리를 설득력 있게 제시하는 토론 활동을 체계적으로 실습한다."
                        }
                    ],
                    "⑨ 예술과 체육": [
                        {
                            "과목 코드": "HLU4001",
                            "과목명": "영양과 다이어트",
                            "강의시간": "2시간",
                            "학점": "2학점",
                            "내용": "기계화, 자동화로 인해 운동 부족에 처한 현대인이 건강하고 보람 있는 삶을 영위하기 위해 필요한 올바른 영양 개념과 다이어트 방법을 고찰한다."
                        },
                        {
                            "과목 코드": "HLU4003",
                            "과목명": "운동과 건강",
                            "강의시간": "2시간",
                            "학점": "2학점",
                            "내용": "체력의 개념과 측정방법을 이해하고 운동과 인체기능과의 관계를 학습함으로써 건강한 삶을 위한 건강증진 프로그램을 스스로 작성·실천할 수 있도록 한다."
                        },
                        {
                            "과목 코드": "HLU4004",
                            "과목명": "수영",
                            "강의시간": "2시간",
                            "학점": "1학점",
                            "내용": "자유형과 배영의 영법을 익혀 수중에서의 위험한 사태에 대처할 수 있는 능력과 체력을 기른다."
                        },
                        {
                            "과목 코드": "HLU4005",
                            "과목명": "스키",
                            "강의시간": "2시간",
                            "학점": "1학점",
                            "내용": "스키 활강 이론과 기술을 익히며, 체력단련과 아울러 혹서에 견디는 능력을 기른다."
                        },
                        {
                            "과목 코드": "HLU4006",
                            "과목명": "요가",
                            "강의시간": "2시간",
                            "학점": "1학점",
                            "내용": "대체 의학의 한 분야로 정신, 육체, 일상 관계와 생활 속에서 자신의 존재를 인식하는 과정을 수행한다. 요가의 기본인 즈나나, 탄트라, 만트라 동작과 아슈탕가 요가를 현대화한 파워 요가를 익힘으로써 신체의 자세 교정과 요통 치료 방법을 익힌다."
                        },
                        {
                            "과목 코드": "HLU4007",
                            "과목명": "테니스",
                            "강의시간": "2시간",
                            "학점": "1학점",
                            "내용": "테니스 경기의 기본기술인 포핸드, 백핸드, 발리, 서브 등을 익히며 단식과 복식경기를 통하여 게임의 전략과 전술을 배운다."
                        },
                        {
                            "과목 코드": "HLU4008",
                            "과목명": "탁구",
                            "강의시간": "2시간",
                            "학점": "1학점",
                            "내용": "탁구경기의 스크록, 쇼트, 커트, 드라이브, 스매싱, 서브, 리시브 등의 기술을 숙달하고 단식, 복식의 게임기술을 익히며 경기규칙과 운영방법을 배운다."
                        },
                        {
                            "과목 코드": "HLU4009",
                            "과목명": "배드민턴",
                            "강의시간": "2시간",
                            "학점": "1학점",
                            "내용": "배드민턴의 기본기술인 클리어, 드롭샷과 커트의 타법을 익히며 상위기술인 헤어핀, 드라이브, 스매쉬, 푸시 및 서비스 리턴의 종류와 방법을 숙달한다."
                        },
                        {
                            "과목 코드": "HLU4011",
                            "과목명": "농구",
                            "강의시간": "2시간",
                            "학점": "1학점",
                            "내용": "농구의 기본기술인 드리블, 턴, 패스, 피벗, 레이업 슛, 점프슛 등을 중점적으로 습득하며 농구의 전술과 경기를 통한 페어플레이 정신을 함양하여 학생간의 협동심과 단결, 봉사와 희생정신을 배운다."
                        },
                        {
                            "과목 코드": "HLU4013",
                            "과목명": "축구",
                            "강의시간": "2시간",
                            "학점": "1학점",
                            "내용": "축구는 필드에서 팀을 이루어 게임을 진행하는 단체운동경기로 포지션에 따른 볼 키핑, 드리블, 슈팅, 헤딩 등의 기본기술을 배운다."
                        },
                        {
                            "과목 코드": "HLU4014",
                            "과목명": "야구",
                            "강의시간": "2시간",
                            "학점": "1학점",
                            "내용": "야구는 달리기, 뛰기, 던지기 등의 기본적인 운동능력 및 잡기, 때리기 능력을 향상시키며 게임 상황에 따른 협동성, 판단력, 결단력 등을 함양시킨다."
                        },
                        {
                            "과목 코드": "HLU4015",
                            "과목명": "골프",
                            "강의시간": "2시간",
                            "학점": "1학점",
                            "내용": "골프는 다양하게 설계된 18개 코스에서 14개의 골프채를 사용하는 경기로서 골프의 기술향상을 위하여 아이언 플레이, 피칭, 치핑, 퍼팅, 티샷의 기술을 습득한다."
                        },
                        {
                            "과목 코드": "HLU4016",
                            "과목명": "춤과 풍물",
                            "강의시간": "2시간",
                            "학점": "1학점",
                            "내용": "춤은 문화이고 한편의 역사이기에 문화와 춤이 고스란히 녹아 있어 춤의 형태와 움직임은 그 내용과 함께 주어진 문화 속에서 가치를 가지고 문화의 유형을 만들어 간다. 무용예술과 풍물은 창조적 사고와 감정과 직관, 이미지와 몸의 느낌을 발전시켜 다양한 방법의 생각의 도구를 발전시킬 수 있다."
                        },
                        {
                            "과목 코드": "HSS4001",
                            "과목명": "음악쓰기: 이론에서 창작까지(탐구공동체)",
                            "강의시간": "1.5시간",
                            "학점": "1.5학점",
                            "내용": "본 강좌는 대학 교양수업에서 다양한 글쓰기 수업들이 글을 통해 사고를 표현하고 확장하는 것을 목표로 하는 것처럼, 음악을 ‘쓰기’라는 개념으로 확장하여 학생들이 자신의 상상력과 창의력을 음악적으로 표현하고 발전시킬 수 있도록 돕는 것을 목적으로 한다. ‘음악쓰기’는 음악이론의 기초를 학습하는 것에서 출발해, 가사와 멜로디 창작을 통해 자신의 생각과 감정을 음악으로 표현하는 전 과정을 다룬다."
                        },
                        {
                            "과목 코드": "HSS4003",
                            "과목명": "재즈와 현대 사회(탐구공동체)",
                            "강의시간": "1.5시간",
                            "학점": "1.5학점",
                            "내용": "1920년대 미국 사회는 청년층의 확대와 재즈의 부상으로 인해 대중문화의 붐을 이루게 된다. 이를 기점으로 대중문화는 유럽의 고급문화를 넘어 현대 문화의 주도권을 잡는다. 본 강의는 20세기 대중문화 형성의 분기점에 서 있는 재즈의 음악적 의미와 재즈가 담아낸 사회 관념의 변화를 이해함으로써 현대 사회 속 음악의 의미를 통합적으로 고찰한다."
                        },
                        {
                            "과목 코드": "HSS4006",
                            "과목명": "3D디자인을 통한 사고와표현(탐구공동체)",
                            "강의시간": "1.5시간",
                            "학점": "1.5학점",
                            "내용": "디지털 기초가 되는 사고와 표현으로 포토샵, 일러스트, 3D 클로, 라이노 등을 탐구한다. 주차별 표현을 바탕으로 창의적 디자인을 응용하여 공동 발표 및 사이버 전시를 수행한다."
                        },
                        {
                            "과목 코드": "LAU4014",
                            "과목명": "한국 미술의 역사와 감상",
                            "강의시간": "3시간",
                            "학점": "3학점",
                            "내용": "한국 미술의 발달사와 특징을 이해하고 고전 미술에서 현대 미술까지의 주요 작품을 해설하고 감상한다."
                        },
                        {
                            "과목 코드": "LAU4015",
                            "과목명": "서양 미술의 역사와 감상",
                            "강의시간": "3시간",
                            "학점": "3학점",
                            "내용": "본 교과목은 회화, 건축, 조각을 비롯한 서양 미술작품의 흐름을 살피고 심미적으로 감상한다. 더불어 미술가의 삶과 시대의 정신이 어떻게 미술작품에 투영되는지 역사적 배경, 사회적 조건, 문화적 특징과 연관하여 고찰함으로써 미술의 원리들을 이해한다. 그리고 모더니즘과 동시대 미술 사이에서 간과되는 일련의 미술사적 문제들을 관찰한다. 전통적 권위에 대한 저항, 새로운 현실 자각, 물질문명의 거부와 적응에 있어서 현대에 이르기까지 미술의 역사가 어떻게 전개되고 발전해가는지 고찰한다. 그리하여 사회적 환경이 급변하는 오늘날 세계는 어떤 예술적 상상력과 문화적 대안을 논의하고 있는지 배운다. 나아가 일상에서 접하는 미술작품의 가치를 알아보고 평가할 수 있는 예술적 안목을 기른다."
                        },
                        {
                            "과목 코드": "LAU4017",
                            "과목명": "현대패션의 이해",
                            "details": {
                            "credit_hours": "3학점",
                            "description": "20세기를 상징했던 다양한 패션아이콘을 통해 정치, 경제, 문화, 예술 등 시대별 사회문화적 현상을 고찰, 분석하고 이를 토대로 21세기 사회에 나타나는 패션 현상을 분석할 수 있는 능력을 함양한다."
                            }
                        },
                        {
                            "과목 코드": "LAU4018",
                            "과목명": "한국 건축사",
                            "details": {
                            "credit_hours": "3학점",
                            "description": "한국 건축의 특성을 이해하고, 전통가옥의 미적 특성을 고찰한다."
                            }
                        },
                        {
                            "과목 코드": "LAU4020",
                            "과목명": "한국 음악의 역사와 감상",
                            "details": {
                            "credit_hours": "3학점",
                            "description": "민요, 농요, 노동요, 아악 등 한국 음악 발달사와 특징을 이해하고 고전 음악에서 현대음악까지의 주요 작품을 해설하고 감상한다."
                            }
                        },
                        {
                            "과목 코드": "LAU4021",
                            "과목명": "서양 음악의 역사와 감상",
                            "details": {
                            "credit_hours": "3학점",
                            "description": "서양 음악 발달사와 특징을 이해하고 고전음악에서 현대 음악까지의 주요 작곡가들의 작품을 개관하여 해설하고 감상한다."
                            }
                        },
                        {
                            "과목 코드": "LAU4022",
                            "과목명": "대중음악의 이해",
                            "details": {
                            "credit_hours": "3학점",
                            "description": "대중음악 장르를 정의하는 음악적 요소를 이해하고, 미학적, 역사적, 사회적, 문화적, 정치적 관점에서 대중음악을 분석하는 능력을 개발함으로써, 대중음악의 변천사와 그 의미에 대한 비판적 사고를 기르는 것을 주요목표로 한다."
                            }
                        },
                        {
                            "과목 코드": "LAU4024",
                            "과목명": "현대 예술과 미학의 이해",
                            "details": {
                            "credit_hours": "3학점",
                            "description": "시와 소설, 드라마와 영화 등의 각종 문학예술에는 인간의 심리가 다양하고도 구체적으로 투영돼 있다. 문학을 비롯한 예술의 기능과 가치를 심리적 차원에서 생각해 본다. 문학예술 작품에 등장하는 개성적이고 전형적이며 매력적인 각종 인물형을 심리학적 관점에서 다양하고 깊이 있게 살피는 작업을 통해 인간존재에 대한 이해를 확장하고 심화한다. 그리고 문학을 읽고 들으며 여기에 다양한 예술적 표현으로 반응해 본다. 이러한 과정을 통해 문학에 숨겨진 심리적 의미를 찾아내고 나의 반응을 점검하며 최종적으로 나 자신에 대한 이해에 도달하는 것을 목표로 한다."
                            }
                        },
                        {
                            "과목 코드": "LAU4029",
                            "과목명": "세계음악과 문화의 이해",
                            "details": {
                            "credit_hours": "3학점",
                            "description": "‘월드뮤직’(World Music) 개념을 중심으로 유럽, 아시아, 아프리카, 중동, 러시아, 남미문화권 등에서 고유하게 형성된 음악적 통속문화(Vernacular Culture)로서의 포크음악의 재현양식들의 맥락들에 대한 이해를 목표로 한다."
                            }
                        },
                        {
                            "과목 코드": "LAU4032",
                            "과목명": "뮤지컬의 이해",
                            "details": {
                            "credit_hours": "3학점",
                            "description": "뮤지컬의 이해는 뮤지컬에 대한 폭넓은 이해를 학생들에게 제공하여, 예술의 다양한 측면을 경험하고 비평할 수 있도록 한다. 강의 전반부에서는 뮤지컬의 정의와 역사적 형성 과정을 다루며, 강의 후반부에서는 다양한 작품 분석을 통해 뮤지컬의 핵심 구성 요소와 제작 과정, 예술적 표현의 다양성을 이해하는데 중점을 둔다. 학생들은 주요 뮤지컬 작품을 분석하고 비평하는 과정에서 뮤지컬이 예술 전통과 어떻게 상호작용하고 있는지 이해할 수 있다. 또한, 현대 뮤지컬의 동향과 미래 전망에 대한 토론을 통해 예술과 대중문화의 교차점을 탐구한다. 이 강의에서 학생들은 뮤지컬에 대한 심층적이고 폭넓은 지식을 습득하고, 예술의 다양성을 존중하며 즐길 수 있는 역량을 함양할 수 있다."
                            }
                        },
                        {
                            "과목 코드": "LAU4034",
                            "과목명": "대학합창",
                            "details": {
                            "credit_hours": "2학점",
                            "description": "이 수업에서는 르네상스 시대부터 현대에 이르기 까지 다양한 시대의 합창음악을 배우고 노래하게 된다. 이를 통해 학생들은 시대별로 다양한 합창음악을 접하게 되며 그것을 부르는 발성법과 연주법을 지도 받게 된다. 또한 모든 학생들과 교수 및 교직원들을 위한 학내연주회를 개최하여 직접 연주할 수 있는 기회를 갖는다."
                            }
                        },
                        {
                            "과목 코드": "LAU4035",
                            "과목명": "사진의 이해",
                            "details": {
                            "credit_hours": "2학점",
                            "description": "사진의 기초에 대해 이해하고, 기본적인 조작법을 익히며 다양한 분야로의 활용 방법을 모색한다."
                            }
                        },
                        {
                            "과목 코드": "LAU4036",
                            "과목명": "드로잉-선을 통한 사고와 표현",
                            "details": {
                            "credit_hours": "2학점",
                            "description": "드로잉은 미술 실기의 기초과정에 해당한다. 드로잉 실기를 통해 사물을 올바로 보는 관찰력 기른다. 선을 이용하여 대상을 묘사하며, 색을 주로 사용하는 회화와 구분된다."
                            }
                        },
                        {
                            "과목 코드": "LAU4037",
                            "과목명": "동양화 그리기",
                            "details": {
                            "credit_hours": "2학점",
                            "description": "한국 회화 전반의 폭 넓은 이해를 위해 전통적인 동양화의 재료와 기법, 창작의 정신 및 현대적 표현 기법도 함께 살펴본다. 임(臨), 모(摸), 방(倣)을 통해 전통의 자기화를 이룩한 옛 화가들의 세계를 학생 스스로가 본인의 작품을 제작하며 보다 깊이 있게 파악하게 한다."
                            }
                        },
                        {
                            "과목 코드": "LAU4041",
                            "과목명": "단소실습",
                            "details": {
                            "credit_hours": "1학점",
                            "description": "한국전통 관악기 중 하나인 단소에 대한 음악적 이론 습득 및 실습한다."
                            }
                        },
                        {
                            "과목 코드": "LAU4049",
                            "과목명": "디지털 문화와 예술",
                            "details": {
                            "credit_hours": "3학점",
                            "description": "디지털 예술, 디지털 에콜로지 등 과학기술의 발달과 변화에 따른 예술 영역의 변화를 이해하고 이에 따른 인간의 기술과 문화와의 상호관계를 탐구한다. 이를 통하여 예술을 통한 창의성과 시대문화가 어떻게 반영되는지 이해한다."
                            }
                        },
                        {
                            "과목 코드": "LAU4050",
                            "과목명": "디자인의 이해",
                            "details": {
                            "credit_hours": "3학점",
                            "description": "상상하는 아이디어나 주어진 목적을 조형적으로 실체화하는 디자인의 개념을 이해하고 시대적으로 어떻게 구현되었는지 고찰한다."
                            }
                        },
                        {
                            "과목 코드": "LAU4051",
                            "과목명": "창의적 연극 만들기",
                            "details": {
                            "credit_hours": "3학점",
                            "description": "공연 제작을 통해 연극의 체험적 지식을 습득하게 한다. 아울러 본 과목은 다음과 같은 중요한 목표를 갖고 진행된다. 그것은 학생들로 하여금 1) 능동적 실천력, 2) 창의력, 3) 집단협동심, 4) 의사소통 방식을 함양시킬 수 있도록 한다."
                            }
                        },
                        {
                            "과목 코드": "LAU4052",
                            "과목명": "아시아의 미술과 문명",
                            "details": {
                            "credit_hours": "3학점",
                            "description": "선사시대부터 20세기까지 아시아의 주요 미술품을 통해 아시아 문명의 독특한 성격과 변화 양상을 파악한다. 인류 문명의 발상지인 인도, 중국의 미술부터 동남아시아, 일본의 미술을 구체적으로 살펴봄으로써 아시아 문명의 흐름을 이해한다."
                            }
                        },
                        {
                            "과목 코드": "LAU4053",
                            "과목명": "축제적 연극의 창작",
                            "details": {
                            "credit": 3,
                            "description": "공연 제작을 통해 연극의 체험적 지식을 습득하게 한다. 아울러 본 과목은 다음과 같은 중요한 목표를 갖고 진행된다. 그것은 학생들로 하여금 1) 능동적 실천력, 2) 창의력, 3) 집단협동심, 4) 의사소통방식을 함양시킬 수 있도록 한다."
                            }
                        },
                        {
                            "과목 코드": "LAU4055",
                            "과목명": "K-Art, Its Cultural Value and Contents",
                            "details": {
                            "credit": 2,
                            "description": "최근 K-Pop, K-Classics을 포함한 한국문화 콘텐츠에 대한 관심이 전세계적으로 높아지고 있다. 그렇다면 K-Art의 가치와 정체성은 무엇일까? 전세계 미술계에서 높은 인지도와 평가를 받는 작품들로부터 시작하여 그 작품이 제작된 경위와 배경, 뿌리와 역사에 대해 되짚어보며 한국미술에 대한 전반적인 이해를 돕는다. 시대, 장르, 소재, 재료 등 K-Art 감상의 이론적 기초와 방법들을 알아본다."
                            }
                        },
                        {
                            "과목 코드": "LAU4056",
                            "과목명": "K-Art, from Tradition to Contemporary",
                            "details": {
                            "credit": 3,
                            "description": "This course provides an opportunity to explore the value and identity of Korean art amid the growing domestic and international interest in K-Art. It examines the overall trends and con-texts of Korean art history across different eras, offering a comprehensive understanding of its evolution. The course introduces outstanding artists and works across various genres, including painting, sculpture, architecture, installation art, and media art. Additionally, students will gain insights into the planning and intentions behind exhibitions held in museums and galleries. The course also covers practical tips and methods for effectively appreciating exhibitions, enhancing the overall viewing experience. Through these el-ements, participants will deepen their under-standing of Korean art's unique characteristics and its place within the global art scene."
                            }
                        }
                    ],
                    "⑩ 한국어와 한국사회": [
                        {
                            "과목 코드": "KLC1009",
                            "과목명": "국제 학생을 위한 진로와 취업",
                            "details": {
                            "credit": 3,
                            "description": "국제학생이 대학생활을 성공적으로 적응하고 전공별 가능한 진로 설계를 자발적으로 할 수 있도록 돕는 수업이다. 국제학생 취업 사례 소개, 선배와의 만남, 명사 특강으로 구성한다."
                            }
                        },
                        {
                            "과목 코드": "KLC1010",
                            "과목명": "비즈니스 한국어",
                            "details": {
                            "credit": 3,
                            "description": "취업을 목적으로 하는 국제 학생들을 대상으로 중상급 수준의 한국어 의사소통 능력 향상과 함께 비즈니스 업무와 한국 기업 근무 현장에 적응을 돕는 문화를 집중적으로 학습한다."
                            }
                        },
                        {
                            "과목 코드": "KLC1014",
                            "과목명": "미디어와 한국어기초",
                            "details": {
                            "credit": 3,
                            "description": "이 과목에서는 주로 말하기와 듣기 능력을 향상시킬 수 있는 동영상 매체 자료를 중심으로 하여 한국어 의사소통 능력을 향상시킨다. 특히 미디어 담화의 통역을 통해 구어 의사소통 기술을 통합적으로 익힌다."
                            }
                        },
                        {
                            "과목 코드": "KLC1015",
                            "과목명": "미디어와 한국어연습",
                            "details": {
                            "credit": 3,
                            "description": "이 과목에서는 주로 쓰기와 읽기 능력을 향상시킬 수 있는 매체 자료를 중심으로 하여 한국어 의사소통 능력을 향상시킨다. 특히 미디어 텍스트의 번역을 통해 문어 의사소통 기술을 통합적으로 익힌다."
                            }
                        },
                        {
                            "과목 코드": "KLC1016",
                            "과목명": "한국어 독서와 토론",
                            "details": {
                            "credit": 3,
                            "description": "한국 정치, 사회, 문화와 관련된 중·고급 수준의 한국어 말하기 능력을 배양하는 것을 목적으로 한다. 한국 정치, 사회, 문화와 관련된 다양한 주제에 대해 타인과 의견을 교류할 수 있다. 조별 토론에 참여하여 자신의 의견에 대해 근거를 제시하고 반박할 수 있다."
                            }
                        },
                        {
                            "과목 코드": "KLC1017",
                            "과목명": "한국어 발음 특강",
                            "details": {
                            "credit": 3,
                            "description": "국제 학생의 한국어 화법 능력 향상을 위해, 한국어 발음과 관련된 다양한 모형과 학습자 전략들을 살펴본다. 한국어 듣기·말하기·발음 향상에 도움이 되는 자료를 중심으로 실습한다."
                            }
                        },
                        {
                            "과목 코드": "KLC1018",
                            "과목명": "한국어 프레젠테이션 연습",
                            "details": {
                            "credit": 3,
                            "description": "고급 수준의 학문 목적 말하기 능력을 배양하는 것을 목적으로 한다. 교양 및 전공과 관련된 주제에 대해 구체적으로 자신의 의사를 개진할 수 있도록 하여, 대학 강의나 조별 토론에 적극적으로 참여할 수 있도록 한다."
                            }
                        },
                        {
                            "과목 코드": "KLC1019",
                            "과목명": "한국어작문연습",
                            "details": {
                            "credit": 3,
                            "description": "중급 이상의 한국어 능력을 지닌 국제 학생을 대상으로 학술적 글쓰기를 연습하는 수업이다. 대학에서 수행하는 다양한 학술적 글쓰기 과제 작성 방법에 대해 심화 학습하고 연습함으로써 전공 및 교양 수업 수강에 필요한 고급 글쓰기 능력을 갖출 수 있도록 한다."
                            }
                        },
                        {
                            "과목 코드": "LCU4116",
                            "과목명": "한국어 읽기",
                            "details": {
                            "credit": 3,
                            "description": "이 과목은 학부에 입학한 국제 학생들이 수업 수강 및 과제 수행에 필요한 한국어 문어 의사소통 능력을 갖출 수 있도록 하는 것을 목표로 한다. 이 수업에서 학생들은 한국어 텍스트 읽기 능력뿐 아니라 정확한 문장 쓰기 능력도 함양할 수 있으며 특히 글쓰기에 필요한 사고력과 지식도 습득할 수 있을 것이다."
                            }
                        },
                        {
                            "과목 코드": "LCU4117",
                            "과목명": "한국어 말하기",
                            "details": {
                            "credit": 3,
                            "description": "이 과목은 학부에 입학한 국제 학생들이 수업 수강 및 과제 수행에 필요한 한국어 문어 의사소통 능력을 갖출 수 있도록 하는 것을 목표로 한다. 이 수업에서 학생들은 한국어 텍스트 읽기 능력뿐 아니라 정확한 문장 쓰기 능력도 함양할 수 있으며 특히 글쓰기에 필요한 사고력과 지식도 습득할 수 있을 것이다."
                            }
                        },
                        {
                            "과목 코드": "ZKAP001",
                            "과목명": "학문을 위한 한국어 I [국제학생전용과목]",
                            "details": {
                            "credit": 6,
                            "description": "한국어를 기반으로 한 학문적 학습 능력을 키우기 위함을 큰 목적으로 하여, 학문 습득을 위해 필요한 문법과 단어에 대하여 집중적으로 교육하여 국제 학생들이 자연스럽게 학문을 위한 한국어를 습독할 수 있도록 한다. 다양한 학문적 주제에 접근하여 전공 과정 학습을 위한 기초를 학습하고 TOPIK(공인 한국어 능력 시험) 3급 대상 수준의 교육과정을 제공한한다."
                            }
                        },
                        {
                            "과목 코드": "ZKAP002",
                            "과목명": "학문을 위한 한국어 Ⅱ [국제학생전용과목]",
                            "lecture_hours": "강의 20시간",
                            "credits": "6학점",
                            "description": "한국어를 기반으로 한 학문적 학습 능력을 키우기 위함을 큰 목적으로 하여, 학문 습득을 위해 필요한 쓰기(리포트 작성), 강의 듣기 등 의사소통 방법 및 기술에 대하여 집중적으로 교육하여 국제학생들이 자연스럽게 학문을 위한 한국어를 습독할 수 있도록 한다. 다양한 학문적 주제에 접근하여 전공 과정 학습을 위한 기초를 학습하고 TOPIK(공인한국어시험) 3급 대상 수준의 교육과정을 제공한다."
                        },
                        {
                            "과목 코드": "ZKAP003",
                            "과목명": "학문을 위한 한국어 Ⅲ [국제학생전용과목]",
                            "lecture_hours": "강의 20시간",
                            "credits": "6학점",
                            "description": "한국어를 기반으로 한 학문적 학습 능력을 키우기 위함을 큰 목적으로 하여, 학문 습득을 위해 필요한 문법과 단어에 대하여 집중적으로 교육하여 국제학생들이 자연스럽게 학문을 위한 한국어를 습독할 수 있도록 한다. 다양한 학문적 주제에 접근하여 전공 과정 학습을 위한 기초를 학습하고 TOPIK(공인한국어시험) 4급 대상 수준의 교육과정을 제공한다."
                        },
                        {
                            "과목 코드": "ZKAP004",
                            "과목명": "학문을 위한 한국어 IV [국제학생전용과목]",
                            "lecture_hours": "강의 20시간",
                            "credits": "6학점",
                            "description": "한국어를 기반으로 한 학문적 학습 능력을 키우기 위함을 큰 목적으로 하여, 학문 습득을 위해 필요한 쓰기(리포트 작성), 강의 듣기 등 의사소통 방법 및 기술에 대하여 집중적으로 교육하여 국제학생들이 자연스럽게 학문을 위한 한국어를 습독할 수 있도록 한다. 다양한 학문적 주제에 접근하여 전공 과정 학습을 위한 기초를 학습하고 TOPIK(공인한국어시험) 4급 대상 수준의 교육과정을 제공한다."
                        },
                        {
                            "과목 코드": "ZKAP005",
                            "과목명": "학문을 위한 한국어 V [국제학생전용과목]",
                            "lecture_hours": "강의 20시간",
                            "credits": "6학점",
                            "description": "한국어를 기반으로 한 학문적 학습 능력을 키우기 위함을 큰 목적으로 하여, 학문 습득을 위해 필요한 문법과 단어에 대하여 집중적으로 교육하여 국제학생들이 자연스럽게 학문을 위한 한국어를 습독할 수 있도록 한다. 다양한 학문적 주제에 접근하여 전공 과정 학습을 위한 기초를 학습하고 TOPIK(공인한국어시험) 5급 대상 수준의 교육과정을 제공한다."
                        },
                        {
                            "과목 코드": "ZKAP006",
                            "과목명": "학문을 위한 한국어 VI [국제학생전용과목]",
                            "lecture_hours": "강의 20시간",
                            "credits": "6학점",
                            "description": "한국어를 기반으로 한 학문적 학습 능력을 키우기 위함을 큰 목적으로 하여, 학문 습득을 위해 필요한 쓰기(리포트 작성), 강의 듣기 등 의사소통 방법 및 기술에 대하여 집중적으로 교육하여 국제학생들이 자연스럽게 학문을 위한 한국어를 습독할 수 있도록 한다. 다양한 학문적 주제에 접근하여 전공 과정 학습을 위한 기초를 학습하고 TOPIK(공인한국어시험) 5급 대상 수준의 교육과정을 제공한다."
                        }
                    ]
                }
            }
        }
    }
    }
}