{
    "2025 서강대학교 요람": {
        "로욜라국제대학": {
            "Global Korean Studies": {
                "과목 정보": {
                    "Pre-Major Courses": [
                        {
                            "과목 코드": "GKS1001",
                            "과목명": "Critical Thinking for Social Inquiry",
                            "Lecture": "3hr.",
                            "Credits": "3cr.",
                            "Description": "This course is designed to introduce students studying social sciences for the first time to critical thinking, the logic and process of social science inquiry, and the method of empirical research. Students will learn about knowledge production that underpins our approach to any social science inquiry as well as how to ask and answer empirical research questions. The course will begin with introducing critical reading and thinking, the foundational elements of social science inquiry. The course then explores the processes of social science inquiry, including the construction of research questions, literature review, causal reasoning, the selection of methodology and methods, the techniques and tools of data gathering and analysis, and writing up your research conclusion. The course also introduces qualitative and quantitative studies. The course sequence will guide you to develop your research proposal step by step through the semester and present it at the end of the semester. This course will be devoted to helping you acquire pivotal reading, thinking, and research skills necessary to successfully complete tertiary education. Remember that the practical knowledge and skills you earned in the course are transferable and will guide you in other university courses and beyond."
                        },
                        {
                            "과목 코드": "GKS1002",
                            "과목명": "Global Citizenship",
                            "Lecture": "3hr.",
                            "Credits": "3cr.",
                            "Description": "The increasing interdependence between different communities around the world and the emergence of global issues, such as climate change and global pandemics, show that the territorial and spatial nature of citizenship is changing and needs to change in order to address issues that affect all members of the international community. Global citizenship refers to the belief that individuals no longer belong to isolated communities such as nation-states. Rather, they are members of multiple and diverse communities, the nature of which is changing as they interact with each other. This course provides an overview of the evolving concept of global citizenship and explores the virtue of the concept by relating it to various debates about international development cooperation, poverty alleviation and the growing importance and awareness of sustainable development for all. In doing so, the course aims to foster responsible global citizens."
                        }
                    ],
                    "GKS Required Courses": [
                        {
                            "과목 코드": "GKS2001",
                            "과목명": "Introductory Seminar in Korean Studies",
                            "Lecture": "3hr.",
                            "Credits": "3cr.",
                            "Description": "This course aims to help students navigate through Korean Studies as an academic field. In this course, students will engage with ideas, traditions, and debates that affect and build Global Korean Studies. Students will be exposed to the ways in which Korean Studies have emerged in different contexts and localities with different emphasises and perspectives. In addition, students will review important historical moments, cultural forces, and socio-economic developments on the Korean peninsula, as well as methods, sources, and authors in the field of Korean studies. In doing so, students will learn some basic skills required to explore Korean Studies materials and produce knowledge of Korea."
                        }
                    ],
                    "GKS Electives": [
                        {
                            "과목 코드": "GKS2002",
                            "과목명": "Korean Studies and Data Science",
                            "Lecture": "3hr.",
                            "Credits": "3cr.",
                            "Description": "In this course, students will learn the fundamentals of data science as they pertain to the study of Korea. The course will survey how data about Korea has been created historically, as well as how it is currently curated and how it might be made in the future. Similarly, the course will survey how data has been assessed historically and in the present, as well as how it might be assessed and used to understand Korea in the future. Students will also be taught basic programming and mathematical skills that will enable them to create, assess, and learn from data about Korea."
                        },
                        {
                            "과목 코드": "GKS2003",
                            "과목명": "Understanding Korean History in the Context of Time/Space",
                            "Lecture": "3hr.",
                            "Credits": "3cr.",
                            "Description": "This course will introduce students to Korean history in temporal and spatial context to enable the integrated study of Korea. In the course, students will investigate key events, junctures, and structures in Korean history from temporal and spatial perspectives."
                        },
                        {
                            "과목 코드": "GKS2004",
                            "과목명": "Capstone 1: Korean Studies in Practice",
                            "Former Code": "KOS3041",
                            "Lecture": "3hr.",
                            "Credits": "3cr.",
                            "Description": "This course offers students chances to test what they have learned in the classroom by engaging with people and ideas in a variety of academic, business, and social contexts related to Korean studies. Students will have to opportunity to learn the practice of Korean studies."
                        },
                        {
                            "과목 코드": "GKS3001",
                            "과목명": "Global Diffusion of the K-wave",
                            "Former Code": "KOS2203",
                            "Lecture": "3hr.",
                            "Credits": "3cr.",
                            "Description": "Diffusion differs from transplantation in that the meanings of new cultural products are not copied but localized, and this course provides knowledge and concepts for evaluating the global spread of K-wave as a case of cultural diffusion. Students will be able to understand how the spread of K-culture has benefited from new media and gain the knowledge to apply this lens on more K-wave phenomena in the future."
                        },
                        {
                            "과목 코드": "GKS3002",
                            "과목명": "Toward Creation: Introduction to Korea through Literature and Film",
                            "Former Code": "KOS2201",
                            "Lecture": "3hr.",
                            "Credits": "3cr.",
                            "Description": "Toward Creation: An Introduction to Korea through Literature and Film provides a broad overview of Korean culture as it is presented in Korean literature and film. The course rehearses what we know about important historical and cultural events while raising questions about the creative processes that inform how we know and understand Korea. The course begins with readings and films from contemporary North and South Korea and then moves backward through time to explore some of Korea's earliest extant legends and creation myths. Important authors and genres from both the modern and pre-modern period will be examined; each unit centers on a small number of literary works. Films are shown to provide alternate perspectives on Korean culture and the creative processes that shape our understanding of Korea. All readings will be in English. No previous knowledge of Korea or the Korean language is required. This class is designed as an introduction for students who are new to Korea and do not have a background in Korean studies. The course will not be opened to Global Korean Studies majors and is not recommended for students who have taken (or plan to take) “Introduction to Korean Literature” at Sogang."
                        },
                        {
                            "과목 코드": "GKS3004",
                            "과목명": "Formation of Modern Korea",
                            "Former Code": "KOS3043",
                            "Lecture": "3hr.",
                            "Credits": "3cr.",
                            "Description": "This course is a historical survey of Korean politics that begins with the opening of Korea's ports (1876) when Chosn intellectuals were exposed to Western civilization and began to develop Korean modernity. By the end of the course, students will understand how traditional Korea was transformed by the experience and modern Korea subsequently took shape, changing everything from the routines of everyday life to political systems."
                        },
                        {
                            "과목 코드": "GKS3005",
                            "과목명": "Globalisation and Korean Development",
                            "Former Code": "KOS2202",
                            "Lecture": "3hr.",
                            "Credits": "3cr.",
                            "Description": "This course offers an introduction to the arguably most significant feature and problem of our era: globalisation. It reviews economic, sociological and political theories of globalisation and assesses actually existing globalisation processes that produce certain types of development with peculiar social, cultural, political and ecological consequences. In doing so, it examines how these processes influence Korea and vice versa."
                        },
                        {
                            "과목 코드": "GKS3006",
                            "과목명": "Tigers and Dragons: East Asian Development Revisited",
                            "Former Code": "KOS3006",
                            "Lecture": "3hr.",
                            "Credits": "3cr.",
                            "Description": "This advanced course aims to provide a critical review of theories and practices of East Asian development. It will demonstrate Korean development as internal to the regional dynamics of development in East Asia. Our major question is this: Does East Asian development offer any alternative to the contemporary forms of globalisation and economic development? We will try to answer this question by engaging with various theories of East Asian development and putting them in the context of the particular historical moments of Northeast and Southeast Asian development."
                        },
                        {
                            "과목 코드": "GKS3007",
                            "과목명": "Topics in Korea Today",
                            "Former Code": "KOS2205",
                            "Lecture": "3hr.",
                            "Credits": "3cr.",
                            "Description": "This course presets historical information and theoretical perspectives needed to understand Korean society. It will introduce students to the complex and diverse political, economic, social phenomena Korean society confronts, including industrialization, democratization, globalisation, inter-Korea relations, among others."
                        },
                        {
                            "과목 코드": "GKS3008",
                            "과목명": "Statistical Thinking for Global Korean Studies",
                            "Lecture": "3hr.",
                            "Credits": "3cr.",
                            "Description": "The variety and complexity of data in Korean studies has been a significant barrier to the adoption of modern computer technology in the field. Concepts of computer programming for exploratory data analysis and examination will be presented during the course, which include probability distributions, modeling, regression, and classification. Computer programming will be a central part of the course, and students will be expected to make frequent presentations. Students will also be asked to write several reports during the course that summarize the findings of various data collection techniques and exploratory analyses."
                        },
                        {
                            "과목 코드": "GKS3009",
                            "과목명": "Korean Society and Media: Continuity of Political Topics",
                            "Former Code": "KOS3008",
                            "Lecture": "3hr.",
                            "Credits": "3cr.",
                            "Description": "The Korean media is aligned with political camps and provides a mirror of the frames that persist in political debates in Korea. This course focuses on two important and controversial issues in Korea: welfare and unification. Students will be equipped with the skills to see the relative landscape of truths in Korean politics by learning to associate persistent or shifting opinions with camps in traditional and new media. They will gain a nuanced, objective, and analytical understanding of Korean political discourse that goes beyond one-sided aspects of the Korean political landscape."
                        },
                        {
                            "과목 코드": "GKS3010",
                            "과목명": "Development of Web Contents for Korean Studies",
                            "Former Code": "KOS3014",
                            "Lecture": "3hr.",
                            "Credits": "3cr.",
                            "Description": "Students will learn about practical & fundamental uses of computers to do Korean Studies in the digital world. This course will focus more on the subject data of Korea rather than general data. In this course, students will learn both how to program with a few Web programming languages such as HTML5, CSS3, JavaScript, and Python to represent Korean culture using computational methods in the Internet. In addition to this, students will also learn how to make it fun with computers in their minds. Furthermore, students will be introduced to visualisation techniques to represent Korean knowledge. Finally, this course leads students to find potential interest from Korean data and realise their creative ideas in the digital world."
                        },
                        {
                            "과목 코드": "GKS3011",
                            "과목명": "Korean Studies SeminarⅠ: Everyday Life of North and South",
                            "Former Code": "KOS3031",
                            "Lecture": "3hr.",
                            "Credits": "3cr.",
                            "Description": "Key topics at the intersection of language, text, and culture will be investigated by students in an effort to understand Korea from a variety of linguistic, textual, and cultural perspectives."
                        },
                        {
                            "과목 코드": "GKS3012",
                            "과목명": "Image Pedagogy for Korean Studies",
                            "Lecture": "3hr.",
                            "Credits": "3cr.",
                            "Description": "This course explores the knowledge and understanding of past and present societies as constituted and conveyed via formal and informal educational media, within and beyond schools. Its focus is on various types of texts and images found in textbooks, magazines, museums, films, and digital media. Of particular interest are conceptions of time and space, forms of representation, as well as the construction of meaning and identity. Additionally, this course delves into various 20th century efforts to create new forms of media production that blend pedagogical goals with artistic experimentation. Many artists seek to surpass their function as entertainers or creators of beautiful-but-useless cultural objects by insisting on their art's capacity to teach. The tradition to create pedagogical art has laid the foundation for avant-garde movements in Asia, including Korea. Throughout the course, students will explore different models of pedagogical art to illustrate how the function of art has been defined and delimited and how new functions and conceptualization of art have emerged, while building on the formal possibilities."
                        },
                        {
                            "과목 코드": "GKS3013",
                            "과목명": "Korean Studies in Practice Ⅱ(Capstone)",
                            "강의 시간": "Lecture 3hr.",
                            "학점": "3cr.",
                            "설명": "This course offers students a chance test what they have learned in the classroom by engaging with people and ideas in variety of academic, business, and social contexts related to Korean studies."
                        },
                        {
                            "과목 코드": "GKS3014",
                            "과목명": "Sociological Imagination for Global Korean Studies",
                            "강의 시간": "Lecture 3hr.",
                            "학점": "3cr.",
                            "설명": "This course is crafted to enhance students’ capacity to understand social issues through the lens of sociological imagination. Its goal is to familiarise students with diverse perspectives and methodologies for comprehending human societies and social problems. It provides an opportunity for students to perceive social phenomena not merely as immediate expressions of the natural characteristics of individual entities and institutions, but as historical constructs and social relations. This course is well-suited for students interested in social matters and eager to grasp the intricacies of these issues across different geographical scales. Throughout each week, students will be encouraged to pose ontological, epistemological, and methodological questions about social affairs encountered in their daily lives. They will then scrutinise these issues using both quantitative and qualitative research methods. Through this process, students will have the opportunity to envision optimal socio-historical solutions to various social problems."
                        },
                        {
                            "과목 코드": "GKS3016",
                            "과목명": "세계 속의 한국인1",
                            "강의 시간": "강의 3시간",
                            "학점": "3학점",
                            "설명": "근현대 대한민국이 수립되는 과정에서 헌신했던 많은 인물들 가운데 세계 속에서 기억될 필요가 있는 사람들을 소개하는 강좌 가운데 첫 번째 강좌이다. 본 강좌는 대한민국 임시정부의 주요 인물 가운데 백범김구 선생을 중심으로 그의 삶과 사상, 독립과 세계평화정신에 초점을 맞춘다. 그리고 그를 중심으로 한 독립운동사와 사회사를 학습한다. 특히 백범 선생의 발자취를 간직하고 있는 유가족들의 경험을 나누는 수업을 통해 근현대 대한민국이 정부 수립에 관련된 지식뿐만 아니라 국가의 독립과 인물의 헌신에 관한 공감을 이끌어내고자 한다. 아울러 필요한 경우 강의 주제와 관련된 현장체험 프로그램을 실시한다."
                        },
                        {
                            "과목 코드": "GKS3017",
                            "과목명": "세계 속의 한국인2",
                            "강의 시간": "강의 3시간",
                            "학점": "3학점",
                            "설명": "근현대 대한민국이 수립되는 과정에서 헌신했던 많은 인물들 가운데 세계사적으로 기억할 필요가 있는 주요 인물을 소개하는 강좌이다. 이 강좌에서는 임시정부에 공헌했던 인물들이 자의반 타의반으로 해외 이민을 하게 됨으로써 해외 한인으로서 국외에서 대한민국의 수립과정에 기여했던 과정에 초점을 맞춘다. 특히 동시대에 식민지와 독립운동을 경험했던 많은 세계인들과 그 경험을 공유함으로써, 인류의 평화로운 공존과 그에 필요한 세계시민으로서의 자질을 함양한다. 나아가 세계시민으로서 자질과 유대감 강화를 위해, 여러 나라의 학생들과 함께 위의 주제와 관련된 현장체험 프로그램을 실시한다."
                        }
                    ],
                    "Advanced Electives": [
                        {
                            "과목 코드": "GKS4001",
                            "과목명": "Translated Korea: The Social History of Concepts in Korea",
                            "강의 시간": "Lecture 3hr.",
                            "학점": "3cr.",
                            "설명": "The formation of modern knowledge in Korea was promoted by the ceaseless efforts of intellectuals to transform themselves on the one hand, and by the introduction of translated knowledge from the West on the other. This course examines translation as part of the process of making modern knowledge. It explores how translated words and concepts were crafted and how they affected Korea in the context of knowledge circulation."
                        },
                        {
                            "과목 코드": "GKS4003",
                            "과목명": "Modern Korean Fiction",
                            "강의 시간": "Lecture 3hr.",
                            "학점": "3cr.",
                            "설명": "This course is to introduce important twentieth-century Korean fiction writers and fictional genres, as well as basic knowledge that is essential to an understanding of twentieth-century Korean fiction."
                        },
                        {
                            "과목 코드": "GKS4004",
                            "과목명": "Development: Korean Experience and Global Debates",
                            "강의 시간": "Lecture 3hr.",
                            "학점": "3cr.",
                            "설명": "This is an introductory course providing an overview of core debates around the notion and practice of development across the world, with a particular emphasis on Korea's experience of development. This course touches upon major social theories that intervene in the making of the notion of development and identifies sets of social relations and issues that affect development practice. In so doing, we will look into the ways in which these theories, sets of social relations and issues shape and reshape our development experience in Korea."
                        },
                        {
                            "과목 코드": "GKS4005",
                            "과목명": "Formation of Contemporary Korea",
                            "강의 시간": "Lecture 3hr.",
                            "학점": "3cr.",
                            "설명": "This is an advanced course on contemporary Korean society, economy and politics. It investigates major issues of post-colonial Korea from the perspective of political economy."
                        },
                        {
                            "과목 코드": "GKS4006",
                            "과목명": "Korean Studies Seminar: Gender and Development",
                            "강의 시간": "Lecture 3hr.",
                            "학점": "3cr.",
                            "설명": "This course is designed to offer an analytical framework on Korean development from a gender perspective. In this class, students examine the gendered nature of political-economic changes in South Korea. Students are exposed to various discourses on gender and development at the international fora and theoretical debates on feminist political economy including social reproduction, measuring gender inequality, unpaid care labor, household, gender-based violence and etc. Students are expected to choose a gender-related issue in contemporary South Korea and work on their research projects throughout the semester with the professor's guidance."
                        },
                        {
                            "과목 코드": "GKS4007",
                            "과목명": "International Politics of the Korean Peninsula",
                            "강의 시간": "Lecture 3hr.",
                            "학점": "3cr.",
                            "설명": "North-East Asia is dynamic and complex. Students will investigate the intense international contests that have taken place on, around, and for the Korean peninsula since the nineteenth century."
                        },
                        {
                            "과목 코드": "GKS4008",
                            "과목명": "Social Change and Movement in Contemporary Korea",
                            "강의 시간": "Lecture 3hr.",
                            "학점": "3cr.",
                            "설명": "The course offers an overview of the rapid social changes and various social movements in Korea in the context of economic development. Students will study social movements, democratization, and industrialization."
                        },
                        {
                            "과목 코드": "GKS4009",
                            "과목명": "Introduction to Exploratory Machine Learning",
                            "강의 시간": "Lecture 3hr.",
                            "학점": "3cr.",
                            "설명": "Modern Korean studies uses computational techniques to manipulate and process raw data, as well as obtain useful visualizations and insights. This course will introduce various ata manipulation techniques, including several machine learning algorithms. The course focuses on developing computer programs using well-known, open-source libraries and helps students understand the practical elements of machine learning algorithms for Korean studies. Students will be given chances to design and develop projects, as well as present their results to solidify their understanding of machine learning's practical applications in Korean studies."
                        },
                        {
                            "과목 코드": "GKS4011",
                            "과목명": "The Mediums of Korean Cultural Modernity",
                            "강의 시간": "Lecture 3hr.",
                            "학점": "3cr.",
                            "설명": "This course investigates the media of popular artistic expression and cultural experience in twentieth-century Korea. Students will learn how to read the physical materials of artistic endeavor for what they have to say about art and Korea's encounter with modernity. The course will touch on a wide variety of cultural and artistic mediums but will focus on oral performance, printed literature, and film from the first half of the century. Questions concerning the nature of these media, the historical roles that they played, and how to approach them critically will be explored. Screenings, as well as viewing and listening assignments, will be integral. “Hands-on” experimentation with the media will illuminate the artistic possibilities and technological constraints of alternate expressive modes. Participation in vocal performance, print production, and filmmaking practicums will be graded elements of the course."
                        },
                        {
                            "과목 코드": "GKS4012",
                            "과목명": "Seeing Korea: An Introduction to Image Generation, Processing & Computer Vision",
                            "강의 시간": "Lecture 3hr.",
                            "학점": "3cr.",
                            "설명": "Images are two dimensional data that have special characteristics. This course will investigate computer representation of image data, how to manipulate it, how to process it, and how to make computers understand the contents of images. Various image data from historical Korean artworks will be considered and students will perform several projects to develop computer programs to implement algorithms for image generation, processing, and understanding."
                        },
                        {
                            "과목 코드": "GKS4015",
                            "과목명": "Curatorial Studies for Korean Culture Exchange",
                            "강의 시간": "Lecture 3hr.",
                            "학점": "3cr.",
                            "설명": "This course aims to help students utilise data science in the field of Korean Studies by providing them with mathematical foundations of data science. Students will learn the basics of linear algebra, analytic geometry, matrix decompositions, vector calculus, probability and distribution, and continuous optimisation. Students will also be exposed to computational aspects of those mathematical topics through Python programming. In so doing, they will obtain a better understanding of the ways in which data science algorithms are applied to design and analysis of issues related to Korean Studies."
                        },
                        {
                            "과목 코드": "GKS4016",
                            "과목명": "Theory and Practice in Global Korean Studies 1 (Capstone Design)",
                            "강의 시간": "Lecture 3hr.",
                            "학점": "3cr.",
                            "설명": "This course will investigate the field of Korean studies as a platform for local action that enables positive global political, economic, educational, environmental, and social outcomes, as well as global political, economic, educational, environmental, and social initiatives that enable positive local outcomes in Korean communities on the peninsula and elsewhere. Students will organize a series of international forums, publish an undergraduate journal, and instigate political, economic, social, and/or diplomatic interventions for positive change."
                        },
                        {
                            "과목 코드": "GKSG002",
                            "과목명": "Digital Arts and Scholarly Craft in Korean Studies",
                            "강의 시간": "Lecture 3hr.",
                            "학점": "3cr.",
                            "설명": "This fast-paced course builds on what students have learned in Computing Korean Culture about the latest methods, theories, and tools in humanities computing as they relate to the study of Korea. Learning the art and craft of these technologies will enable students to gain a new critical understanding of Korea, as well as a deeper understanding of the tools used to create knowledge about Korea. As with Computing Korean Culture, this course begins with an investigation of the book, that central technology of culture and knowledge production. The course then contemplates reading and editorial practice in Korean cultural context, as well as modeling and design as they relate to data curation, visualization, and newer forms of knowledge about Korea. Students’ investigation of GIS (Geographic Information Systems) and network analysis will be advanced through a number of handson projects. Students will also be introduced to the principles of machine learning by conducting machine learning experiments in cloud computing environments, such as Microsoft's Machine Learning Studio. In addition, students will test experimental image mining software. Key terms (information, code, data, digital object, materiality, posthumanism) will be examined at greater depths as they relate to the study of Korea, along with new and old theoretical approaches (close reading, distant reading, sociology of texts, algorithmic criticism) and areas of study (critical code studies, software studies, platform studies, and media archaeology). While researching a subject of her or his choosing, students will develop websites and cultural atlases, as well as advance their understanding of coding for the web. By the end of the course, students will be able to compose a sophisticated academic argument using new media and/or enhance traditional research papers with data and analysis enabled by digital methods and tools. Along with a working knowledge of html, css, javascript and various data cleaning, mining and visualization tools, students will take away a deep understanding of Korea and the ways that data and digital technologies can illuminate it."
                        },
                        {
                            "과목 코드": "GKSG003",
                            "과목명": "Reading Theories of Korean Development",
                            "수업 형태": "Lecture 3hr.",
                            "학점": "3cr.",
                            "설명": "This is an advanced course that aims to provide students with a firm theoretical grounding for the study of Korean development experience. The course introduces various social, political and economic theories of development which emerged from specific historical contexts since the birth of the modern notion of development in the seventeenth century. In doing so, the course explores the origin and evolution of the doctrine of development from Western invention to global faith. Students will also learn the ways in which these particular development theories and doctrines have been imposed, adapted and taken advantage of by diverse agencies of development in Korea."
                        },
                        {
                            "과목 코드": "GKSG004",
                            "과목명": "Research in Korean Studies: Labour and Development",
                            "수업 형태": "Lecture 3hr.",
                            "학점": "3cr.",
                            "설명": "This is an advanced course that aims to investigate the links between labour, capitalism, development and poverty in contemporary Korea. The course firstly explores the ways in which labour has contributed to the making of the modern notion and practice of development. It then moves on to analyse how labour has been constantly recomposed by different doctrines of development since the emergence of capitalist industrialisation and developmentalist states. Furthermore, the course explores the role of industrial, emotional and reproductive labour in contemporary Korean development as well as the strategies and campaigns of labour movements."
                        },
                        {
                            "과목 코드": "GKSG005",
                            "과목명": "Historical Social Science and Korean Studies",
                            "수업 형태": "Lecture 3hr.",
                            "학점": "3cr.",
                            "설명": "This course will review important case studies and theoretical perspectives in historical sociology as an essential method in Korean studies. Theorizing the applicability of a spatio-temporal middle ground neither universalist or individualist, the course investigates the contexts in which Korea can be studied and theorized from a comparativist perspective."
                        },
                        {
                            "과목 코드": "GKSG007",
                            "과목명": "Big Data Analysis in Korean Studies",
                            "수업 형태": "Lecture 3hr.",
                            "학점": "3cr.",
                            "설명": "Students will learn about data analytics in Korean Studies and how to approach it. In this course, students will learn how to collect data in Korean, as well as how to conduct Korean-language analysis using computational methods. Furthermore, this course will introduce students to applied machine learning approaches. In general, students will be learning how to analyse large amounts of Korean texts and utilize the methods of data analytics in conducting research in Korean studies."
                        },
                        {
                            "과목 코드": "GKSG008",
                            "과목명": "Programming for Applied Deep Learning",
                            "수업 형태": "Lecture 3hr.",
                            "학점": "3cr.",
                            "설명": "This course introduces students to methods for building computer programs for deep neural networks. The course focuses on developing applications using a well-developed, opensource deep learning toolkit. Various issues related to deep learning will be investigated within the framework of Korean studies, and students will be expected to design several competitive projects in Korean studies."
                        },
                        {
                            "과목 코드": "GKSG009",
                            "과목명": "Korean Computational Linguistics",
                            "수업 형태": "Lecture 3hr.",
                            "학점": "3cr.",
                            "설명": "Korean is central to Korean studies in the same way that computational systems are central to contemporary life. A study of Korean, that central element of Korean identity, can be combined with the study of new information technologies in order to develop the knowledge of Korea. The study of Korean language can all be enhanced through the use of new digital tools and methods. In this course, students will learn how to advance the study of Korea by studying the Korean language with the latest computational methods."
                        },
                        {
                            "과목 코드": "GKSG010",
                            "과목명": "Filming Korea: Korean Historians Behind the Camera",
                            "수업 형태": "Lecture 3hr.",
                            "학점": "3cr.",
                            "설명": "Some critical historical junctures in Korean history have been captured on camera and recorded in films of different sorts. This course traces decisive moments in Korean history, as well as scenes from the daily life of Koreans, by critically engaging with Korean films as historical texts."
                        },
                        {
                            "과목 코드": "GKSG011",
                            "과목명": "Capstone 2: Advanced Academic Writing in Korean Studies",
                            "수업 형태": "Lecture 3hr.",
                            "학점": "3cr.",
                            "설명": "This course is intended for Global Korean Studies students in their final year. Students will be challenged to conduct original research related to Korea and compose a 30-page research paper. The paper will make a compelling argument, present new knowledge about a well-defined topic, and demonstrate a command of research methodologies and practices in Korean studies. Class will be conducted in English, and all written assignments will be composed in English. However, advanced Korean skills (including Sino-Korean characters) will be required."
                        },
                        {
                            "과목 코드": "GKSG012",
                            "과목명": "Introduction to Korean Sociolinguistics",
                            "수업 형태": "Lecture 3hr.",
                            "학점": "3cr.",
                            "설명": "Language is one of the most powerful emblems of social behavior. Sociolinguistics is a field that studies various aspects of society and certain cultures in the speech community in terms of language use. In this course, students will be introduced to language and nationalism, language and ethnicity, and language and gender so as to do Korean studies with sociolinguistic concepts. In this age, language uses in a particular communities and larger societies appear are represented in digital forms. From this perspective, students will learn how to approach Korean sociolinguistic problems using digital methods."
                        }
                    ],
                    "Courses for International Students": [
                        {
                            "과목 코드": "GKS3024",
                            "과목명": "Korean Language & Culture-Intermediate",
                            "수업 형태": "Lecture 3hr.",
                            "학점": "3cr.",
                            "설명": "This course aims to improve students' Korean language ability through engagement with research materials. Students will also take field trips, make reports and presentations, and participate in wide-ranging discussions."
                        },
                        {
                            "과목 코드": "GKS3025",
                            "과목명": "Korean Language & History-Intermediate",
                            "수업 형태": "Lecture 3hr.",
                            "학점": "3cr.",
                            "설명": "This course aims to improve students' Korean language ability through engagement with research materials. Students will also take field trips, make reports and presentations, and participate in wide-ranging discussions."
                        },
                        {
                            "과목 코드": "GKS3026",
                            "과목명": "Korean Language & Society-Intermediate",
                            "수업 형태": "Lecture 3hr.",
                            "학점": "3cr.",
                            "설명": "This course aims to improve students' Korean language ability through engagement with research materials. Students will also take field trips, make reports and presentations, and participate in wide-ranging discussions."
                        },
                        {
                            "과목 코드": "GKS3027",
                            "과목명": "Korean Language & Culture-Beginner",
                            "수업 형태": "Lecture 3hr.",
                            "학점": "3cr.",
                            "설명": "This course aims to improve students' Korean language ability through engagement with research materials. Students will also take field trips, make reports and presentations, and participate in wide-ranging discussions."
                        },
                        {
                            "과목 코드": "GKS3028",
                            "과목명": "Korean Language & History-Beginner",
                            "수업 형태": "Lecture 3hr.",
                            "학점": "3cr.",
                            "설명": "This course aims to improve students' Korean language ability through engagement with research materials. Students will also take field trips, make reports and presentations, and participate in wide-ranging discussions."
                        },
                        {
                            "과목 코드": "GKS3029",
                            "과목명": "Korean Language & Society-Beginner",
                            "수업 형태": "Lecture 3hr.",
                            "학점": "3cr.",
                            "설명": "This course aims to improve students' Korean language ability through engagement with research materials. Students will also take field trips, make reports and presentations, and participate in wide-ranging discussions."
                        },
                        {
                            "과목 코드": "GKS3030",
                            "과목명": "Korean Language & Culture-Advanced",
                            "수업 형태": "Lecture 3hr.",
                            "학점": "3cr.",
                            "설명": "This course aims to improve students' Korean language ability through engagement with research materials. Students will also take field trips, make reports and presentations, and participate in wide-ranging discussions."
                        },
                        {
                            "과목 코드": "GKS3031",
                            "과목명": "Korean Language & History-Advanced",
                            "수업 형태": "Lecture 3hr.",
                            "학점": "3cr.",
                            "설명": "This course aims to improve students' Korean language ability through engagement with research materials. Students will also take field trips, make reports and presentations, and participate in wide-ranging discussions."
                        }
                    ],
                    "Courses for Sogang International Summer Program (SISP)": [
                        {
                            "과목 코드": "GKS9000",
                            "과목명": "Elementary Korean 1",
                            "수업 형태": "Lecture 3hr.",
                            "학점": "3cr.",
                            "설명": "This course aims to develop students' Korean language ability through engagement with various subjects of language materials. Students will also take field trips, make reports and presentations, and participate in wide-ranging discussions."
                        },
                        {
                            "과목 코드": "GKS9001",
                            "과목명": "Elementary Korean 2",
                            "수업 형태": "Lecture 3hr.",
                            "학점": "3cr.",
                            "설명": "This course aims to develop students' Korean language ability through engagement with various subjects of language materials. Students will also take field trips, make reports and presentations, and participate in wide-ranging discussions."
                        },
                        {
                            "과목 코드": "GKS9002",
                            "과목명": "Intermediate Korean 1",
                            "수업 형태": "Lecture 3hr.",
                            "학점": "3cr.",
                            "설명": "This course aims to improve students' Korean language ability through engagement with various subjects of language materials. Students will also take field trips, make reports and presentations, and participate in wide-ranging discussions."
                        },
                        {
                            "과목 코드": "GKS9003",
                            "과목명": "Intermediate Korean 2",
                            "수업 형태": "Lecture 3hr.",
                            "학점": "3cr.",
                            "설명": "This course aims to improve students' Korean language ability through engagement with various subjects of language materials. Students will also take field trips, make reports and presentations, and participate in wide-ranging discussions."
                        },
                        {
                            "과목 코드": "GKS9004",
                            "과목명": "Advanced Korean Ⅰ",
                            "수업 형태": "Lecture 3hr.",
                            "학점": "3cr.",
                            "설명": "This course aims to advance students' Korean language ability through engagement with various subjects of language materials. Students will also take field trips, make reports and presentations, and participate in wide-ranging discussions."
                        },
                        {
                            "과목 코드": "GKS9005",
                            "과목명": "Advanced Korean Ⅱ",
                            "수업 형태": "Lecture 3hr.",
                            "학점": "3cr.",
                            "설명": "This course aims to advance students' Korean language ability through engagement with various subjects of language materials. Students will also take field trips, make reports and presentations, and participate in wide-ranging discussions."
                        }
                    ]
                }
            },
            "한국어교육전공": {
                "과목 정보": {
                    "전공입문": [
                        {
                            "과목 코드": "KLC1002",
                            "과목명": "한국어의사소통Ⅱ",
                            "강의 시간": "3시간",
                            "학점": "3학점",
                            "내용": "한국어 의사소통 Ⅱ는 한국어 의사소통Ⅰ의 후속 과목으로서 말하기, 듣기, 읽기, 쓰기 능력을 통합하여 교육하는 한국어 과목이다. 학생들이 다양한 활동을 통하여 충분한 연습과 경험을 하도록 하며 네 가지 기능을 균형 있게 증진한다."
                        }
                    ],
                    "전공필수": [
                        {
                            "과목 코드": "GKE2001",
                            "과목명": "한국어교육학개론",
                            "강의 시간": "3시간",
                            "학점": "3학점",
                            "내용": "한국어교육학을 공부하기 위해 한국어교육과 관련된 가장 기본적인 내용을 학습하고 앞으로 한국어교육학을 어떻게 공부할 것인지에 대한 로드맵을 설계하는 수업이다. 한국어교육의 여러 하위 영역을 개괄적으로 살펴보면서 한국어교육학의 전반적인 내용을 체계적으로 이해할 수 있다. 또한 한국어교육과 관련된 다양한 변인과 환경적 요인에 대해 알고 인접 학문과의 차이를 파악하면서 한국어교육학의 학문적 정체성을 이해한다."
                        },
                        {
                            "과목 코드": "GKE2002",
                            "과목명": "한국어학개론",
                            "강의 시간": "3시간",
                            "학점": "3학점",
                            "내용": "한국어 교육 및 연구에 가장 기본이 되는 한국어에 대하여 기본적인 이해를 갖추도록 하는 것을 목표로 한다. 한국어의 언어학적 특징과 소리, 어휘, 문장, 담화의 체계와 구조와 체계에 대한 기초적인 지식을 익혀서 한국어 교육에 적용할 수 있도록 학습한다. 한국어를 기술하고 설명하는 데 필요한 기본 개념과 용어를 익혀 한국어 교사로서 갖추어야 할 기본 역량을 함양할 수 있도록 한다."
                        },
                        {
                            "과목 코드": "GKE2003",
                            "과목명": "외국어습득론",
                            "강의 시간": "3시간",
                            "학점": "3학점",
                            "내용": "모국어와 제2언어 습득의 이론적 배경을 고찰하고 습득에 영향을 미치는 다양한 변인들에 대해 알아본다. 또한 제2언어 습득 과정에서의 학습자 언어의 특성을 이해하여 외국어습득론에 근거한 한국어교육 방안을 모색하기 위한 이론적 지식을 함양한다."
                        },
                        {
                            "과목 코드": "GKE2004",
                            "과목명": "한국역사와문화",
                            "강의 시간": "3시간",
                            "학점": "3학점",
                            "내용": "한국이 경험해 온 역사와 함께, 한국인의 가치관을 형성해 온 문화, 역사적/사회적/시대적으로 지배적이었던 사상에 대해서도 함께 다룬다. 수강생들은 이를 통해 과거의 사건이 당대에 어떤 의미를 지녔는지 이해할 뿐만 아니라, 해당 사건이 현재의 한국과 한국인들에게 어떤 영향을 주고 있는지 성찰하여, 한국어교육에 적용할 수 있는 제반 지식을 학습한다."
                        },
                        {
                            "과목 코드": "GKE2005",
                            "과목명": "외국어로서의한국어교육실습",
                            "강의 시간": "12주는 강의 및 모의 수업, 4주는 수업 참관",
                            "학점": "3학점",
                            "내용": "한국어교육 전공 교과에서 학습한 한국어에 대한 지식, 교수법, 개별 영역에 대한 이론과 실제 등을 참관과 모의수업 등을 통해 실제 교수 현장에 적용할 수 있는 능력을 갖춘다."
                        }
                    ],
                    "전공선택": [
                        {
                            "과목 코드": "GKE3001",
                            "과목명": "한국어문법론",
                            "강의 시간": "3시간",
                            "학점": "3학점",
                            "내용": "한국어 문법 분야 중 문장과 형태를 중심으로 기본 지식을 학습하되, 핵심 사례 및 쟁점 사례를 중심으로 충분히 그 용례를 익히도록 한다. 이를 통해 한국어교육에서 문법을 교수하기 위한 핵심적인 내용 지식을 갖추도록 한다."
                        },
                        {
                            "과목 코드": "GKE3002",
                            "과목명": "한국어어문규범",
                            "강의 시간": "3시간",
                            "학점": "3학점",
                            "내용": "현대 한국에서 공식적으로 사용하는 어문 규범을 살펴본다. 한글 맞춤법, 표준어 규정, 외래어 표기법, 국어의 로마자 표기법을 실제 사용 실태와 함께 검토함으로써 효율적인 문자 생활을 영위할 수 있도록 한다."
                        },
                        {
                            "과목 코드": "GKE3003",
                            "과목명": "대조언어학",
                            "강의 시간": "3시간",
                            "학점": "3학점",
                            "내용": "학습자의 모국어와 학습 대상 언어 간의 관계에 대해 이해하고 언어권별 차이의 발생 원인과 현상을 확인하는 것을 목적으로 한다. 서로 다른 언어의 자모 체계, 음절 구조, 음운 현상, 어휘 범주, 문장 성분과 어순, 시제와 상, 표현 및 담화의 공통점과 차이점을 확인해 보고 이를 교육적으로 적용하기 위한 이론적 지식을 함양한다."
                        },
                        {
                            "과목 코드": "GKE3004",
                            "과목명": "언어학개론",
                            "강의 시간": "3시간",
                            "학점": "3학점",
                            "내용": "인간 언어의 모습과 인간 언어의 체계가 어떠한지를 살펴보고 언어학의 주요 분야를 개괄적으로 살펴본다. 외국어로서의 한국어교육을 전공하는 학생들이 언어학을 이해하고 언어를 체계적으로 이해할 수 있는 안목을 갖는 것을 수업 목표로 한다. 이를 위해 순수언어학 영역인 음운론, 형태론, 통사론, 의미론, 화용론 등을 비롯해 언어와 관련된 여러 인접 학문의 영역을 다루는 응용언어학까지 전반적으로 살펴봄으로써 언어학의 기초를 다진다."
                        },
                        {
                            "과목 코드": "GKE3005",
                            "과목명": "매체활용한국어교육",
                            "강의 시간": "3시간",
                            "학점": "3학점",
                            "내용": "다양한 매체와 기술의 발달 과정에서 한국어교육의 환경의 변화와 관련된 다양한 매체의 특성을 이해하고 효과적인 한국어교육을 위한 교수 방안을 학습한다. 매체를 효과적으로 활용하여 학습자들에게 실제적인 의사소통을 경험하게 함으로써 한국어능력을 향상시킬 수 있음을 이해한다. 또한 교사가 매체의 특성을 더 섬세하게 이해함으로써 효과적인 한국어 교수 학습 환경을 구현할 수 있는 역량을 기른다."
                        },
                        {
                            "과목 코드": "GKE3006",
                            "과목명": "한국문화교육론",
                            "강의 시간": "3시간",
                            "학점": "3학점",
                            "내용": "문화교육에 대한 다양한 이론과 관점을 고찰하며, 한국문화교육 과정의 실제를 구체적으로 분석한다. 이를 바탕으로 한국문화 수업의 모형을 구성할 수 있다."
                        },
                        {
                            "과목 코드": "GKE3007",
                            "과목명": "한국어교수법",
                            "강의 시간": "3시간",
                            "학점": "3학점",
                            "내용": "외국어교육의 다양한 교수법에 대한 이론들을 고찰하고 한국어교육의 다양한 변인들을 고려한 적용 방안에 대해 논의한다. 교수법의 변천 과정을 이해하고 의사소통 환경의 변화와 매체의 변화 등 다양한 환경적 변화를 고려하여 향후 한국어교수법의 발전 방안을 모색한다."
                        },
                        {
                            "과목 코드": "GKE3008",
                            "과목명": "한국어교육과정및교재론",
                            "강의 시간": "3시간",
                            "학점": "3학점",
                            "내용": "한국어교육과정 설계와 실제 교육과정 분석을 위해 가장 기본적으로 알아야 할 개념과 원리를 이해하고 전반적인 한국어교육과정의 이해를 바탕으로 교재의 선정 및 활용 방안을 탐구한다."
                        },
                        {
                            "과목 코드": "GKE3009",
                            "과목명": "한국어문법교육론",
                            "강의 시간": "3시간",
                            "학점": "3학점",
                            "내용": "한국어 문법의 체계와 특징을 탐구하고 외국어로서의 한국어문법교육의 내용과 방안을 모색한다. 본 교과목에서는 문법 교육의 필요성과 한국어 교육 문법의 특성, 문법 교수 이론을 학습하고 문법 교수의 원리와 방법, 문법 수업의 모형, 한국어문법교육 항목의 선정 및 배열 기준에 대하여 학습한다. 이를 바탕으로 한국어 문법 교수 방안을 익혀 한국어 문법을 가르칠 수 있는 역량을 함양한다."
                        },
                        {
                            "과목 코드": "GKE3010",
                            "과목명": "한국어발음교육론",
                            "강의 시간": "3시간",
                            "학점": "3학점",
                            "내용": "외국인에게 한국어 발음을 어떻게 교육하는 것이 효과적인지에 대해 살펴보고 한국어 발음에 대한 기초 지식과 특징을 학습한다. 이를 위해 발음교육의 원리와 방법, 자음과 모음의 교육 방법, 음절구조의 교육 방법, 개별 음운현상의 교육 방법, 억양의 교육 방법 등을 살펴보고 한국어의 자음과 모음 체계, 음절구조, 억양 구조, 한국어의 음운 현상 등에 대한 기초 지식을 쌓는 것을 학습 목표로 한다."
                        },
                        {
                            "과목 코드": "GKE3011",
                            "과목명": "한국어어휘교육론",
                            "강의 시간": "3시간",
                            "학점": "3학점",
                            "내용": "어휘 교육의 목적 및 필요성을 이해하고 어휘 교육의 내용과 교수법을 학습하는 것을 목표로 한다. 한국어 어휘의 체계적, 구조적, 의미적, 사회언어학적 특성에 대해 이해하고 이를 어휘 교육과 연관지어 단계별 어휘 지도 방안을 고찰한다. 이를 바탕으로 한국어 어휘 교육 능력을 함양할 수 있도록 한다."
                        },
                        {
                            "과목 코드": "GKE3012",
                            "과목명": "한국어이해교육론",
                            "강의 시간": "3시간",
                            "학점": "3학점",
                            "내용": "한국어 읽기와 듣기 교수·학습의 이론과 방법을 학습한다. 읽기와 듣기의 개념과 특성을 이해하고 교육 원리와 목표, 교육 내용과 방법을 학습한다. 읽기와 듣기의 학습전략과 교수전략을 확인하고 읽기와 듣기의 수업 단계, 수업 단계별 활동 유형을 구체적으로 살펴봄으로써 실제 한국어 수업에 적용할 수 있는 역량을 함양한다."
                        },
                        {
                            "과목 코드": "GKE3013",
                            "과목명": "한국어평가론",
                            "강의 시간": "3시간",
                            "학점": "3학점",
                            "내용": "한국어평가에 대한 기본적인 이해를 갖추도록 하는 것을 목표로 한다. 외국어평가의 개념과 이론, 유형, 방법, 채점에 대하여 학습하고 현재 개발되어 시행하고 있는 여러 평가 도구에 대하여 고찰한다. 또한 평가 문항을 개발해 봄으로써 실제 한국어교육 수업에서 학습자의 성취도를 평가할 수 있는 능력을 함양하도록 한다."
                        },
                        {
                            "과목 코드": "GKE3014",
                            "과목명": "한국어표현교육론",
                            "강의 시간": "3시간",
                            "학점": "3학점",
                            "내용": "말하기와 쓰기 영역에 대해 표현 영역으로서의 특성을 이해하고 효과적인 한국어말하기교육과 한국어쓰기교육에 대해 학습한다. 표현 영역인 말하기와 쓰기에서 한국어의 특성을 이해하고 담화와 텍스트의 구조 및 특징을 살펴본다. 표현교육을 위한 교육과정과 교수법의 기본 개념을 이해하고 실제 한국어 교수학습 상황에서 표현교육의 구체적인 교수방안에 대해 논의함으로써 더 나은 교수방안을 모색한다. 또한 효과적인 표현영역의 평가 방안을 알고 실제 현장에서의 적용 가능성에 대해 논의한다."
                        },
                        {
                            "과목 코드": "GKE3015",
                            "과목명": "한국대중문화의이해",
                            "학점": 3,
                            "내용": "‘한류’ 현상과 그 토대가 된 한국문화를 살펴본다. 수강생들은 문화접변 및 문화상품의 생산/유통/소비의 관점에서 ‘한류’ 현상을 분석하고 이해할 뿐 아니라, ‘한류’로 대표되는 한국 대중문화 확산의 배경이 된 한국인의 문화적 유산과 그 현대적 형성과정을 이해하고 설명할 수 있다."
                        },
                        {
                            "과목 코드": "GKE3016",
                            "과목명": "한국문학개론",
                            "학점": 3,
                            "내용": "한국문학의 개념과 범위, 갈래와 특징에 대한 이해를 바탕으로 한국 고전문학에서부터 한국 현대문학에 이르기까지 시대별, 장르별 주요 특징을 연구한다."
                        },
                        {
                            "과목 코드": "GKE3017",
                            "과목명": "기초번역",
                            "학점": 3,
                            "내용": "번역에 대한 실용적인 강의와 실습을 통해 번역의 특징을 이해하고, 주어진 상황과 목적에 맞춰 효과적으로 번역하는 방법을 배운다. 수업에 사용되는 텍스트는 다양한 주제와 형식을 중심으로 하여 정확한 원문 분석과 자연스러운 문장력, 어휘력, 표현력 향상에 중점을 둔다."
                        },
                        {
                            "과목 코드": "GKE3018",
                            "과목명": "기초통역",
                            "학점": 3,
                            "내용": "한국어 표현을 정확히 이해한 후 그 내용을 다른 언어로 옮기는 과정을 단계적으로 체계적으로 학습하고 연습한다. 텍스트를 빠르고 정확하게 요약해 표현하는 법을 연습하고, 이를 대화통역에 적용해 연습한다."
                        },
                        {
                            "과목 코드": "GKE3019",
                            "과목명": "대중매체영상통번역",
                            "학점": 3,
                            "내용": "통역과 번역은 문법과 어휘를 통합적으로 익힐 수 있을 뿐 아니라, 의사소통을 중시하고 의미 전달을 목표로 하는 외국어 교육 목표에 부합하는 작업이다. 대중 매체에서 가치 있는 동영상 자료를 중심으로 하여 한국어 통번역 능력을 실제적으로 향상시키는 연습을 한다."
                        },
                        {
                            "과목 코드": "GKE3020",
                            "과목명": "대중매체와한국사회문화",
                            "학점": 3,
                            "내용": "최근 한국의 대중문화는 빠른 속도로 발전하고 있다. 드라마나 K-pop과 같은 분야는 물론이고 연극이나 오페라와 같은 분야에서도 발전의 속도는 매우 빠르다. 이 강좌에서는 한국 사회 발전과 대중 문화의 영향 관계를 학습할 것이다."
                        },
                        {
                            "과목 코드": "GKE3021",
                            "과목명": "번역실습및평가",
                            "학점": 3,
                            "내용": "특정 언어권 학습자를 대상으로 한국어 통역 실습 프로젝트를 기획하고 수행한다. 기본 언어 지식, 두 언어의 사회 문화적 배경 지식, 표현 오류를 통해 볼 수 있는 대조언어학적 지식, 통역 전략에 관한 지식, 외래어, 신조어, 한자어 등 어휘 지식 등에 유의하여 과제를 완수한다."
                        },
                        {
                            "과목 코드": "GKE3022",
                            "과목명": "비즈니스통번역",
                            "학점": 3,
                            "내용": "통번역기초 지식을 통해 습득한 커뮤니케이션 기초 능력을 바탕으로 비즈니스 상황에서 이루어지는 의사소통을 중심으로 통번역을 한다."
                        },
                        {
                            "과목 코드": "GKE3023",
                            "과목명": "에듀테크와한국어교육",
                            "학점": 3,
                            "내용": "4차 산업 혁명이라 불리는 최신의 기술이 한국어 교수 학습 환경을 어떤 방식으로 변화시키는지 살펴보고, 이런 변화와 함께 있는 현재의 교육 방법과 에듀테크 산업의 실태와 동향을 조사한다. 이를 기반으로 한국어교육의 기존 교수 학습 체제의 혁신을 이끌어갈 수 있는 방안을 학습한다."
                        },
                        {
                            "과목 코드": "GKE3024",
                            "과목명": "출판번역",
                            "학점": 3,
                            "내용": "특정 언어권 학습자를 대상으로 한국어 출판 번역 프로젝트를 기획하고 수행한다. 특히 문화권별로 차이가 있는 텍스트 유형을 고려하여 미시적 텍스트 읽기 작업을 병행하여 수행하며, 프로젝트 수행에 필요한 이론적 토대를 탄탄히 하면서 과제를 완성한다."
                        },
                        {
                            "과목 코드": "GKE3025",
                            "과목명": "통역실습및평가",
                            "학점": 3,
                            "내용": "외국어를 한국어로 통역하는 연습을 하고, 실력이 향상된 후 한국어를 외국어로 통역하는 훈련을 병행한다. 또한 동료 수강생의 통역 표현을 듣고 평가하는 협력적 학습을 진행한다."
                        },
                        {
                            "과목 코드": "GKE3026",
                            "과목명": "한국공연예술과테크놀로지",
                            "학점": 3,
                            "내용": "디지털 시대의 예술이 예술의 소통 구조를 변혁시킴으로써 공연 예술의 발전에 어떤 영향을 미쳤는지 살펴본다. 이를 기반으로 하여 한국의 전통 및 현대 공연 예술이 분야별로 어떤 새로운 시도를 꾀하고 있는지 분석한다. 궁극적으로, 한국의 사회문화현상으로서 공연 예술이 차지하는 미래 비전을 제시를 목표로 한다."
                        },
                        {
                            "과목 코드": "GKE3027",
                            "과목명": "한국어교육영상제작",
                            "학점": 3,
                            "내용": "매체를 활용한 한국어 교수 학습의 비중이 급격히 늘어나고 있다. 언어권 및 문화권별로 매체 선호도를 고려하여 한국어 교육 자료를 제작하는 방법을 배운다. 특히 국외 학습자를 대상으로 할 때 원어민 화자의 언어 사용 양상을 잘 보여주면서도 언어문화를 실제적으로 이해시킬 수 있는 맞춤형 영상 제작 프로젝트를 수행한다."
                        },
                        {
                            "과목 코드": "GKE3028",
                            "과목명": "한국어데이터기반에듀테크창업",
                            "학점": 3,
                            "내용": "한국어 교육 현장에서 일어나는 다양한 문제를 해결하기 위한 창의적 방안을 토론하고 실습한다. 그리고 제안된 해결책을 바탕으로 실제 사업을 구상해 본다. 나아가 한국어교육 분야에서 학제적 융합 연구와 글로벌 혁신을 주도하는 리더로서의 자질을 갖추기 위한 역량을 함양한다."
                        },
                        {
                            "과목 코드": "GKE3029",
                            "과목명": "한국어데이터와한국사회문화",
                            "학점": 3,
                            "내용": "디지털 시대에 다양한 환경에서 한국 사회와 문화를 표현하는 데이터를 수집하고 분석한다. 이를 통해 한국어 데이터 분석 방법을 배우고 한국어 교수법을 개발하며, 한국의 사회 문화적 특징을 언어적 데이터로부터 발견하고 이해하는 방법을 배운다."
                        },
                        {
                            "과목 코드": "GKE3030",
                            "과목명": "한류산업과한국어교육",
                            "학점": 3,
                            "내용": "한류 콘텐츠의 국외 확산으로 시작된 한류가 정치, 경제, 사회, 문화, 관광 등 다양한 분야와 영역에서 사용되고 산업화되고 있는 양상을 살펴보고, 이와 연계하여 어떻게 한국어 국외 보급 및 한국어교육이 발전되어 왔는지 탐구한다."
                        },
                        {
                            "과목 코드": "GKEG001",
                            "과목명": "한국어데이터기반한국언어문화연구",
                            "학점": 3,
                            "내용": "한국어로 작성된 언어 데이터를 수집하고 고급 자료 분석 방법론을 적용하여 과학적이고 체계적으로 한국의 언어와 문화 현상을 분석하고 해석하는 역량을 함양한다. 또한 분석한 결과를 한국어교육 콘텐츠 개발, 학습자 언어 능력 진단 등 교육적으로 활용하는 방법을 학습한다."
                        }
                    ]
                }
            },
            "International Relations": {
                "과목 정보": {
                    "Pre-Major Courses(전공입문)": [
                        {
                            "과목 코드": "TIS1001",
                            "과목명": "Introduction to International Relations(국제관계개론)",
                            "Lecture": "3hr.",
                            "Credits": "3cr.",
                            "Description": "This is an introductory course on international relations, which provides students with a bird-eye-view of contemporary international affairs. By taking this course, students will obtain basic background knowledge about international relations, which will help build a solid foundation for advanced courses."
                        },
                        {
                            "과목 코드": "TIS1002",
                            "과목명": "Introduction to International Commerce (국제통상입문)",
                            "Lecture": "3hr.",
                            "Credits": "3cr.",
                            "Description": "This introductory course serves as a foundational exploration of essential economic concepts crucial to the International Commerce program, enriched by insightful case studies. Students will be able to understand the decision making of consumers and firms, price theory across various market structures, measures and models of aggregate economic activities, and macroeconomic policy tools."
                        },
                        {
                            "과목 코드": "AAS1001",
                            "과목명": "Introduction to Asian Studies(아시아학개론)",
                            "Lecture": "3hr.",
                            "Credits": "3cr.",
                            "Description": "This introductory course provides an overview of some of the key issues relating to Asia and Asian Studies. The course facilitates an interdisciplinary understanding of Asia's past and present through the region's geography, history, culture, economy and politics. Our approach enables students to acquire a foundational knowledge of Asia and prepares them for more advanced courses in the Asian Studies track and beyond."
                        }
                    ],
                    "Major Core Courses(전공필수선택)": [
                        {
                            "과목 코드": "TIS1004",
                            "과목명": "Research Methodology(연구방법론)",
                            "Lecture": "3hr.",
                            "Credits": "3cr.",
                            "Description": "This is an introductory course on research methods, which provides students insights into a range of methodological tools for problem-driven research. By taking this course, students will learn the basic processes and stages of qualitative and quantitative methods, which will help them to build their own research designs. This course is highly recommended, particularly for students who plan to major in International Relations and Asian Studies."
                        },
                        {
                            "과목 코드": "TIR2001",
                            "과목명": "International Relations Theory(국제관계이론)",
                            "Lecture": "3hr.",
                            "Credits": "3cr.",
                            "Description": "In this course, students will learn about the major theories of international relations. While learning key concepts, fundamental assumptions, and essential arguments, students will be able to equip themselves with analytic tools with which they can better interpret complex international affairs."
                        },
                        {
                            "과목 코드": "TIR2002",
                            "과목명": "Diplomatic History(외교사)",
                            "Lecture": "3hr.",
                            "Credits": "3cr.",
                            "Description": "This course aims to provide students with an in-depth understanding of diplomatic history, with a special focus on events that have a critical impact on contemporary international politics, such as the French Revolution, the Napoleonic Wars, two World Wars, the Cold War, and the dissolution of the Soviet Union."
                        },
                        {
                            "과목 코드": "TIR2003",
                            "과목명": "Globalization and World Politics(세계화와글로벌정치)",
                            "Lecture": "3hr.",
                            "Credits": "3cr.",
                            "Description": "The primary objective of this course is to introduce students to major analytic tools and practical knowledge about world politics in the era of globalization. In this course, students will examine the impacts of globalization, de-globalization, localization, and regional integration on world affairs."
                        },
                        {
                            "과목 코드": "TIR2004",
                            "과목명": "Introduction to International Development(국제개발개론)",
                            "Lecture": "3hr.",
                            "Credits": "3cr.",
                            "Description": "This course is designed to introduce students to an interdisciplinary study of international development. With overarching themes of economic growth, human development, foreign aid, women's empowerment, food and environmental security, etc., this course provides an in-depth understanding of international development and cooperation."
                        },
                        {
                            "과목 코드": "TIR2005",
                            "과목명": "International Security and Peace (국제안보와평화)",
                            "Lecture": "3hr.",
                            "Credits": "3cr.",
                            "Description": "This course aims to teach students about international peace and security. In particular, a special scholarly emphasis will be put on the use of force as a tool to enable a state to accomplish its political goals."
                        },
                        {
                            "과목 코드": "TIR3001",
                            "과목명": "International Political Economy(국제정치경제)",
                            "Lecture": "3hr.",
                            "Credits": "3cr.",
                            "Description": "This course investigates the linkage between international politics and international economy. With a special focus on impacts of international trade, investment, and monetary and financial policy, this course covers issues such as trade wars, currency crises, international organizations, and international regimes."
                        },
                        {
                            "과목 코드": "TIR3002",
                            "과목명": "International Politics of the Korea Peninsula(한반도국제관계)",
                            "Lecture": "3hr.",
                            "Credits": "3cr.",
                            "Description": "International politics surrounding the Korean peninsula is exceptionally dynamic and complex. Students will investigate the intense international contests that have taken place on, around, and for the Korean peninsula since the nineteenth century."
                        },
                        {
                            "과목 코드": "TIR3003",
                            "과목명": "Advanced Research Methodology(고급연구방법론)",
                            "Lecture": "3hr.",
                            "Credits": "3cr.",
                            "Description": "This course is intended to help students design their own research projects. By teaching quantitative and qualitative research methodologies, this course aims to hone students’ capabilities so that they can independently conduct academic research."
                        },
                        {
                            "과목 코드": "TIR4001",
                            "과목명": "Major Issues in Global Affairs(글로벌시사문제)",
                            "Lecture": "3hr.",
                            "Credits": "3cr.",
                            "Description": "This is a seminar course designed to familiarize students with current world affairs. By actively debating controversial international issues, students will not only deepen their understanding of international politics, but also sharpen their debating skills and learn to respect diversity."
                        }
                    ],
                    "Major Electives(전공선택)": [
                        {
                            "과목 코드": "TIR2006",
                            "과목명": "Understanding International Law(국제법의이해)",
                            "Lecture": "3hr.",
                            "Credits": "3cr.",
                            "Description": "This course provides students with an introduction to international law in this era marked by trans-jurisdictional practice. By taking this course, students will become familiar with key features of international law, law of treaties, state's legal responsibility, jurisdiction and immunity, maritime law, international human right, etc."
                        },
                        {
                            "과목 코드": "TIR2007",
                            "과목명": "International Relations of East Asia (동아시아국제관계)",
                            "Lecture": "3hr.",
                            "Credits": "3cr.",
                            "Description": "This course is designed to help students deepen their understanding of international relations in East Asia. While discussing politics, the economy, identity, history, and strategies, students will be able to depict a broader but more detailed picture of current international politics in the East Asian region."
                        },
                        {
                            "과목 코드": "TIR2008",
                            "과목명": "American Foreign Policy (미국외교정책)",
                            "Lecture": "3hr.",
                            "Credits": "3cr.",
                            "Description": "This course explores American foreign policy and its implications on contemporary international affairs. By taking an “inside-out” approach, this course will place a particular emphasis on internal sources of American foreign policy formulation such as domestic power struggles, election politics, bureaucratic infightings, political systems, civil societies, etc."
                        },
                        {
                            "과목 코드": "TIR2009",
                            "과목명": "Chinese Foreign Policy (중국외교정책)",
                            "Lecture": "3hr.",
                            "Credits": "3cr.",
                            "Description": "The primary goal of this course is to acquaint students with Chinese foreign policy. The issues that will be covered in this course include, but are not limited to, the history of Chinese foreign policy, Sino-U.S. rivalry, U.S.-China-Russian trilateral relations, China's exchanges with the Korean peninsula, and the Taiwan Strait crises."
                        },
                        {
                            "과목 코드": "TIR2010",
                            "과목명": "International Relations of Japan (일본의 국제관계)",
                            "Lecture": "3hr.",
                            "Credits": "3cr.",
                            "Description": "This course is intended to help students understand contemporary international relations of Japan. By taking this course, students will be able to deepen their understandings of Japanese politics and foreign policies in the contemporary world."
                        },
                        {
                            "과목 코드": "TIR2101",
                            "과목명": "Understanding International Relations",
                            "Lecture": "3hr.",
                            "Credits": "3cr.",
                            "Description": "Designed to help students expand their knowledge about the field of International Relations and horn analytical skills in Political Science, this course invites students to build their respective approaches to answer these questions. This course will impact students in the following regards. First, students will have a chance to familiarize themselves with diverse issues (e.g., war, peace, international political economy, human rights, etc.) and events in international relations (with a focus on East Asia) in the past and recent years. Second, students will learn existing theoretical frameworks in IR, which have greatly influenced policy-makers, scholars, and commentators alike. Third, students will develop their approaches through the presentation and essay assignments, which will be supported by the instructor's close consultations, not to mention in class discussions."
                        },
                        {
                            "과목 코드": "AAS2003",
                            "과목명": "Diplomacy in Asia(아시아의 외교)",
                            "설명": "(Lecture 3hr.) 3cr. This course discusses the issues of diplomacy and foreign policy in the context of Asia. It aims to understand historical and contemporary institutions and laws of diplomacy, key diplomatic actors, and their decision-making processes, but also examine the diplomatic cultures and practices of key actors including leading and non-leading states."
                        },
                        {
                            "과목 코드": "AAS2016",
                            "과목명": "Politics in Southeast Asia (동남아 정치 개론)",
                            "설명": "(Lecture 3hr.) 3cr. This course aims to provide an in-depth understanding of political and social issues in Southeast Asian countries with diverse theoretical perspectives in the field of comparative politics."
                        },
                        {
                            "과목 코드": "TIR3004",
                            "과목명": "NGOs and Global Governance (NGO와 글로벌거버넌스)",
                            "설명": "(Lecture 3hr.) 3cr. This course helps students understand global governance and the role of non-governmental organizations (NGOs) in contemporary international politics. In this course, students will explore key issues about global governance, the impact of international non-governmental organizations on global governance, and interactions between NGOs and governmental organizations."
                        },
                        {
                            "과목 코드": "TIR3005",
                            "과목명": "International Conflict Resolution(국제분쟁해결)",
                            "설명": "(Lecture 3hr.) 3cr. This course examines international conflicts as well as the management and resolution of these conflicts. By exploring theoretical and practical approaches to international conflicts, preventive diplomacy, international mediation, peacebuilding efforts, and resolution of international conflicts, students will be able to broaden their understandings of conflicts among states."
                        },
                        {
                            "과목 코드": "TIR3006",
                            "과목명": "Human Rights in a Globalized World(세계화시대의인권)",
                            "설명": "(Lecture 3hr.) 3cr. This course offers an introduction to key issues concerning international human rights. Upon completion of this course, students will be equipped with a theoretical and practical understanding of diverse facets of human rights and their philosophies, institutions, principles, and practices."
                        },
                        {
                            "과목 코드": "TIR3007",
                            "과목명": "Foreign Policy Decision-Making(외교정책결정론)",
                            "설명": "(Lecture 3hr.) 3cr. This course aims to expose students to foreign policy decision-making processes. By learning various theories about foreign policy decision-making, students will be able to better understand how foreign policy is made and conducted through interaction of diverse actors, the constraints on foreign policy formulation, and the implications a certain foreign policy can have at the local, national, regional, and global levels."
                        },
                        {
                            "과목 코드": "TIR3008",
                            "과목명": "South-North Korean Relations(남북한관계)",
                            "설명": "(Lecture 3hr.) 3cr. In this course, students will examine inter-Korean relations from the latter half of the 20th century to the present. Focusing mainly on the aftermaths of war and division, this course offers knowledge about key issues in international affairs focused on modern Korea."
                        },
                        {
                            "과목 코드": "TIR3009",
                            "과목명": "Contemporary Korea-US Relations (현대한미관계)",
                            "설명": "(Lecture 3hr.) 3cr. This course seeks to sharpen students’ intellectual capacities in order to grasp the multifaceted nature of contemporary Korea-U.S. relations. Specifically, students will investigate the Korean War, R.O.K-U.S. alliance, the North Korean nuclear crises, anti-American sentiments in South Korea, South Korea immigrants in the United States, etc."
                        },
                        {
                            "과목 코드": "TIR4002",
                            "과목명": "Energy and International Politics(에너지와국제정치)",
                            "설명": "(Lecture 3hr.) 3cr. This course is designed to expose students to international politics with a focus on energy. By synthesizing diverse disciplines such as international relations, economics, security studies, and energy science, this course aims to nurture and equip energy experts through an interdisciplinary perspective."
                        },
                        {
                            "과목 코드": "TIR4003",
                            "과목명": "Environment and International Politics (환경과국제정치)",
                            "설명": "(Lecture 3hr.) 3cr. This course is intended to introduce students to global environmental politics. While examining such issues as climate change, environmental pollution and protection, resource depletion, and energy and food security, students will learn how they are intertwined with international politics."
                        },
                        {
                            "과목 코드": "TIR4004",
                            "과목명": "International Terrorism(국제테러리즘)",
                            "설명": "(Lecture 3hr.) 3cr. The purpose of this course is to familiarize students with key concepts, issues, history, and theories about international terrorism. While striving to look into the complexity of international terrorism, students, upon completion of this course, will be able to better conceptualize terrorism and counterterrorism in the context of today's international politics."
                        },
                        {
                            "과목 코드": "TIR4005",
                            "과목명": "Contemporary Europe (현대유럽의이해)",
                            "설명": "(Lecture 3hr.) 3cr. This course looks at historical events that have shaped Europe today as well as the political system, domestic politics, and foreign policy of individual European countries. The process of European integration into a social, economic and political community with a mutually shared identity will be also explored in this course."
                        },
                        {
                            "과목 코드": "TIR4006",
                            "과목명": "Contemporary North and South America(현대북남미의이해)",
                            "설명": "(Lecture 3hr.) 3cr. This is an interdisciplinary course designed to zero in on international politics of countries in North and South America. Specifically, this course helps students explore diverse issues such as migration, racial relations, political economy, colonialism, and nationalism in North and South America."
                        },
                        {
                            "과목 코드": "TIR4007",
                            "과목명": "International Relations of the Middle East (중동국제관계)",
                            "설명": "(Lecture 3hr.) 3cr. This course is designed to introduce students to the international relations of the Middle East. In this course, students investigate major political events that took place in the Middle East during the colonial, Cold War, and post-Cold War periods."
                        },
                        {
                            "과목 코드": "TIR4100",
                            "과목명": "Special Seminar on International Relations I (국제관계 세미나 I)",
                            "설명": "(Lecture 3hr.) 3cr. This course is designed to explore a specific issue related to international relations in depth. By taking this class, students will be able to develop a multifaceted perspective and cultivate an ability to conduct a thorough analysis of a particular topic in international relations."
                        },
                        {
                            "과목 코드": "TIR4101",
                            "과목명": "Special Seminar on International Relations II (국제관계 세미나 II)",
                            "설명": "(Lecture 3hr.) 3cr. This course is designed to explore a specific issue related to international relations in depth. By taking this class, students will be able to develop a multifaceted perspective and cultivate an ability to conduct a thorough analysis of a particular topic in international relations."
                        }
                    ]
                }
            },
            "International Commerce": {  
                "과목 정보": {
                    "Pre-Major Courses": [
                        {
                            "과목 코드": "TIS1001",
                            "과목명": "Introduction to International Relations (국제관계개론)",
                            "강의 시간": "Lecture 3hr.",
                            "학점": "3cr.",
                            "설명": "This is an introductory course on international relations, which provides students with a bird-eye-view of contemporary international affairs. By taking this course, students will obtain basic background knowledge about international relations, which will help build a solid foundation for advanced courses."
                        },
                        {
                            "과목 코드": "TIS1002",
                            "과목명": "Introduction to International Commerce (국제통상입문)",
                            "강의 시간": "Lecture 3hr.",
                            "학점": "3cr.",
                            "설명": "This introductory course serves as a foundational exploration of essential economic concepts crucial to the International Commerce program, enriched by insightful case studies. Students will be able to understand the decision making of consumers and firms, price theory across various market structures, measures and models of aggregate economic activities, and macroeconomic policy tools."
                        },
                        {
                            "과목 코드": "AAS1001",
                            "과목명": "Introduction to Asian Studies (아시아학개론)",
                            "강의 시간": "Lecture 3hr.",
                            "학점": "3cr.",
                            "설명": "This introductory course provides an overview of some of the key issues relating to Asia and Asian Studies. The course facilitates an interdisciplinary understanding of Asia's past and present through the region's geography, history, culture, economy and politics. Our approach enables students to acquire a foundational knowledge of Asia and prepares them for more advanced courses in the Asian Studies track and beyond."
                        },
                        {
                            "과목 코드": "TIS1005",
                            "과목명": "Mathematical Methods for International Commerce (국제통상수리기초)",
                            "강의 시간": "Lecture 3hr.",
                            "학점": "3cr.",
                            "설명": "This course equips students with fundamental mathematical methods essential for success in international economics, business, and finance studies, Covering introductory algebra, differentiation, matrix analysis, and optimization, students will develop a robust foundation in mathematical skills vital for analytical decision-making in global economy."
                        }
                    ],
                    "Major Required Courses": [
                        {
                            "과목 코드": "TIC2001",
                            "과목명": "Statistics for International Commerce (국제통상통계학)",
                            "강의 시간": "Lecture 3hr.",
                            "학점": "3cr.",
                            "설명": "Prerequisite: TIS1005 This course provides students with fundamental tools for comprehending and analyzing quantitative data, furnishing knowledge necessary for theories and applications in economics, business, and finance studies. To learn the application of key statistical concepts and theories, the course applies these principles to real-world business and economics data is a main focus. Students engage with topics such as organizing variables, numerical descriptive statistical measures, probability distributions, confidence interval estimation, hypothesis testing, and basic regression analysis."
                        },
                        {
                            "과목 코드": "TIC2002",
                            "과목명": "Microeconomics for International Commerce (국제통상미시경제학)",
                            "강의 시간": "Lecture 3hr.",
                            "학점": "3cr.",
                            "설명": "Prerequisite: TIS1002, TIS1005 This course establishes a foundational understanding of microeconomics, focusing on individual decision-making in consumption, saving, and labor supply, as well as firms’ decisions in production, employment, and investment across various market structures. The curriculum also covers pricing theory in the general equilibrium model and welfare economics, providing students with both theoretical insights and practical applications."
                        },
                        {
                            "과목 코드": "TIC3001",
                            "과목명": "Contemporary Issues in Global Economy (세계경제의최근이슈)",
                            "강의 시간": "Lecture 3hr.",
                            "학점": "3cr.",
                            "설명": "Prerequisite: TIS1002, TIC2005 This course introduces students to the latest challenges and dynamics shaping the global economy. Students explore current issues such as global financial crisis, trade tensions, technological advancements, climate change impact, geopolitical shifts, and many others. Through theoretical and empirical studies, students gain insights into the complexities and interconnectedness of contemporary global economic issues."
                        }
                    ],
                    "Major Core Courses": [
                        {
                            "과목 코드": "TIC2003",
                            "과목명": "Macroeconomics for International Commerce (국제통상거시경제학)",
                            "강의 시간": "Lecture 3hr.",
                            "학점": "3cr.",
                            "설명": "Prerequisite: TIS1002, TIS1005, TIC2002 This course offers students the macro aspects of economic analysis, focusing on national and global phenomena. Students will explore key macroeconomic indicators, including national income, unemployment, inflation, and economic growth. The course emphasizes understanding the role of government policies, both monetary and fiscal, in influencing these indicators. Through a combination of theoretical foundations and real-world applications, students will develop analytical skills to examine economic trends and policy implications."
                        },
                        {
                            "과목 코드": "TIC2004",
                            "과목명": "Korean Economy (한국경제론)",
                            "강의 시간": "Lecture 3hr.",
                            "학점": "3cr.",
                            "설명": "Prerequisite: TIS1002 This course offers a thorough examination of the structural evolution and growth factors shaping the Korean economy. Students delve into various dimensions, exploring industrial structure and policy dynamics, shifts in international trade patterns and policies, complexities of the labor market, and the historical context of economic policies. Through these explorations, students gain a comprehensive understanding of the economic landscape in Korea."
                        },
                        {
                            "과목 코드": "TIC2005",
                            "과목명": "International Economics (국제경제학)",
                            "강의 시간": "Lecture 3hr.",
                            "학점": "3cr.",
                            "설명": "Prerequisite: TIS1002, TIS1005, TIC2002 This introductory course explores the fundamental principles of international economics, focusing on the basic foundations of international trade and finance. Students will examine key theories in international trade, trade policies, balance of payments, foreign exchange markets, and open macroeconomic theories and policies. The course equips students with a solid understanding of these concepts and their practical applications, laying the groundwork for more advanced studies in international trade and finance programs."
                        },
                        {
                            "과목 코드": "TIC2006",
                            "과목명": "Principles of Accounting for International Commerce (국제통상회계원론)",
                            "강의 시간": "Lecture 3hr.",
                            "학점": "3cr.",
                            "설명": "Prerequisite: TIS1005, TIC2001 This course investigates the fundamental principles of accounting. Students will be able to understand essential accounting concepts and principles, gaining insights into their application in the process of compiling financial statements and the structure of accounting ledgers, providing a comprehensive understanding of financial information of firms."
                        },
                        {
                            "과목 코드": "TIC2007",
                            "과목명": "Principles of Marketing for International Commerce (국제통상마케팅원론)",
                            "강의 시간": "Lecture 3hr.",
                            "학점": "3cr.",
                            "설명": "Prerequisite: TIS1005, TIC2001, TIC2006 This foundational course explores the principles of marketing in business management. It aims to enhance students' understanding of key factors influencing marketing activities and to delve into the application of various marketing tools, including market research, product development, pricing strategies, distribution channels, physical distribution, sales promotion, advertising, sales force management, and organizational aspects relevant to effective marketing."
                        },
                        {
                            "과목 코드": "TIC2008",
                            "과목명": "Financial Management (재무관리)",
                            "강의 시간": "Lecture 3hr.",
                            "학점": "3cr.",
                            "설명": "Prerequisite: TIS1005, TIC2001 This course aims to provide students with fundamental knowledge in corporate financial management. The main topics include an overview of corporate finance, financial statement analysis, financial valuation, the valuation of representative assets, and basic tools for a firm's capital budgeting decisions."
                        },
                        {
                            "과목 코드": "TIC3002",
                            "과목명": "Research Method of Data Science (국제통상계량경제학)",
                            "강의 시간": "Lecture 3hr.",
                            "학점": "3cr.",
                            "설명": "Prerequisite: TIS1002, TIS1005, TIC2001 This course introduces the fundamentals of econometrics, a cornerstone of original data science, equipping students with quantitative research methods and data analysis skills. Topics cover bivariate and multivariate regressions, hypothesis testing, statistical inferences, and advanced methods such as time-series and panel data analysis. Through practical applications to examples in international economics and business, students will develop a strong foundation in econometric methods and gain hands-on experience in data analysis."
                        },
                        {
                            "과목 코드": "TIC3003",
                            "과목명": "Global Economic History (세계경제사)",
                            "강의 시간": "Lecture 3hr.",
                            "학점": "3cr.",
                            "설명": "Prerequisite: TIS1002, TIC2001, TIC2005 This course provides a comprehensive exploration of global economic history, tracing the evolution of economic systems, institutions, and key events that have shaped the modern global economy. Students will delve into the economic transformations over historical eras, examining the impact of trade, technology, industrialization, and economic ideologies. By analyzing the historical context, students gain insights into the complexities of economic development, globalization, and the lessons history offers for understanding today's economic challenges."
                        },
                        {
                            "과목 코드": "TIC3004",
                            "과목명": "International Business (국제경영학)",
                            "강의 시간": "Lecture 3hr.",
                            "학점": "3cr.",
                            "설명": "Prerequisite: TIC2005, TIC2006, TIC2007 This course explores the dynamics of international business, providing students with a foundational understanding of economic activities of multinational firms in the international context. Topics include multinational corporations, cross-border trade, global market entry strategies, and the impact of cultural, political, and economic factors on international business operations. Through case studies and real-world examples, students will develop insights into the complexities of managing businesses in the global arena."
                        },
                        {
                            "과목 코드": "TIC3005",
                            "과목명": "Investment Analysis (투자분석)",
                            "강의 시간": "Lecture 3hr.",
                            "학점": "3cr.",
                            "설명": "Prerequisite: TIC2001, TIC2008 This course immerses students in the fundamental theories and concepts essential for investment decisions. Exploring the risk-return tradeoff, the course delves into primary theories of investment, such as the modern portfolio theory, asset pricing models, and the efficient market hypothesis. Building on this theoretical foundation, the course seamlessly transitions to practical techniques, equipping students with valuable skills in assessing and managing investments, as well as insights into asset markets, valuation methods, and portfolio management strategies."
                        },
                        {
                            "과목 코드": "TIC3006",
                            "과목명": "Corporate Finance (기업재무)",
                            "강의 시간": "Lecture 3hr.",
                            "학점": "3cr.",
                            "설명": "This course is designed to help students understand corporate financial policies and decisions. It covers how firms strategically raise funds to finance their projects and discusses firms' capital structure decisions. Other topics in corporate financial policies include corporate payout policy, mergers and acquisitions (M&As), international corporate finance, real options, etc. Through an exploration of the fundamental theories and techniques related to corporate finance activities, the course aims to provide insights into firms’ financial decisions, including investment, funding strategies, and dividend policies."
                        }
                    ],
                    "Major Electives": [
                        {
                            "과목 코드": "TIC4001",
                            "과목명": "Global Political Economy (글로벌정치경제학)",
                            "강의 시간": "Lecture 3hr.",
                            "학점": "3cr.",
                            "설명": "This course surveys the theoretical and historical foundations of the political economy shaping the international economic order. Exploring the evolution of the international trade and financial system, students will engage with political economy models that underpin domestic politics and global economic dynamics. The course places a critical lens on contemporary international economic issues through the lens of political economy theory. By the course's conclusion, students will deeply understand the intricate relationship between politics and economics on the global stage."
                        },
                        {
                            "과목 코드": "TIC4002",
                            "과목명": "Computing for International Commerce (국제통상프로그래밍)",
                            "강의 시간": "Lecture 3hr.",
                            "학점": "3cr.",
                            "설명": "This course provides international commerce program students with foundational programming skills using Python and Julia. Emphasizing practical applications, students will learn to leverage programming for various purposes, including data analysis, econometric analysis, and data visualization. The course covers essential programming concepts, algorithmic thinking, and hands-on exercises to equip students with the skills necessary for solving real-world problems in the context of international commerce."
                        },
                        {
                            "과목 코드": "TIC4003",
                            "과목명": "International Trade Theory and Policy (국제무역론)",
                            "강의 시간": "Lecture 3hr.",
                            "학점": "3cr.",
                            "설명": "This course enables students to comprehend the comprehensive theoretical foundations and empirical evidence related to international trade and trade policies. Covered topics include comparative advantages, gains from trade, economic integration, offshoring, multinational corporations, tariff and non-tariff policies, and the political economy of protection. Through a blend of theory and real-world applications, students will gain the necessary knowledge and analytical skills to navigate the complexities of international trade theory and policy."
                        },
                        {
                            "과목 코드": "TIC4004",
                            "과목명": "International Finance Theory and Policy (국제금융론)",
                            "강의 시간": "Lecture 3hr.",
                            "학점": "3cr.",
                            "설명": "This course provides a systematic analysis of fundamental concepts in international finance and investment within the context of global financial markets. Topics include basic theories of international macroeconomics, crossborder financial flows and exchange rate determination, the international monetary system, and contemporary issues in the global financial system, such as financial crises, capital controls, and global financial regulation."
                        },
                        {
                            "과목 코드": "TIC4005",
                            "과목명": "International Economic Laws and Institutions (국제통상법과제도)",
                            "강의 시간": "Lecture 3hr.",
                            "학점": "3cr.",
                            "설명": "This course explores the legal framework of international economic relations, primarily developed post-1945 with relevant historical context. Primarily focusing on the rights and obligations outlined in international economic treaties, particularly trade agreements under the GATT and the WTO, the course delves into the historical background and structure of the GATT/WTO. Students will gain insights into the regulatory aspects of international economic relations among states and the functions of international organizations."
                        },
                        {
                            "과목 코드": "TIC4006",
                            "과목명": "Global Trade in the Digital World (디지털통상)",
                            "강의 시간": "Lecture 3hr.",
                            "학점": "3cr.",
                            "설명": "This advanced course explores the transformative impact of digital technologies on global trade. Students delve into e-commerce, digital platforms, and the evolving landscape of the global economy. Topics include measurement issues in digital trade, digital trade policies, and the challenges and opportunities in digitalized supply chains. Through case studies, students gain insights into how the digital revolution reshapes global trade dynamics and influences economic strategies worldwide."
                        },
                        {
                            "과목 코드": "TIC4007",
                            "과목명": "International Trade and Development (국제무역과경제발전)",
                            "강의 시간": "Lecture 3hr.",
                            "학점": "3cr.",
                            "설명": "This course delves into the intricate relationship between international trade and economic development. Students explore the theories, policies, and empirical evidence surrounding the impact of global trade on the development of nations. Topics include trade and poverty, the role of institutions, trade liberalization, and sustainable development. Through case studies and realworld examples, students gain a nuanced understanding of the complexities involved in leveraging international trade for fostering economic development."
                        },
                        {
                            "과목 코드": "TIC4008",
                            "과목명": "International Trade and Environment (국제무역과환경)",
                            "강의 시간": "Lecture 3hr.",
                            "학점": "3cr.",
                            "설명": "This course explores the complex interplay between international trade and environmental considerations, examining the policies, agreements, and challenges in the global economy. Students delve into topics such as the relationship between the WTO and Multilateral Environmental Agreements (MEAs), the impact of green taxes, issues of eco-dumping, and the role of product standards and eco-labeling. Through case studies and discussions, students gain insights into the complex dynamics of fostering sustainable trade practices while addressing environmental concerns on a global scale."
                        },
                        {
                            "과목 코드": "TIC4009",
                            "과목명": "International Trade and Immigration (국제무역과이주)",
                            "강의 시간": "Lecture 3hr.",
                            "학점": "3cr.",
                            "설명": "This course explores the dynamic interconnection between international trade and immigration, unraveling the economic intricacies and policy considerations that arise from the convergence of these two pivotal global phenomena. Students will scrutinize the reciprocal influences of international trade and immigration, analyzing their economic ramifications on countries, industries, and individuals. Topics encompass the impact of trade agreements on labor mobility, the economic consequences of immigration policies, the role of skilled and unskilled labor in global markets, and others."
                        },
                        {
                            "과목 코드": "TIC4010",
                            "과목명": "Financial Markets and Global Financial Institutions(금융시장과금융기관)",
                            "강의 시간": "Lecture 3hr.",
                            "학점": "3cr.",
                            "설명": "This course provides a comprehensive overview of the financial system, focusing on the roles and functions of financial markets such as money, capital, and stock markets in the context of a globalized economy. Topics include fundamental theories of financial intermediation, interest rates, bond pricing, and exchange rate determinations"
                        },
                        {
                            "과목 코드": "TIC4011",
                            "과목명": "Financial Accounting(재무회계)",
                            "강의 시간": "Lecture 3hr.",
                            "학점": "3cr.",
                            "설명": "This foundational financial accounting course provides students with essential principles and skills necessary for understanding and analyzing financial information. Topics include financial reporting, adjusting and closing journal entries, the statement of cash flows, short-term operating assets, accounting for income taxes, and stockholders’ equity. Additionally, the course incorporates an exploration of international financial reporting standards (IFRS), offering a well-rounded understanding of financial accounting principles in a global context."
                        },
                        {
                            "과목 코드": "TIC4012",
                            "과목명": "Derivatives (파생상품론)",
                            "강의 시간": "Lecture 3hr.",
                            "학점": "3cr.",
                            "설명": "This course offers students comprehensive knowledge of financial derivatives. It starts with an introduction to fundamental concepts and tools in derivatives, providing an overview of derivative markets. Moving forward, the course explores the pricing mechanisms of standard financial derivatives such as forwards, futures, options, and swaps. Special emphasis is placed on developing an understanding of how to effectively manage the risks associated with these financial instruments."
                        },
                        {
                            "과목 코드": "TIC4013",
                            "과목명": "Financial Risk Management (금융리스크관리)",
                            "강의 시간": "Lecture 3hr.",
                            "학점": "3cr.",
                            "설명": "This course aims to equip students with a comprehensive understanding of corporate risk management. Exploring various types of risks that corporations encounter, the course thoroughly examines both quantitative and qualitative frameworks and tools for analyzing and mitigating these risks. Through the examination of real-world business cases, students will gain practical insights into how risk management methodologies are applied in the practice of corporate management."
                        },
                        {
                            "과목 코드": "TIC4014",
                            "과목명": "International Negotiations (국제협상론)",
                            "강의 시간": "Lecture 3hr.",
                            "학점": "3cr.",
                            "설명": "This course enables students to understand the basic theories of strategic decisions and concepts of negotiations and practice strategies and tactics of negotiations in the context of various cross-border negotiations."
                        },
                        {
                            "과목 코드": "TIC4015",
                            "과목명": "International Marketing (국제마케팅론)",
                            "강의 시간": "Lecture 3hr.",
                            "학점": "3cr.",
                            "설명": "This course explores the dynamic realm of global markets to gain insights into fundamental concepts, strategies, and frameworks crucial for successful international marketing campaigns. Students will study topics such as market entry strategies, cultural considerations, global branding, product adaptation, and the influence of digital technologies. Through case studies and practical exercises, they will develop the skills needed to navigate diverse cultural landscapes, analyze market trends, and create effective international marketing plans."
                        },
                        {
                            "과목 코드": "TIC4016",
                            "과목명": "Global Business Strategy (글로벌경영전략)",
                            "강의 시간": "Lecture 3hr.",
                            "학점": "3cr.",
                            "설명": "This course explores how multinational corporations, operating globally, formulate strategies amidst managerial, financial, legal, and cultural constraints. Students gain insights into distinctions between global and domestic strategies, understanding the unique aspects of global strategies, value creation through globalization, optimal organizational structures, and responses to external shocks like pandemics or economic transformations."
                        },
                        {
                            "과목 코드": "TIR4002",
                            "과목명": "Energy and International Politics (에너지와국제정치)",
                            "강의 시간": "Lecture 3hr.",
                            "학점": "3cr.",
                            "설명": "This course is designed to expose students to international politics with a focus on energy. By synthesizing diverse disciplines such as international relations, economics, security studies, and energy science, this course aims to nurture and equip energy experts through an interdisciplinary perspective."
                        },
                        {
                            "과목 코드": "AAS3002",
                            "과목명": "Development Cooperation in Asia I (국제개발협력과 아시아 I)",
                            "강의 시간": "Lecture 3hr.",
                            "학점": "3cr.",
                            "설명": "This is the first of two-part course that surveys the key issues and processes of development cooperation in Asia. Within a broad context of the regional/international political economy, the course first takes up Japan's and of its donorship as the first non-Western OECD Development Assistance Committee member (1961). Through a perspective of critical development geography and political ecology, the course will explore Japan's development cooperation and its impact on Asian society as well as its own (n.b. AAS3018 Development cooperation in Asia II)"
                        },
                        {
                            "과목 코드": "AAS3003",
                            "과목명": "Comparative Research of Modern Asian Merchant Network (근대 아시아 상인 네트워크 연구)",
                            "강의 시간": "Lecture 3hr.",
                            "학점": "3cr.",
                            "설명": "This module aims at considering the characteristics of Asian capitalism by comparing major Asian merchant groups such as China, India, and Japan, who were active throughout Asia, and the networks they built in and outside the region during the modern times."
                        },
                        {
                            "과목 코드": "AAS3017",
                            "과목명": "Development Cooperation in Asia II (국제개발협력과 아시아 II)",
                            "강의 시간": "Lecture 3hr.",
                            "학점": "3cr.",
                            "설명": "This is the second of two-part course that surveys the key issues and processes of development cooperation in Asia. Building upon Development cooperation in Asia I, the course further explores development cooperation in Asia by focusing on both historical backdrops and political economic dynamics of ‘the rise of emerging economies in Asia in more recent years and their impacts in the region (and beyond)."
                        },
                        {
                            "과목 코드": "TIC4017",
                            "과목명": "Northeast Asian Economy (동북아경제론)",
                            "강의 시간": "Lecture 3hr.",
                            "학점": "3cr.",
                            "설명": "This course explores the pivotal economic dynamics of Northeast Asia, a region with the world's second and third-largest economies undergoing major transformations. Through understanding the history and current developments in this area, this course delves into the economies of China, Korea, Japan, and other countries in the region."
                        },
                        {
                            "과목 코드": "TIC4018",
                            "과목명": "Southeast Asian Economy(동남아경제론)",
                            "강의 시간": "Lecture 3hr.",
                            "학점": "3cr.",
                            "설명": "This course offers an in-depth understanding of Southeast Asian (ASEAN) economies in the evolving global business landscape. It explores their integration into the global market, emphasizing their strategic position in the supply chain. Focusing on key economies such as Singapore, Indonesia, Malaysia, Thailand, the Philippines, and Vietnam, the course examines business strategies in response to changing economic dynamics. Additionally, it contextualizes Southeast Asia's growth within the broader regions of East Asia and South Asia."
                        },
                        {
                            "과목 코드": "TIC4019",
                            "과목명": "US Economy (미국경제론)",
                            "강의 시간": "Lecture 3hr.",
                            "학점": "3cr.",
                            "설명": "This course provides a comprehensive exploration of the American economy, covering historical underpinnings, contemporary dynamics, essential concepts, government policies, market structures, and international trade history. Engaging discussions, research projects, and assessments offer a holistic learning experience, addressing labor markets, economic inequality, and emerging trends in one of the world's largest economies."
                        },
                        {
                            "과목 코드": "TIC4020",
                            "과목명": "European Economy (유럽경제론)",
                            "강의 시간": "Lecture 3hr.",
                            "학점": "3cr.",
                            "설명": "This course provides students with a comprehensive understanding of the European economy by delving into its historical evolution, key economic institutions, and contemporary dynamics. The curriculum covers the complexity of economic integration, explores the economic policy frameworks within the European Union (EU), and analyzes the role of European countries in the broader global economic landscape. Through a nuanced exploration of historical contexts and present-day economic challenges, students will gain valuable insights into the complex tapestry of the European economy."
                        },
                        {
                            "과목 코드": "TIC4021",
                            "과목명": "Economy in the MENA (중동경제론)",
                            "강의 시간": "Lecture 3hr.",
                            "학점": "3cr.",
                            "설명": "This course offers a profound exploration of the economic landscape in the Middle East and North Africa (MENA) region, providing students with a comprehensive understanding of its historical evolution, economic structures, and contemporary dynamics. With an emphasis on energy economic topics on the largest oil and gas exporters, students will delve into the region's pivotal role in global energy markets and the ongoing efforts for economic diversification."
                        },
                        {
                            "과목 코드": "TIC4022",
                            "과목명": "Sub-Saharan African Economy (아프리카경제론)",
                            "강의 시간": "Lecture 3hr.",
                            "학점": "3cr.",
                            "설명": "This course provides students with an insightful exploration of the dynamic economic landscape in Sub-Saharan Africa. Covering historical contexts, contemporary challenges, and opportunities, students will delve into critical aspects, including economic structures, trade dynamics, policy frameworks, and development challenges. The course emphasizes perspectives on sustainable growth and global integration, offering a comprehensive understanding of Sub-Saharan Africa's economic dynamics."
                        },
                        {
                            "과목 코드": "TIC4023",
                            "과목명": "Topics in International Trade (고급국제무역)",
                            "강의 시간": "Lecture 3hr.",
                            "학점": "3cr.",
                            "설명": "This course offers graduate-level advanced international trade theory and empirical studies."
                        },
                        {
                            "과목 코드": "TIC4024",
                            "과목명": "Topics in International Business (고급국제경영)",
                            "강의 시간": "Lecture 3hr.",
                            "학점": "3cr.",
                            "설명": "This course offers graduate-level advanced international business theory and empirical studies."
                        },
                        {
                            "과목 코드": "TIC4025",
                            "과목명": "Topics in International Finance (고급국제금융)",
                            "강의 시간": "Lecture 3hr.",
                            "학점": "3cr.",
                            "설명": "This course offers graduate-level advanced international finance theory and empirical studies."
                        },
                        {
                            "과목 코드": "TIC4026",
                            "과목명": "Topics in Empirical Finance (고급재무실증분석)",
                            "강의 시간": "Lecture 3hr.",
                            "학점": "3cr.",
                            "설명": "This course offers graduate-level advanced empirical finance studies."
                        },
                        {
                            "과목 코드": "TIC4027",
                            "과목명": "Topics in International Economic Law (고급국제경제법)",
                            "강의 시간": "Lecture 3hr.",
                            "학점": "3cr.",
                            "설명": "This course offers graduate-level advanced international economic law studies."
                        },
                        {
                            "과목 코드": "TIC4101",
                            "과목명": "International Trade Practice (국제무역현장실습)",
                            "강의 시간": "Lecture 3hr.",
                            "학점": "3cr.",
                            "설명": "This course offers practice in international trade."
                        },
                        {
                            "과목 코드": "TIC4102",
                            "과목명": "International Business Practice (국제경영현장실습)",
                            "강의 시간": "Lecture 3hr.",
                            "학점": "3cr.",
                            "설명": "This course offers practice in international business."
                        },
                        {
                            "과목 코드": "TIC4103",
                            "과목명": "International Finance Practice (국제금융현장실습)",
                            "강의 시간": "Lecture 3hr.",
                            "학점": "3cr.",
                            "설명": "This course offers practice in international finance."
                        }
                    ]
                }
            },
            "Asian Studies": {
                "과목 정보": {
                    "Pre-Major Courses(전공입문)": [
                        {
                            "과목 코드": "AAS1001",
                            "과목명": "Introduction to Asian Studies(아시아학 개론)",
                            "Lecture": "3hr.",
                            "Credits": "3cr.",
                            "Description": "This introductory course provides an overview of some of the key issues relating to Asia and Asian Studies. The course facilitates an interdisciplinary understanding of Asia's past and present through the region's geography, history, culture, economy and politics. Our approach enables students to acquire a foundational knowledge of Asia and prepares them for more advanced courses in the Asian Studies track and beyond."
                        },
                        {
                            "과목 코드": "TIS1001",
                            "과목명": "Introduction to International Relations(국제관계개론)",
                            "Lecture": "3hr.",
                            "Credits": "3cr.",
                            "Description": "This is an introductory course on international relations, which provides students with a bird-eye-view of contemporary international affairs. By taking this course, students will obtain basic background knowledge about international relations, which will help build a solid foundation for advanced courses."
                        },
                        {
                            "과목 코드": "TIS1002",
                            "과목명": "Introduction to International Commerce(국제통상입문)",
                            "Lecture": "3hr.",
                            "Credits": "3cr.",
                            "Description": "This introductory course serves as a foundational exploration of essential economic concepts crucial to the International Commerce program, enriched by insightful case studies. Students will be able to understand the decision making of consumers and firms, price theory across various market structures, measures and models of aggregate economic activities, and macroeconomic policy tools."
                        }
                    ],
                    "Major Core Courses(전공필수선택)": [
                        {
                            "과목 코드": "AAS2005",
                            "과목명": "Understanding Asian History(아시아역사의이해)",
                            "Lecture": "3hr.",
                            "Credits": "3cr.",
                            "Description": "This course provides the Asian historical trajectories and experiences of Asian people from the ancient times to the contemporary period. Students could understand the Asian regional order in a historical context and a comparative perspective."
                        },
                        {
                            "과목 코드": "AAS2015",
                            "과목명": "Understanding cooperation and conflict in and around Asia (세계 속 아시아의 협력과 갈등)",
                            "Lecture": "3hr.",
                            "Credits": "3cr.",
                            "Description": "This course is designed to discuss the contemporary issues of cooperation and conflicts in and around Asia. It aims to enhance the understanding of thematic issues and conceptual debates using diverse theoretical and historical perspectives."
                        }
                    ],
                    "Major Elective Courses (전공선택)": [
                        {
                            "과목 코드": "AAS2001",
                            "과목명": "Methods in Asian Studies in Practice(아시아 연구 방법론)",
                            "Lecture": "3hr.",
                            "Credits": "3cr.",
                            "Description": "This course is designed to provide a range of methodological approaches to the Asian Studies. Both qualitative and quantitative methodologies will be introduced as important tools for understanding Asia."
                        },
                        {
                            "과목 코드": "AAS2002",
                            "과목명": "Understanding Asian Cultures (아시아 문화의 이해)",
                            "Lecture": "3hr.",
                            "Credits": "3cr.",
                            "Description": "This course provides an introduction to the diverse cultures of Asia, focusing on their historical, social, and religious foundations. Students will explore key cultural practices, values, and beliefs across various Asian societies, fostering a deeper appreciation of the region's complexity. By the end of the course, students will gain a broad understanding of how these cultural elements influence contemporary Asian life and global interactions."
                        },
                        {
                            "과목 코드": "AAS2003",
                            "과목명": "Diplomacy in Asia (아시아의 외교)",
                            "Lecture": "3hr.",
                            "Credits": "3cr.",
                            "Description": "This course discusses the issues of diplomacy and foreign policy in the context of Asia. It aims to understand historical and contemporary institutions and laws of diplomacy, key diplomatic actors, and their decision-making processes, but also examine the diplomatic cultures and practices of key actors including leading and non-leading states."
                        },
                        {
                            "과목 코드": "AAS2004",
                            "과목명": "Art and Archeology of Korea (한국의 미술문화)",
                            "Lecture": "3hr.",
                            "Credits": "3cr.",
                            "Description": "This course examines Korean art's diversity and creativity by exploring each genre's development, including painting, crafts, and sculpture, from prehistoric times to modern times. By examining the changes in aesthetics, political and cultural patronage, and technological advancements, in a three-dimensional manner, we will explore the origins of Korean art and the driving forces of change."
                        },
                        {
                            "과목 코드": "AAS2006",
                            "과목명": "Modern Economic History of East Asia (동아시아 근대경제사)",
                            "Lecture": "3hr.",
                            "Credits": "3cr.",
                            "Description": "By comparing and analyzing the economies of East Asia (Northeast Asia and Southeast Asia), which have experienced modernity since the entry of European imperialism into Asia, this module considers the nature of the modern economy of imperialism/colonialism and its impact on East Asia regional context."
                        },
                        {
                            "과목 코드": "AAS2007",
                            "과목명": "Asia in a Globalizing World (글로벌리제이션 시대의 아시아)",
                            "Lecture": "3hr.",
                            "Credits": "3cr.",
                            "Description": "This is a survey course introducing key issues of globalisation with a particular focus on Asian response to such process. This module therefore aims to help students to start critically engaging with globalization in all its diverse forms of world-wide interconnection - and Asian stances and responses to the process(es). Such interconnections include economic ties, political ties, cultural ties, and social ties. These ties will be analysed independently, but at the same time will be understood in conjunction with one another to produce the overall effect that has been given the single label globalisation."
                        },
                        {
                            "과목 코드": "AAS2008",
                            "과목명": "Global Governance and Asia (글로벌 거버넌스와 아시아)",
                            "Lecture": "3hr.",
                            "Credits": "3cr.",
                            "Description": "This course aims to understand conceptual and practical debates about the structure and processes of global governance in diverse issue areas. It also sees Asia as a space for engaging global governance but also a space for creating alternative/complementary regional governance."
                        },
                        {
                            "과목 코드": "AAS2009",
                            "과목명": "Understanding Asia through its Geographies (지리적 사고로 바라보는 아시아)",
                            "Lecture": "3hr.",
                            "Credits": "3cr.",
                            "Description": "The course introduces some of the key issues of Asia through theoretical lenses in human geography to provide an opportunity for students to think critically about the production of knowledge on peoples and environments of Asia. By drawing upon the questions of differences, inequality and unevenness, the course explores the region with a particular emphasis on the changing relationships between societies and their environments. For that purpose, the course focuses on the economic, social and environmental transformations in Southeast Asia since 1945 with case studies from the field to examine the challenges posed by rapid urbanization, industrialization and rural agrarian transformation."
                        },
                        {
                            "과목 코드": "AAS2010",
                            "과목명": "Popular Culture in East Asia (동아시아의 대중문화)",
                            "Lecture": "3hr.",
                            "Credits": "3cr.",
                            "Description": "East Asian countries have been experiencing many cultural changes along with socio-economic development. Societies of each country are creating diverse cultures by accepting foreign cultures based on their unique traditional culture. In addition, the recent Korean Wave has a great influence on cultural changes in exchanges with Asia and the world. In this situation, understanding the popular culture of each East Asian country could be important to understand the society. This course aims to deepen understanding of East Asian countries through popular culture such as movies and music."
                        },
                        {
                            "과목 코드": "AAS2011",
                            "과목명": "Understanding Asian Civilization Through Enterprise and Urban Space (기업과 도시로 보는 아시아 문명)",
                            "Lecture": "3hr.",
                            "Credits": "3cr.",
                            "Description": "The Asian origins of businesses and cities, the two most important subjects of Western modern civilization, are explored, and the continuity of Asian civilization from ancient times to the present is studied through the entrepreneurial spirit of merchants and the formation of commercial cities."
                        },
                        {
                            "과목 코드": "AAS2012",
                            "과목명": "Understanding Contemporary Muslim World (아시아와 이슬람 세계)",
                            "Lecture": "3hr.",
                            "Credits": "3cr.",
                            "Description": "This course aims to provide an in-depth understanding of the societies and people practicing Islam, one of major religions in Asia."
                        },
                        {
                            "과목 코드": "AAS2013",
                            "과목명": "Asia's Environmental Issues through Cinema (영화로 보는 아시아의 환경이슈)",
                            "Lecture": "3hr.",
                            "Credits": "3cr.",
                            "Description": "This course introduces key environmental issues in Asia to students through selected films on related issues that navigates the relationship between humans and their environments."
                        },
                        {
                            "과목 코드": "AAS2014",
                            "과목명": "Life and Fun in Asia (아시아의 대중문화와 삶)",
                            "Lecture": "3hr.",
                            "Credits": "3cr.",
                            "Description": "This course tries to observe and discuss how cultural products such as pop music, games, movies, novels and cartoons as well as various activities for entertainment constitute the lives of people in the various parts of Asia."
                        },
                        {
                            "과목 코드": "AAS2016",
                            "과목명": "Politics in Southeast Asia (동남아 정치 개론)",
                            "Lecture": "3hr.",
                            "Credits": "3cr.",
                            "Description": "This course aims to provide an in-depth understanding of political and social issues in Southeast Asian countries with diverse theoretical perspectives in the field of comparative politics."
                        },
                        {
                            "과목 코드": "AAS2017",
                            "과목명": "Critical Thinking in Asian Studies (아시아학의 비판적 사고)",
                            "Lecture": "3hr.",
                            "Credits": "3cr.",
                            "Description": "This course is designed to facilitate students' abilities to think critically. Students will analyse a range of perspectives and engage with key texts and case studies in order to gain an understanding of the complexities of Asian societies. The course aims to facilitate students' capacity to critically assess both contemporary and historical events within the region."
                        },
                        {
                            "과목 코드": "AAS2018",
                            "과목명": "Critical Writing in Asian Studies (아시아학의 비판적 글쓰기)",
                            "Lecture": "3hr.",
                            "Credits": "3cr.",
                            "Description": "The objective of this course is to enhance students' writing abilities by facilitating their engagement with the critical analysis of historical, political, and cultural issues in Asia. Students will engage with a variety of texts and arguments, developing the ability to construct clear, coherent, and well-supported written responses. Upon completion of the course, students will be able to produce critical essays that demonstrate a comprehensive understanding of complex topics within the field of Asian Studies."
                        },
                        {
                            "과목 코드": "AAS2019",
                            "과목명": "Global Communication Ⅰ(글로벌 커뮤니케이션 Ⅰ)",
                            "Lecture": "3hr.",
                            "Credits": "3cr.",
                            "Description": "This course explores the dynamics of communication in a globalized world, focusing on how socio-cultural context and processes influence international interactions. By the end of the course, students will have developed a deeper understanding of effective communication across diverse settings in Asian societies."
                        },
                        {
                            "과목 코드": "AAS2020",
                            "과목명": "Global Communication Ⅱ (글로벌 커뮤니케이션 Ⅱ)",
                            "Lecture": "3hr.",
                            "Credits": "3cr.",
                            "Description": "This course explores the dynamics of communication in a globalized world, focusing on how political contexts and processes influence international interactions. By the end of the course, students will have developed a deeper understanding of effective communication across diverse settings in Asian societies."
                        },
                        {
                            "과목 코드": "AAS2021",
                            "과목명": "Global Communication Ⅲ (글로벌 커뮤니케이션 Ⅲ)",
                            "Lecture": "3hr.",
                            "Credits": "3cr.",
                            "Description": "This course explores the dynamics of communication in a globalized world, focusing on how economic contexts and processes influence international interactions. By the end of the course, students will have developed a deeper understanding of effective communication across diverse settings in Asian societies."
                        },
                        {
                            "과목 코드": "AAS2022",
                            "과목명": "Understanding Chinese Politics (중국 정치의 이해)",
                            "Lecture": "3hr.",
                            "Credits": "3cr.",
                            "Description": "This course is designed to focus on the political and social issues pertaining to China that is grounded in a range of theoretical perspectives drawn from the field of Asian studies. It considers the transnational and international dynamics at play across the region's numerous countries."
                        },
                        {
                            "과목 코드": "AAS2023",
                            "과목명": "Understanding Middle East(중동 사회의 이해)",
                            "Lecture": "3hr.",
                            "Credits": "3cr.",
                            "설명": "This course aims to provide an in-depth understanding of political and social issues in Middle East with diverse theoretical perspectives in the field of Asian studies. It also discusses transnational and international dynamics across numerous countries within the region."
                        },
                        {
                            "과목 코드": "AAS2024",
                            "과목명": "Critical Issues in Contemporary Asia Ⅰ (현대 아시아의 중요 이슈들 Ⅰ)",
                            "Lecture": "3hr.",
                            "Credits": "3cr.",
                            "설명": "This course examines the key challenges facing contemporary Asia. Through case studies and discussions on socio-political changes and processes, students will gain an understanding of the impact these have on Asian societies. By the end of the course, students will have a comprehensive appreciation of the critical issues shaping modern Asia and its structural traits."
                        },
                        {
                            "과목 코드": "AAS2025",
                            "과목명": "Critical Issues in Contemporary Asia Ⅱ (현대 아시아의 중요 이슈들 Ⅱ)",
                            "Lecture": "3hr.",
                            "Credits": "3cr.",
                            "설명": "This course examines the key challenges facing contemporary Asia. Through case studies and discussions on development and socio-ecological changes and processes, students will gain an understanding of the impact these have on Asian societies. By the end of the course, students will have a comprehensive appreciation of the critical issues shaping modern Asia and its structural traits."
                        },
                        {
                            "과목 코드": "TIR2007",
                            "과목명": "International Relations of East Asia (동아시아국제관계)",
                            "Lecture": "3hr.",
                            "Credits": "3cr.",
                            "설명": "This course is designed to help students deepen their understanding of international relations in East Asia. While discussing politics, the economy, identity, history, and strategies, students will be able to depict a broader but more detailed picture of current international politics in the East Asian region."
                        },
                        {
                            "과목 코드": "TIR2009",
                            "과목명": "Chinese Foreign Policy (중국외교정책)",
                            "Lecture": "3hr.",
                            "Credits": "3cr.",
                            "설명": "The primary goal of this course is to acquaint students with Chinese foreign policy. The issues that will be covered in this course include, but are not limited to, the history of Chinese foreign policy, Sino-U.S. rivalry, U.S.-China-Russian trilateral relations, China's exchanges with the Korean peninsula, and the Taiwan Strait crises."
                        },
                        {
                            "과목 코드": "TIC2004",
                            "과목명": "Korean Economy (한국경제론)",
                            "Lecture": "3hr.",
                            "Credits": "3cr.",
                            "설명": "This course offers a thorough examination of the structural evolution and growth factors shaping the Korean economy. Students delve into various dimensions, exploring industrial structure and policy dynamics, shifts in international trade patterns and policies, complexities of the labor market, and the historical context of economic policies. Through these explorations, students gain a comprehensive understanding of the economic landscape in Korea.",
                            "비고": "Prerequisite: TIS1002"
                        },
                        {
                            "과목 코드": "AAS3001",
                            "과목명": "Asian Studies Practice (아시아학의실제)",
                            "Lecture": "3hr.",
                            "Credits": "3cr.",
                            "설명": "This is a class in the form of an invited lecture to hear the importance of understanding and knowledge about Asia from experts who majored in Asian studies and are currently working at the forefront of their respective fields."
                        },
                        {
                            "과목 코드": "AAS3002",
                            "과목명": "Development Cooperation in Asia Ⅰ (국제개발협력과 아시아 Ⅰ)",
                            "Lecture": "3hr.",
                            "Credits": "3cr.",
                            "설명": "This is the first of two-part course that surveys the key issues and processes of development cooperation in Asia. Within a broad context of the regional/international political economy, the course first takes up Japan's and of its donorship as the first non-Western OECD Development Assistance Committee member (1961). Through a perspective of critical development geography and political ecology, the course will explore Japan's development cooperation and its impact on Asian society as well as its own."
                        },
                        {
                            "과목 코드": "AAS3003",
                            "과목명": "Comparative Research of Modern Asian Merchant Network (근대 아시아 상인 네트워크 비교연구)",
                            "Lecture": "3hr.",
                            "Credits": "3cr.",
                            "설명": "This module aims at considering the characteristics of Asian capitalism by comparing major Asian merchant groups such as China, India, and Japan, who were active throughout Asia, and the networks they built in and outside the region during the modern times."
                        },
                        {
                            "과목 코드": "AAS3004",
                            "과목명": "Art of India and Southeast Asia (인도·동남아시아의 미술)",
                            "Lecture": "3hr.",
                            "Credits": "3cr.",
                            "설명": "This course examines the art of India, which influenced the other regions of Asia, and also explores the art of the traditional Southeast Asian period, whose civilization began with Indianization. It will examine the similarities and differences between the art and society of India and those of Southeast Asia to create an objective and rational understanding of Asian art and culture."
                        },
                        {
                            "과목 코드": "AAS3005",
                            "과목명": "Understanding Contemporary Southeast Asia(동남아시아 현대 사회의 이해)",
                            "Lecture": "3hr.",
                            "Credits": "3cr.",
                            "설명": "Southeast Asian countries are not only geographically close to Korea, but also have rapidly expanded their relationship with Korea in terms of politics, economy, and people-to-people exchanges. As the relationship between Korea and Southeast Asia will continue to expand in the future, understanding Southeast Asian society is useful and urgent. This course attempts to lay the foundation for the development of bilateral relations by understanding the modern society of Southeast Asia."
                        },
                        {
                            "과목 코드": "AAS3006",
                            "과목명": "Asia in the Anthropocene (인류세 시대의 아시아)",
                            "Lecture": "3hr.",
                            "Credits": "3cr.",
                            "설명": "The course explores Asia within some of the key debates on Anthropocene from a critical geographical perspective. The course focuses on the ranges of issues including the poverty-environment nexus, environment as a source of livelihood and good health, sustainable resource use, the adverse impacts of climate change on the poor and vulnerable in developing countries, conservation as protection from emerging zoonotic diseases and the future pandemic-led crises."
                        },
                        {
                            "과목 코드": "AAS3007",
                            "과목명": "Japan's Environments and Environmentalisms (일본의 환경과 환경문제)",
                            "Lecture": "3hr.",
                            "Credits": "3cr.",
                            "설명": "The course provides an introduction to some of the central debates on the environmental issues in an advanced economy, Japan which has undergone a process of late industrialisation. Being guided by the key theoretical concepts in environmental politics and political ecology, the ways in which the uneven and unjust distribution of risks and power impacts upon the various stakeholders’ ability to respond to those problems will be examined. While considering the Japan's physical (natural) environment which presents multiple hazards of both natural and human origin, the course also explores how cultural and man-made attributes impact upon attitudes and behaviour towards the environment, and a civil society's participation in environmental movements (at both global and national level). The course uses various visual materials including Myazaki Hayao's animation and the Japanese films."
                        },
                        {
                            "과목 코드": "AAS3008",
                            "과목명": "Understanding South Asia (남아시아의 정치와 사회)",
                            "Lecture": "3hr.",
                            "Credits": "3cr.",
                            "설명": "This course aims to provide an in-depth understanding of political and social issues in South Asia with diverse theoretical perspectives in the field of Asian studies. It also discusses transnational and international dynamics across numerous countries within the region."
                        },
                        {
                            "과목 코드": "AAS3009",
                            "과목명": "Migration in Asia (아시아의 이주현상)",
                            "Lecture": "3hr.",
                            "Credits": "3cr.",
                            "설명": "The course explores key debates and issues concerning migration in Asia. It focuses on the phenomena of both international and intraregional migration in the contemporary Asia."
                        },
                        {
                            "과목 코드": "AAS3010",
                            "과목명": "Chinese Art and Culture (중국의 미술과 문화)",
                            "Lecture": "3hr.",
                            "Credits": "3cr.",
                            "설명": "This course explores the historical development of Chinese art and how the political, ideological, and religious contexts prompted the transformation of the arts. Furthermore, it examines the ways in which Chinese art communicated and interacted with other regions of Asia through its art. This provides a foundation for understanding China's cultural influence in Asia and how China has historically accommodated other regional cultures."
                        },
                        {
                            "과목 코드": "AAS3011",
                            "과목명": "Overseas Chinese and the Dynamic of World history (화인의 이주와 세계사의 변동)",
                            "Lecture": "3hr.",
                            "Credits": "3cr.",
                            "설명": "Explore the dynamics of the World history from a different point of view through the historical experience of the world's largest immigrant group, the overseas Chinese who have taken root in various parts of the world."
                        },
                        {
                            "과목 코드": "AAS3012",
                            "과목명": "Comparative History of China and Southeast Asia (중국-동남아시아 비교관계사)",
                            "Lecture": "3hr.",
                            "Credits": "3cr.",
                            "설명": "Compares China, the oldest civilization in the world, with Southeast Asia, one of the youngest civilizations, and aims to examine the relationship between the two regions since ancient times."
                        },
                        {
                            "과목 코드": "AAS3013",
                            "과목명": "Material Culture and Exchange of the East and the West (물질문화와 동서교류)",
                            "Lecture": "3hr.",
                            "Credits": "3cr.",
                            "설명": "This course aims to provide an overview of the cultural exchange between the East and the West through material culture. It would be helpful for students to understand when and how Asia met the West."
                        },
                        {
                            "과목 코드": "AAS3014",
                            "과목명": "Empire and Asia (제국과 아시아)",
                            "Lecture": "3hr.",
                            "Credits": "3cr.",
                            "설명": "This course investigates empire as the most important variable in the formation of modern Asian regional order. Students will gain a better understanding of Asia today as an interaction between the various empires introduced in this course and the responses and changes in each region of Asia."
                        },
                        {
                            "과목 코드": "AAS3015",
                            "과목명": "Art and Culture in Japan (일본의 미술과 문화)",
                            "Lecture": "3hr.",
                            "Credits": "3cr.",
                            "설명": "This course covers a long period of Japanese art and culture from ancient to modern times. Students can be introduced to the international influence and uniqueness of Japanese art."
                        },
                        {
                            "과목 코드": "AAS3016",
                            "과목명": "Minorities in Asia (아시아와 마이노리티)",
                            "Lecture": "3hr.",
                            "Credits": "3cr.",
                            "설명": "Asia - one of the most ethnically-diverse regions in the world- is the site of large indigenous minority populations as well as non-indigenous minorities through rapidly expanding regular and irregular migrant flows. This course explores key debates and issues of such minority groups in Asia."
                        },
                        {
                            "과목 코드": "AAS3017",
                            "과목명": "Development Cooperation in Asia Ⅱ (국제개발협력과 아시아 Ⅱ)",
                            "Lecture": "3hr.",
                            "Credits": "3cr.",
                            "설명": "This is the second of two-part course that surveys the key issues and processes of development cooperation in Asia. Building upon Development cooperation in Asia I, the course further explores development cooperation in Asia by focusing on both historical backdrops and political economic dynamics of ‘the rise of emerging economies in Asia in more recent years and their impacts in the region (and beyond)."
                        },
                        {
                            "과목 코드": "AAS3018",
                            "과목명": "Introduction to Anthropology of Asia (아시아 인류학 개론)",
                            "Lecture": "3hr.",
                            "Credits": "3cr.",
                            "설명": "The course provides an introduction to the anthropological study of Asia. Through ethnographic case studies, students will explore the everyday lives, practices, and beliefs of various Asian communities. By the end of the course, students will have acquired a foundational understanding of the anthropological methods used to study Asia and the region's rich cultural complexities."
                        },
                        {
                            "과목 코드": "AAS3019",
                            "과목명": "Exploring Asia in Korea (한국 속의 아시아 현장)",
                            "Lecture": "3hr.",
                            "Credits": "3cr.",
                            "설명": "This course offers opportunities of field-based research to explore diverse Asian communities and their cultural contributions in Korea. The course includes visits to cultural sites, communities and institutions, with the objective of observing the manner in which different Asian cultures are represented and integrated into Korean society. Upon completion of the course, students will have developed a more nuanced comprehension of the multifaceted, multicultural landscape of Korea and its longstanding interconnections with the broader Asian context."
                        },
                        {
                            "과목 코드": "AAS3020",
                            "과목명": "Art History of Asia (아시아 미술사)",
                            "Lecture": "3hr.",
                            "Credits": "3cr.",
                            "설명": "This course explores the distinctive civilizations in various Asian countries, focusing on the art of each region, and also examines the nature of each region's cultural heritage. It examines how each region's unique history and culture are expressed through visual culture to understand how unique aesthetics have been expressed across regions and races, and how they have been exchanged and transformed."
                        },
                        {
                            "과목 코드": "TIR3002",
                            "과목명": "International Politics of the Korea Peninsula(한반도국제관계)",
                            "Lecture": "3hr.",
                            "Credits": "3cr.",
                            "설명": "International politics surrounding the Korean peninsula is exceptionally dynamic and complex. Students will investigate the intense international contests that have taken place on, around, and for the Korean peninsula since the nineteenth century."
                        },
                        {
                            "과목 코드": "TIR3008",
                            "과목명": "South-North Korean Relations (남북한관계)",
                            "Lecture": "3hr.",
                            "Credits": "3cr.",
                            "설명": "In this course, students will examine inter-Korean relations from the latter half of the 20th century to the present. Focusing mainly on the aftermaths of war and division, this course offers knowledge about key issues in international affairs focused on modern Korea."
                        },
                        {
                            "과목 코드": "AAS4001",
                            "과목명": "Issues and Perspectives in Contemporary Asia (현대 아시아 국제이슈 특강)",
                            "Lecture": "3hr.",
                            "Credits": "3cr.",
                            "설명": "This course is designed to examine the key transnational and international political and social issues of our time. It aims for training students to critically observe and engage these issues from both dominant and alternative perspectives."
                        },
                        {
                            "과목 코드": "AAS4002",
                            "과목명": "Gender in Asia (아시아와 젠더)",
                            "Lecture": "3hr.",
                            "Credits": "3cr.",
                            "설명": "The course discusses various gender issues in Asia. It examines key debates and issues of gender in Asia in the context of labour, migrations, and mobilities."
                        },
                        {
                            "과목 코드": "AAS4003",
                            "과목명": "Asian Studies in Comparison (비교아시아학)",
                            "Lecture": "3hr.",
                            "Credits": "3cr.",
                            "설명": "As an advanced course for Asian Studies majors, it provides students opportunity to get a first-hand experience at the Asian scene through students-driven experiments connecting various Asian regions and topics."
                        },
                        {
                            "과목 코드": "AAS4004",
                            "과목명": "Special Lecture on Asian Studies (아시아 인류학 특강)",
                            "Lecture": "3hr.",
                            "Credits": "3cr.",
                            "설명": "This special lecture module provides in-depth study of the anthropology of Asia."
                        },
                        {
                            "과목 코드": "AAS4005",
                            "과목명": "Special Lecture on Asian Culture (아시아 문화 특강)",
                            "Lecture": "3hr.",
                            "Credits": "3cr.",
                            "설명": "This special lecture module provides in-depth study of the culture of Asia."
                        },
                        {
                            "과목 코드": "AAS4006",
                            "과목명": "Special Lecture on Asian History (아시아 역사 특강)",
                            "Lecture": "3hr.",
                            "Credits": "3cr.",
                            "설명": "This special lecture-based module provides an in-depth study of the history of Asia."
                        },
                        {
                            "과목 코드": "AAS4007",
                            "과목명": "Special Lecture on Asian Politics (아시아 정치 특강)",
                            "Lecture": "3hr.",
                            "Credits": "3cr.",
                            "설명": "This special lecture-based module provides an in-depth study of the politics in and of Asia."
                        },
                        {
                            "과목 코드": "AAS4008",
                            "과목명": "Special Lecture on Asia's Development Issues (아시아 개발 특강)",
                            "Lecture": "3hr.",
                            "Credits": "3cr.",
                            "설명": "This special lecture-based module provides an in-depth study of development issues in and from Asia."
                        },
                        {
                            "과목 코드": "AAS4009",
                            "과목명": "Special Lecture on Development Cooperation in Asia (아시아 개발협력 특강)",
                            "Lecture": "3hr.",
                            "Credits": "3cr.",
                            "설명": "This special lecture-based module provides an in-depth study of development cooperation in and from Asia."
                        },
                        {
                            "과목 코드": "AAS4010",
                            "과목명": "Special Lecture on Geography of Asia (아시아 지리 특강)",
                            "Lecture": "3hr.",
                            "Credits": "3cr.",
                            "설명": "This special lecture-based module provides an in-depth study of the human geography of Asia."
                        },
                        {
                            "과목 코드": "AAS4011",
                            "과목명": "Methods in Asian Studies in Theory (아시아학 방법론 심화)",
                            "Lecture": "3hr.",
                            "Credits": "3cr.",
                            "설명": "This course introduces theoretical frameworks and research methodologies used in Asian Studies. Students will critically engage with various methodological approaches to better understand the diverse ways of Asia Studies. By the end of the course, students will be able to apply these theoretical methods to analyze complex issues in Asian Studies."
                        },
                        {
                            "과목 코드": "AAS4012",
                            "과목명": "Research Practice in Asian Studies (아시아학 연습 Ⅰ)",
                            "Lecture": "3hr.",
                            "Credits": "3cr.",
                            "설명": "The objective of this course is to equip students with the skills to conduct independent research on a range of topics related to art and cultural heritage history of Asia. This will be achieved by introducing them to the various methodologies available, including both qualitative and quantitative approaches. Upon completion of the course, students will have acquired the capacity to devise research projects that will contribute to the advancement of knowledge in the field of Asian Studies."
                        },
                        {
                            "과목 코드": "AAS4013",
                            "과목명": "Research Practice in Asian Studies Ⅱ (아시아학 연습 Ⅱ)",
                            "Lecture": "3hr.",
                            "Credits": "3cr.",
                            "설명": "The objective of this course is to equip students with the skills to conduct independent research on a range of topics related to the Asian history. This will be achieved by introducing them to the various methodologies available, including both qualitative and quantitative approaches. Upon completion of the course, students will have acquired the capacity to devise research projects that will contribute to the advancement of knowledge in the field of Asian Studies."
                        },
                        {
                            "과목 코드": "AAS4014",
                            "과목명": "Research Practice in Asian Studies Ⅲ (아시아학 연습 Ⅲ)",
                            "Lecture": "3hr.",
                            "Credits": "3cr.",
                            "설명": "The objective of this course is to equip students with the skills to conduct independent research on a range of topics related to development and environmental issues in Asia. This will be achieved by introducing them to the various methodologies available, including both qualitative and quantitative approaches. Upon completion of the course, students will have acquired the capacity to devise research projects that will contribute to the advancement of knowledge in the field of Asian Studies."
                        },
                        {
                            "과목 코드": "AAS4015",
                            "과목명": "Research Practice in Asian Studies Ⅳ (아시아학 연습 Ⅳ)",
                            "Lecture": "3hr.",
                            "Credits": "3cr.",
                            "설명": "The objective of this course is to equip students with the skills to conduct independent research on a range of topics related to diplomacy and international relations in and around Asia. This will be achieved by introducing them to the various methodologies available, including both qualitative and quantitative approaches. Upon completion of the course, students will have acquired the capacity to devise research projects that will contribute to the advancement of knowledge in the field of Asian Studies."
                        },
                        {
                            "과목 코드": "AAS4016",
                            "과목명": "Understanding Contemporary China (현대 중국사회의 이해)",
                            "Lecture": "3hr.",
                            "Credits": "3cr.",
                            "설명": "The objective of this course is to provide an introduction to the diverse social and cultural aspects of contemporary China. In addition, it seeks to examine the national and transnational dynamics of Chinese lives in and around the Asian region."
                        },
                        {
                            "과목 코드": "AAS4017",
                            "과목명": "Popular Culture of China (중국 대중문화 개론)",
                            "Lecture": "3hr.",
                            "Credits": "3cr.",
                            "설명": "This course explores the evolution and impact of Chinese popular culture, including music, film, television series, and social media. The course will enable students to analyse the manner in which contemporary cultural trends reflect social changes, political influences and globalisation within China. Upon completion of the course, students will have acquired a more nuanced understanding of the role Chinese pop culture plays in shaping national identity and its influence on global culture."
                        },
                        {
                            "과목 코드": "TIR4007",
                            "과목명": "International Relations of the Middle East (중동국제관계)",
                            "Lecture": "3hr.",
                            "Credits": "3cr.",
                            "설명": "This course is designed to introduce students to the international relations of the Middle East. In this course, students investigate major political events that took place in the Middle East during the colonial, Cold War, and post-Cold War periods."
                        },
                        {
                            "과목 코드": "TIC4017",
                            "과목명": "Northeast Asian Economy (동북아경제론)",
                            "Lecture": "3hr.",
                            "Credits": "3cr.",
                            "설명": "This course explores the pivotal economic dynamics of Northeast Asia, a region with the world's second and third-largest economies undergoing major transformations. Through understanding the history and current developments in this area, this course delves into the economies of China, Korea, Japan, and other countries in the region."
                        },
                        {
                            "과목 코드": "TIC4018",
                            "과목명": "Southeast Asian Economy (동남아경제론)",
                            "Lecture": "3hr.",
                            "Credits": "3cr.",
                            "설명": "This course offers an in-depth understanding of Southeast Asian (ASEAN) economies in the evolving global business landscape. It explores their integration into the global market, emphasizing their strategic position in the supply chain. Focusing on key economies such as Singapore, Indonesia, Malaysia, Thailand, the Philippines, and Vietnam, the course examines business strategies in response to changing economic dynamics. Additionally, it contextualizes Southeast Asia's growth within the broader regions of East Asia and South Asia."
                        },
                        {
                            "과목 코드": "TIC4021",
                            "과목명": "Economy in the MENA (중동경제론)",
                            "Lecture": "3hr.",
                            "Credits": "3cr.",
                            "설명": "This course offers a profound exploration of the economic landscape in the Middle East and North Africa (MENA) region, providing students with a comprehensive understanding of its historical evolution, economic structures, and contemporary dynamics. With an emphasis on energy economic topics on the largest oil and gas exporters, students will delve into the region's pivotal role in global energy markets and the ongoing efforts for economic diversification."
                        }
                    ]
                }
            },
            "글로벌경제전공": {
                "과목 정보":{
                    "전공입문": [
                        {
                            "과목 코드": "GIS1001",
                            "과목명": "글로벌융학학부입문",
                            "강의시간": "1시간",
                            "학점": "1학점",
                            "내용": "신입생이 입학한 첫 학기에 개설되며 학과장 주관으로 글로벌융합학부의 세부 전공에 대해 소개하는 시간을 갖는다. 전공 주임 교수가 세부 전공에 대한 소개를 담당하고, 각 전공과 관련된 내부 교수와 외부 인사들의 특강으로 세부 전공에 대한 이해를 돕는다."
                        },
                        {
                            "과목 코드": "GIS2001",
                            "과목명": "미시경제원론",
                            "강의시간": "3시간",
                            "학점": "3학점",
                            "내용": "경제생활의 기본적 현상과 개별 경제 주체인 가계, 기업의 경제활동의 동기 및 행동을 이해하고 이를 기초로 시장경제에서의 가격 결정과 자원 배분이 어떻게 이루어지는가를 학습한다. 또한 개별 시장의 특성 및 어떤 조건하에서 자원 배분의 효율성이 달성될 수 있는가에 대해서 다룬다."
                        },
                        {
                            "과목 코드": "GIS2002",
                            "과목명": "회계학",
                            "강의시간": "3시간",
                            "학점": "3학점",
                            "내용": "기업경영의 언어라고 할 수 있는 회계정보를 작성하는 데에 사용되는 회계개념, 회계원칙을 회계정보 처리 과정의 최종 산물인 재무제표를 작성하기 위하여 사용되는 회계기법의 기본원리와 회계장부의 구조를 공부한다."
                        },
                        {
                            "과목 코드": "GIS2003",
                            "과목명": "The Art of Storytelling",
                            "강의시간": "3시간",
                            "학점": "3학점",
                            "내용": "본 과목은 콘텐츠 창작의 기본이 되는 스토리 아트와 스토리텔링 크래프트를 집중적으로 다룬다. 스토리 개발, 다양한 목적 및 매체에 따른 스토리텔링 전략과 방법 탐색, 창의적인 적용과 응용의 과정을 실습한다."
                        },
                        {
                            "과목 코드": "GIS2004",
                            "과목명": "인공지능프로그래밍",
                            "강의시간": "3시간",
                            "학점": "3학점",
                            "내용": "인공지능 관련 전문성을 높이고 인재양성을 위해 전 신입생 대상으로 제공되는 과목으로, 인공지능 프로그래밍의 기초를 학습한다."
                        },
                        {
                            "과목 코드": "GIS2005",
                            "과목명": "거시경제원론",
                            "강의시간": "3시간",
                            "학점": "3학점",
                            "내용": "각 경제단위(가계, 기업, 정부, 해외부문)들의 행동과 그 상호관계를 통해 국민경제전체를 살펴본다. 국민소득, 소비, 저축, 투자, 고용, 물가, 통화, 임금, 이자 등의 거시경제변수의 결정과정과 변동을 분석한다. 성장과 경기변동, 경제문제 해결을 위한 정부의 역할 등을 다룬다."
                        }
                    ],
                    "전공필수": [
                        {
                            "과목 코드": "GEC3001",
                            "과목명": "미시경제학",
                            "강의시간": "3시간",
                            "학점": "3학점",
                            "내용": "시장경제 하에서 자원배분, 소득분배가 결정되는 원리를 배운다. 수요와 공급의 개념, 소비자균형과 시장수요, 생산과 생산비의 이론, 생산물시장과 생산요소시장의 균형, 그리고 일반균형·후생경제학의 기초이론을 다룬다."
                        },
                        {
                            "과목 코드": "GKE3002",
                            "과목명": "거시경제학",
                            "강의시간": "3시간",
                            "학점": "3학점",
                            "내용": "국가 경제의 여러 현상, 특히 국민소득의 변동, 경제성장, 인플레이션, 실업률 등을 이해하기 위해 집계변수들의 동향을 파악하고 이에 대한 분석의 틀을 제공하는 한편, 경기변동을 완화하고 지속적인 경제성장을 달성하기 위한 정부의 정책 수단과 방법, 효과, 한계 등을 논의한다."
                        }
                    ],
                    "전공선택": [
                        {
                            "과목 코드": "GKE4001",
                            "과목명": "화폐와금융",
                            "강의시간": "3시간",
                            "학점": "3학점",
                            "내용": "채권, 주식, 대출시장의 미시적 기초와 이론적 기반을 소개하고, 금융기관의 경영관리와 위험관리에 관한 기초이론을 공부한다. 또한 중앙은행의 기능과 화폐수요와 공급, 금융정책이론과 전달경로 등 금융정책의 기본적인 내용들을 다룬다."
                        },
                        {
                            "과목 코드": "GKE4002",
                            "과목명": "국제무역이론",
                            "강의시간": "3시간",
                            "학점": "3학점",
                            "내용": "국제무역의 순수이론과 무역정책을 공부한다. 비교생산비설과 요소 부존론에 의한 무역이론과 그 실증적 검정, 국제무역과 경제성장의 관계를 다룬다. 또한 독점적 경쟁시장에서의 무역의 이득에 대해서도 학습한다. 무역정책은, 관세 및 비관세 장벽의 경제적 효과, 수출보조금의 경제적 효과, 경제통합이론 등을 다룬다."
                        },
                        {
                            "과목 코드": "GKE4003",
                            "과목명": "국제금융이론",
                            "강의시간": "3시간",
                            "학점": "3학점",
                            "내용": "국제수지의 이론과 정책 및 국제통화제도와 관련된 제 문제를 공부한다. 외환시장과 환율의 결정이론, 상이한 환율제도 하에서의 국제수지의 조정이론과 조정정책, 그리고 국제통화 제도와 국제금융시장의 기능과 전개과정을 다룬다."
                        },
                        {
                            "과목 코드": "GKE4004",
                            "과목명": "산업조직론",
                            "강의시간": "3시간",
                            "학점": "3학점",
                            "내용": "산업의 구조적 특성에 따라 기업들의 전략적 선택과 시장에서의 경쟁 성과가 어떻게 달라지는지를 연구한다. 즉 완전 경쟁, 독점, 과점 산업에서 기업들이 선택하는 가격, 산출량, 투자, 광고, R&D 등 다양한 전략들을 다루고, 이들이 산업의 경제적 성과에 미치는 영향을 이론 및 실증적으로 분석한다. 그리고 산업성과를 개선하는 다양한 정책의 방안을 모색한다."
                        },
                        {
                            "과목 코드": "GKE4005",
                            "과목명": "계량경제학",
                            "강의시간": "3시간",
                            "학점": "3학점",
                            "내용": "통계적 추정 및 가설검정 방법을 기초로 선형 회귀분석 및 그 응용에 관한 이론을 공부한다. 모형의 선정, 다중공선성, 이분산, 자기상관 등 실제 경제자료를 다룰 때 발생할 수 있는 문제점을 파악하고 이러한 문제를 해결할 수 있는 능력을 배양한다."
                        },
                        {
                            "과목 코드": "GKE4006",
                            "과목명": "한국경제의발전",
                            "강의시간": "3시간",
                            "학점": "3학점",
                            "내용": "한국경제의 구조적 변천과 성장요인을 산업구조, 소비, 투자, 금융, 재정 그리고 무역과 국제수지 등의 각 분야별로 연구한다."
                        },
                        {
                            "과목 코드": "GKE4007",
                            "과목명": "경제개발이론",
                            "강의시간": "3시간",
                            "학점": "3학점",
                            "내용": "본 강좌는 어떠한 요소가 한 국가를 발전하게 만드는지, 또한 어떠한 이유로 한 국가의 발전이 저해되는지를 경제학 이론과 실증경제 분석을 통하여 검토한다. 향후 세계은행 등 국제개발기구, 국내 개발원조센터, 및 대학원 진학을 목표로 하는 학생들을 염두해두고 디자인되어 집중적인 토론 수업으로 진행된다."
                        },
                        {
                            "과목 코드": "GKE4008",
                            "과목명": "경제수학",
                            "강의시간": "3시간",
                            "학점": "3학점",
                            "내용": "경제이론과 통계학을 이해하기 위해 필요한 행렬과 벡터, 미분과 적분의 개념을 소개한다. 또한 경제 모형의 분석에 필요한 편미분과 최적화 문제의 해법을 다룬다. 엄격한 증명보다는 경제학 문제들을 통하여 수학의 실제적인 적용 방법을 학습하는 것을 목적으로 한다."
                        }
                    ]
                }
            },
            "글로벌경영전공": {
                "과목 정보": {
                    "전공입문": [
                        {
                        "과목 코드": "GIS1001",
                        "과목명": "글로벌융학학부입문",
                        "강의시간": "1시간",
                        "학점": "1학점",
                        "내용": "신입생이 입학한 첫 학기에 개설되며 학과장 주관으로 글로벌융합학부의 세부 전공에 대해 소개하는 시간을 갖는다. 전공 주임 교수가 세부 전공에 대한 소개를 담당하고, 각 전공과 관련된 내부 교수와 외부 인사들의 특강으로 세부 전공에 대한 이해를 돕는다."
                        },
                        {
                        "과목 코드": "GIS2001",
                        "과목명": "미시경제원론",
                        "강의시간": "3시간",
                        "학점": "3학점",
                        "내용": "경제생활의 기본적 현상과 개별 경제 주체인 가계, 기업의 경제활동의 동기 및 행동을 이해하고 이를 기초로 시장경제에서의 가격 결정과 자원 배분이 어떻게 이루어지는가를 학습. 또한 개별 시장의 특성 및 어떤 조건하에서 자원 배분의 효율성이 달성될 수 있는가에 대해서 다룬다."
                        },
                        {
                        "과목 코드": "GIS2002",
                        "과목명": "회계학",
                        "강의시간": "3시간",
                        "학점": "3학점",
                        "내용": "기업경영의 언어라고 할 수 있는 회계정보를 작성하는 데에 사용되는 회계개념, 회계원칙을 회계정보 처리 과정의 최종 산물인 재무제표를 작성하기 위하여 사용되는 회계기법의 기본원리와 회계장부의 구조를 공부한다."
                        },
                        {
                        "과목 코드": "GIS2003",
                        "과목명": "The Art of Storytelling",
                        "강의시간": "3시간",
                        "학점": "3학점",
                        "내용": "본 과목은 콘텐츠 창작의 기본이 되는 스토리 아트와 스토리텔링 크래프트를 집중적으로 다룬다. 스토리 개발, 다양한 목적 및 매체에 따른 스토리텔링 전략과 방법 탐색, 창의적인 적용과 응용의 과정을 실습한다."
                        },
                        {
                        "과목 코드": "GIS2004",
                        "과목명": "인공지능프로그래밍",
                        "강의시간": "3시간",
                        "학점": "3학점",
                        "내용": "인공지능 관련 전문성을 높이고 인재양성을 위해 전 신입생 대상으로 제공되는 과목으로, 인공지능 프로그래밍의 기초를 학습한다."
                        },
                        {
                        "과목 코드": "GIS2005",
                        "과목명": "거시경제원론",
                        "강의시간": "3시간",
                        "학점": "3학점",
                        "내용": "각 경제단위(가계, 기업, 정부, 해외부문)들의 행동과 그 상호관계를 통해 국민경제전체를 살펴본다. 국민소득, 소비, 저축, 투자, 고용, 물가, 통화, 임금, 이자 등의 거시경제변수의 결정과정과 변동을 분석한다. 성장과 경기변동, 경제문제 해결을 위한 정부의 역할 등을 다룬다."
                        }
                    ],
                    "전공필수": [
                        {
                        "과목 코드": "GMT3001",
                        "과목명": "경영과돈의흐름",
                        "강의시간": "3시간",
                        "학점": "3학점",
                        "내용": "기업의 재무활동에 관한 기본적인 이론과 기법을 습득하게 함을 목적으로 하며, 그 주요 내용은 투자결정, 자금조달 결정 및 배당정책을 다룬다."
                        },
                        {
                        "과목 코드": "GMT3002",
                        "과목명": "경영과고객",
                        "강의시간": "3시간",
                        "학점": "3학점",
                        "내용": "시장경제, 시장 환경과 조건 등 마케팅활동에 영향을 주는 제 요소를 이해시키고 이에 적합한 마케팅 도구인 시장조사, 제품, 가격, 판매경로, 물적 유통, 판매촉진과 광고, 판매원 관리 및 판매조직 등의 적용을 연구한다."
                        },
                        {
                        "과목 코드": "GMT3003",
                        "과목명": "경영과사람",
                        "강의시간": "3시간",
                        "학점": "3학점",
                        "내용": "최근에 개발된 행동과학의 의사결정이론에 대한 통찰력을 배양하려는 것으로 전통적인 경영관리론의 개념과 내용의 개관, 발전되고 있는 경영과학 이론의 구체화 및 행동과학의 개념·이론 등을 최고 경영자의 입장에서 다룬다"
                        },
                        {
                        "과목 코드": "GMT3004",
                        "과목명": "경영과운영",
                        "강의시간": "3시간",
                        "학점": "3학점",
                        "내용": "기업 경영의 운영 기능을 기업 목적 및 경영정책에 대응하여 어떻게 합리적으로 수행하고 생산 활동의 합리화를 기할 것인가를 경영관리자의 입장에서 공부한다. 그 내용에는 공정관리, 품질관리, 작업관리, 설비관리, 운반관리, 재고관리 등이 포함된다."
                        }
                    ],
                    "전공선택": [
                        {
                        "과목 코드": "GMT4001",
                        "과목명": "기업과글로벌화",
                        "강의시간": "3시간",
                        "학점": "3학점",
                        "내용": "상품, 용역, 기술, 자본, 인력의 국제적 이전에 관련된 기업의 국제 경영활동을 다룬다. 특히 국제경영환경, 기업의 국제화 전략 및 국제경영의 부분별 제 전략을 중점적으로 연구한다."
                        },
                        {
                        "과목 코드": "GMT4002",
                        "과목명": "기업과디지털화",
                        "강의시간": "3시간",
                        "학점": "3학점",
                        "내용": "기업 경영정보시스템의 분석 및 설계에서 이용되는 개념에 대한 이해 및 방법을 소개한다. 그 주요 내용으로는 경영정보시스템 계획, 시스템 개발 전략, 시스템 분석 및 설계방법, 파일설계 그리고 비용추정 및 통제이다. 기업의 환경 및 업무활동을 분석하고 상황에 맞는 경영정보시스템을 설계하는 방법을 배운다."
                        },
                        {
                        "과목 코드": "GMT4003",
                        "과목명": "기업과사회환경",
                        "강의시간": "3시간",
                        "학점": "3학점",
                        "내용": "변화가 심한 경영환경에서 특정 기업이 어떻게 다른 기업보다 우월한 성과를 거두는 지에 대한 학문적 분석의 틀을 제공한다. 환경변화와 전략 경영의 의의, 산업구조분석, 가치사슬분석, 기업 자원, 능력 및 기업 핵심역량의 분석, 전략적 대안의 개발, 경쟁우위의 분석, 전략적 제휴, 인수합병전략, 기업의 혁신전략 등을 다룬다."
                        },
                        {
                        "과목 코드": "GMT4004",
                        "과목명": "기업과서비스화",
                        "강의시간": "3시간",
                        "학점": "3학점",
                        "내용": "기업의 서비스는 인간 지향적이며, 일반적으로 고객들은 서비스과정에 참여하고, 흔히 종업원과 시설에 직접적인 상호작용을 갖는다. 서비스기업의 운영관리를 운영뿐만 아니라 전략, 기술, 마케팅, 그리고 조직의 통합적 관점에서 연구한다."
                        },
                        {
                        "과목 코드": "GMT4005",
                        "과목명": "기업과기술사업화(캡스톤디자인)",
                        "강의시간": "3시간",
                        "학점": "3학점",
                        "내용": "기업의 전략적 기술경영 및 사업화를 위한 제품 및 서비스의 개발, 생산, 판매의 전과정을 경영학적 관점에서 이론적 개념과 사례를 중심으로 학습한다. 본 교과목을 통해 기술에 가치를 부여하고 시장성을 분석하여 수익 창출을 하는 일련의 사업화 과정을 체계적으로 분석하고 관리하는 능력을 함양시키는 기회를 갖는다."
                        },
                        {
                        "과목 코드": "GMT4006",
                        "과목명": "통계학",
                        "강의시간": "3시간",
                        "학점": "3학점",
                        "내용": "통계학의 기본개념과 방법론의 소개, 확률과 표분의 기초이론, 통계학 추정방법, 가설의 검증, 상관관계, 회귀방정식과 시계열 분석을 내용으로 한다."
                        }
                    ]
                }            
            },
            "글로벌미디어전공": {
                "과목 정보": {
                    "전공입문":[
                        {
                            "과목 코드": "GIS1001",
                            "과목명": "글로벌융학학부입문",
                            "강의시간": "1시간",
                            "학점": "1학점",
                            "내용": "신입생이 입학한 첫 학기에 개설되며 학과장 주관으로 글로벌융합학부의 세부 전공에 대해 소개하는 시간을 갖는다. 전공 주임 교수가 세부 전공에 대한 소개를 담당하고, 각 전공과 관련된 내부 교수와 외부 인사들의 특강으로 세부 전공에 대한 이해를 돕는다."
                        },
                        {
                            "과목 코드": "GIS2001",
                            "과목명": "미시경제원론",
                            "강의시간": "3시간",
                            "학점": "3학점",
                            "내용": "경제생활의 기본적 현상과 개별 경제 주체인 가계, 기업의 경제활동의 동기 및 행동을 이해하고 이를 기초로 시장경제에서의 가격 결정과 자원 배분이 어떻게 이루어지는가를 학습. 또한 개별 시장의 특성 및 어떤 조건하에서 자원 배분의 효율성이 달성될 수 있는가에 대해서 다룬다."
                        },
                        {
                            "과목 코드": "GIS2003",
                            "과목명": "The Art of Storytelling",
                            "강의시간": "3시간",
                            "학점": "3학점",
                            "내용": "본 과목은 콘텐츠 창작의 기본이 되는 스토리 아트와 스토리텔링 크래프트를 집중적으로 다룬다. 스토리 개발, 다양한 목적 및 매체에 따른 스토리텔링 전략과 방법 탐색, 창의적인 적용과 응용의 과정을 실습한다."
                        },
                        {
                            "과목 코드": "GIS2004",
                            "과목명": "인공지능프로그래밍",
                            "강의시간": "3시간",
                            "학점": "3학점",
                            "내용": "인공지능 관련 전문성을 높이고 인재양성을 위해 전 신입생 대상으로 제공되는 과목으로, 인공지능 프로그래밍의 기초를 학습한다."
                        }
                    ],
                    "전공필수":[
                        {
                            "과목 코드": "GME3001",
                            "과목명": "미디어콘텐츠기획기초",
                            "강의시간":"3시간",
                            "학점":"3학점",
                            "내용": "수강생들은 본 과목을 통해 주요 미디어 콘텐츠(예. 영상, 웹툰 등)의 유형에 대해 학습하고, 콘텐츠 제작을 위한 기획에 필요한 요소들에 대해 학습한다. 콘텐츠 기획을 위한 기본적인 이론적 이해와 더불어 특정 유형의 콘텐츠를 직접 기획해 볼 수 있는 기회를 제공한다."
                        },
                        {
                            "과목 코드":"GME3002",
                            "과목명": "영상제작기초",
                            "강의시간":"3시간",
                            "학점":"3학점",
                            "내용": "콘텐츠의 가장 기본인 영상제작의 이론부터 실제 제작까지를 다룬다. 영상 콘텐츠 기획, 연출, 촬영, 편집에 이르는 전 과정을 실질적으로 습득하고 이를 온라인에서 공유하는 경험을 함으로써 최종적으로 영상 포트폴리오를 만드는 것을 목표로 한다."
                        },
                        {
                            "과목 코드":"GME3003",
                            "과목명": "PR의이해",
                            "강의시간":"3시간",
                            "학점":"3학점",
                            "내용": "Public Relations의 Public 즉 공중에는 소비자, 사원, 주주, 시민단체, 지역주민, 여론주도층, 언론, 정부 등이 있으며, 이들 공중의 지지를 받아 조직을 유지 발전시키는 전략커뮤니케이션이 바로 공중관계(public relations)이다. 공중관계 능력에 따라 조직(기업, 정부, 학교, 협회, 병원 등)의 성패가 좌우될 정도로 공중관계의 영향은 날로 커지고 있다. 이 과목은 다양한 경영 분야로 진출 전략적 커뮤니케이션을 수행함으로써 자신의 직업 능력을 확대하는 데 도움을 주며, 동시에 공중관계 전문가로 발돋움 하는 길을 안내한다."
                        }
                    ],
                    "전공선택": [
                        {
                            "과목 코드": "GME3000",
                            "과목명": "미디어커뮤니케이션입문",
                            "강의시간": "3시간",
                            "학점": "3학점",
                            "내용": "본 과목은 디지털 시대를 배경으로 다양한 미디어와 커뮤니케이션 현상을 탐구한다. 미디어와 커뮤니케이션의 기본 개념과 주요 이론을 학습하고, 이를 현실과 연계하여 비판적 사고 능력을 함양한다. 또한, 팀 프로젝트와 발표를 통해 다양한 문화적 시각을 공유하고, 글로벌 맥락에서의 미디어 환경 변화와 커뮤니케이션 현상을 학문적 관점에서 접근한다."
                        },
                        {
                            "과목 코드": "GME4001",
                            "과목명": "가상현실과미디어",
                            "강의시간": "3시간",
                            "학점": "3학점",
                            "내용": "오늘날 미디어 환경의 변화로 인해 급부상하고 있는 가상현실 콘텐츠에 대해서 이론적인 측면에서 접근하며, 이를 토대로 기획하고 제작할 수 있는 능력을 배양하는 기회를 제공하도록 한다. 이 과목의 수강을 통해 변화하는 미디어 환경에 걸맞은 넓고 깊은 시각을 가질 수 있도록 한다."
                        },
                        {
                            "과목 코드": "GME4002",
                            "과목명": "시네마틱스토리텔링",
                            "강의시간": "3시간",
                            "학점": "3학점",
                            "내용": "이 수업은 영화 언어의 특수성을 탐구하는 것을 목표로 한다. 주요 작가와 감독들의 작품 사례를 통해 조명, 편집, 사운드 등 영화 테크닉이 서사 구축 및 캐릭터 창조에 어떠한 역할을 하는지 구체적으로 살펴본다. 학생들은 이러한 연구와 실습을 통해 보다 ‘영화적인’ 시나리오를 개발하는 역량을 기른다."
                        },
                        {
                            "과목 코드": "GME4003",
                            "과목명": "장면연출",
                            "강의시간": "3시간",
                            "학점": "3학점",
                            "내용": "연극영화 연출의 기초를 공부한다. 이를 위해 연출의 기본 원리들을 체계적으로 살펴보고, 이에 기초해 짧은 장면들을 실제로 연출하는 실습을 병행한다."
                        },
                        {
                            "과목 코드": "GME4004",
                            "과목명": "UI/UX디자인기획",
                            "강의시간": "3시간",
                            "학점": "3학점",
                            "내용": "본 과목은 사용자 인터페이스(UI)와 사용자 경험(UX) 디자인 과정에 대해 개괄하며, 미디어 인터페이스 개발에 있어 사용자 인터페이스와 사용자 경험 디자인을 기획하는 데 있어서 요구되는 기본적인 개념과 테크닉을 배울 수 있는 기회를 제공한다. 본 과목을 통해 수강생은 미디어 인터페이스를 기획, 개발 그리고 평가하는 데 필요한 기술을 습득한다."
                        },
                        {
                            "과목 코드": "GME4005",
                            "과목명": "영상제작심화",
                            "강의시간": "3시간",
                            "학점": "3학점",
                            "내용": "본 과목은 [영상제작기초]를 이수한 학생들이 보다 심화된 단계에서 작품제작에 임할 수 있도록 한다. 작품의 기획과 캐스팅 그리고 촬영과 편집을 아우르는 전 과정에서 기초 과목보다 전문성을 갖고 진행된다."
                        },
                        {
                            "과목 코드": "GME4006",
                            "과목명": "인터액티브미디어콘텐츠기획",
                            "강의시간": "3시간",
                            "학점": "3학점",
                            "내용": "본 과목은 인터랙티브 기술을 통한 창의력 향상을 목표로 한다. 수강생들은 인터랙티브와 관련된 기본적인 이론을 학습하고 인터랙티브 미디어 콘텐츠 제작을 위한 기획에 참여한다. 수강생들은 Unity와 같은 프로그래밍 도구를 사용하여 인터랙티브 미디어 콘텐츠 개발을 위한 기본적인 테크닉을 습득한다."
                        },
                        {
                            "과목 코드": "GME4007",
                            "과목명": "광고와소비자심리",
                            "강의시간": "3시간",
                            "학점": "3학점",
                            "내용": "광고와 홍보를 포함, 다양한 전략적 커뮤니케이션을 기획하고 실행함에 있어 더욱 실질적이고 지속적인 효과가 확보되기 위해서는 그 대상(Target)에 대한 분석이 필수적이다. 소비자 심리 관련 최신 사례와 이론 등을 폭넓게 다룬다."
                        },
                        {
                            "과목 코드": "GME4008",
                            "과목명": "PR글쓰기와실무",
                            "강의시간": "3시간",
                            "학점": "3학점",
                            "내용": "PR실무에서 중요한 보도자료, 팩트 쉿(fact sheet) 작성 등을 통해 전통적인 PR글쓰기 능력을 배운다. 한편, 뉴스를 보는 시대에서 SNS를 하는 시대가 되었다. 이에 PR실무에서의 소셜미디어 글쓰기 등 온라인 매체를 활용한 PR글쓰기 능력도 제고 할 수 있도록 한다. 스토리텔링, 영상, SNS 콘텐츠, 어드버토리얼, CEO 스피치 등 각종 테크닉을 실습한다."
                        },
                        {
                            "과목 코드": "GME4009",
                            "과목명": "스토리와캐릭터",
                            "강의시간": "3시간",
                            "학점": "3학점",
                            "내용": "극적 잠재성이 큰 콘텐츠를 개발한다. 신화, 역사 등의 원천소스를 망라하여 공연, 영화, 게임 등으로 발전시킬 수 있는 스토리와 캐릭터를 발굴하고 가공한다."
                        },
                        {
                            "과목 코드": "GME4010",
                            "과목명": "광고와디자인기획",
                            "강의시간": "3시간",
                            "학점": "3학점",
                            "내용": "본 수업은 창의력을 바탕으로 이미지와 메시지 등의 요소를 활용하여 실제로 광고를 기획하는 실습형 수업이다. 수업을 통해 제작된 광고에 대해 현장 전문가의 평가를 바탕으로 수정하고 최종 결과물을 만드는 과정에서 실제 현장에서도 적용가능한 실천적 지식과 경험 그리고 스킬을 습득한다."
                        }
                    ]
                }
            }
        }
    }
}